{
  "policyUpi": "PC-AWS-S3-1113",
  "policyId": "48744a10-f434-4930-b9ff-4cf8903f50ff",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS CloudTrail S3 bucket encrypted with Customer Managed Key (CMK) that is scheduled for deletion",
  "description": "AWS CloudTrail S3 buckets encrypted with Customer Managed Keys (CMKs) scheduled for deletion pose a significant security risk. The deletion of these CMKs prevents decryption of CloudTrail logs, hindering security monitoring and incident response.\n\nCloudTrail logs, stored in S3 buckets and encrypted using CMKs, record crucial account activity. Deleting the CMK renders these logs inaccessible, effectively concealing malicious actions such as data exfiltration or lateral movement. An attacker could leverage this misconfiguration to evade detection and maintain persistence.\n\nCompromised CloudTrail logs due to CMK deletion leave organizations blind to security incidents. Maintaining the integrity and accessibility of CloudTrail logs is crucial for effective threat detection and incident response. Data breaches, compromised credentials, and ransomware attacks could go undetected, leading to significant financial and reputational damage.\n\nTo mitigate this risk, implement robust CMK lifecycle management. Regularly review scheduled CMK deletions, ensuring that they are intentional and necessary. Establish a process for securely rotating CMKs and consider using AWS KMS key rotation capabilities. Implement logging and alerting for CMK deletion attempts to provide timely notification of suspicious activity.",
  "rule.criteria": "41e48e40-d886-49c9-b522-2d41dff8b574",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name= 'aws-s3api-get-bucket-acl' AND json.rule = (sseAlgorithm contains \"aws:kms\" or sseAlgorithm contains \"aws:kms:dsse\") and kmsMasterKeyID exists as X; config from cloud.resource where api.name = 'aws-kms-get-key-rotation-status' AND json.rule = keyMetadata.keyManager equal ignore case CUSTOMER and keyMetadata.keyState contains PendingDeletion as Y; config from cloud.resource where api.name = 'aws-cloudtrail-describe-trails' as Z; filter '$.X.kmsMasterKeyID contains $.Y.key.keyArn and $.Z.s3BucketName equals $.X.bucketName'; show X;",
  "recommendation": "The following steps are recommended to cancel KMS CMKs which are scheduled for deletion used by the S3 bucket\n\n1. Log in to the AWS Console and navigate to the 'S3' service.\n2. Click on the S3 bucket reported in the alert.\n3. Click on the 'Properties' tab.\n4. Under the 'Default encryption' section, click on the KMS key link in 'Encryption key ARN'.\n5. Navigate to Key Management Service (KMS).\n6. Click on 'Key actions' dropdown.\n7. Click on 'Cancel key deletion'.\n8. Click on 'Enable'.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CSA CCM v4.0.12",
    "DORA",
    "HIPAA",
    "HITRUST CSF v.11.2.0",
    "Microsoft Cloud Security Benchmark v1",
    "NIST 800-53 Rev 5",
    "NYDFS 23 CRR-NY 500.0",
    "PCI DSS v4.0.1",
    "SOC 2",
    "TX-RAMP Level 1",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}