{
  "policyUpi": "PC-ALL-ALL-1020",
  "policyId": "229d957a-d47b-41ea-8fb2-4f65a9cdcd1b",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS EC2 instance with network path from the internet (0.0.0.0/0) on Admin ports",
  "description": "AWS EC2 instances accessible from the internet (0.0.0.0/0) on ports 22 and 3389 are highly susceptible to unauthorized access. This misconfiguration exposes critical systems to attacks.\n\nThese instances, open to the public internet on ports commonly used for remote management (SSH on port 22 and RDP on port 3389), present a large attack surface. Malicious actors can easily exploit this, attempting brute-force attacks or leveraging known vulnerabilities to gain unauthorized access. Successful compromise could lead to data breaches, system control, or lateral movement within the infrastructure.\n\nThe impact of this misconfiguration includes data loss, service disruption, and significant financial losses due to remediation efforts and potential regulatory fines. Restricting access to only trusted IP addresses significantly reduces the attack surface and minimizes the risk of unauthorized access.\n\nMitigate this risk by implementing strict inbound security group rules. Allow traffic only from specific, known IP addresses or ranges. Consider using alternative, less common ports, and enable multi-factor authentication for remote access. Regularly review and update security group rules to reflect changing needs and security best practices.",
  "rule.criteria": "2a69fea0-3867-47f9-a253-af35de0f522e",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'Instance' and dest.cloud.type = 'AWS' and dest.resource.state = 'Active' and protocol.ports in ( 'tcp/22', 'tcp/3389' )",
  "recommendation": "Restrict Internet exposure of reported EC2 instances based on your business requirements by modifying security group rules to the trusted IP address\n\n1. Sign in to the AWS Console\n2. Navigate to EC2 Dashboard\n3. Identify the reported EC2 instances that you want to restrict public access\n4. Go to the 'Security' tab\n5. For each security group listed under the 'Security group' section\n6. Select 'Edit inbound rules'\n7. Update inbound rules that allow unrestricted access (0.0.0.0/0) such that the CIDR range 0.0.0.0/0 does not exist\n8. Click 'Save rules' to apply the changes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}