{
  "policyUpi": "PC-AWS-IAM-160",
  "policyId": "2c0a0859-928e-46e7-a3b0-bf5af467b444",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "medium",
  "name": "AWS root account configured with Virtual MFA",
  "description": "This policy identifies AWS root accounts which are configured with Virtual MFA. Root is an important role in your account and root accounts must be configured with hardware MFA. Hardware MFA adds extra security because it requires users to type a unique authentication code from an approved authentication device when they access AWS websites or services.",
  "rule.criteria": "135e90ac-fbe6-45f9-aa8c-a4de7f4d15be",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name = 'aws-iam-list-virtual-mfa-devices' AND json.rule = 'serialNumber contains root-account-mfa-device and user.arn contains root'",
  "recommendation": "To manage MFA devices for your AWS account, you must use your root user credentials to sign in to AWS. You cannot manage MFA devices for the root user while signed in with other credentials.\n\n1. Sign in to the AWS Management Console with your root user credentials\n2. Go to IAM\n3. Do one of the following:\nOption 1: Choose Dashboard, and under Security Status, expand Activate MFA on your root account.\nOption 2: On the right side of the navigation bar, select your account name, and then choose My Security Credentials. If necessary, choose Continue to Security Credentials. Then expand the Multi-Factor Authentication (MFA) section on the page.\n4. Choose Manage MFA or Activate MFA, depending on which option you chose in the preceding step.\n5. In the wizard, choose A hardware MFA device and then choose Next Step.\n6. If you have U2F security key as hardware MFA device, choose U2F security key and click on Continue. Next plug the USB U2F security key, when setup is complete click on Close.\nIf you have any other hardware MFA device, choose Other hardware MFA device option\na. In the Serial Number box, type the serial number that is found on the back of the MFA device.\nb. In the Authentication Code 1 box, type the six-digit number displayed by the MFA device. You might need to press the button on the front of the device to display the number.\nc. Wait 30 seconds while the device refreshes the code, and then type the next six-digit number into the Authentication Code 2 box. You might need to press the button on the front of the device again to display the second number.\nd. Choose Next Step. The MFA device is now associated with the AWS account.\n\nImportant:\nSubmit your request immediately after generating the authentication codes. If you generate the codes and then wait too long to submit the request, the MFA device successfully associates with the user but the MFA device becomes out of sync. This happens because time-based one-time passwords (TOTP) expire after a short period of time. If this happens, you can resync the device.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM)",
    "APRA (CPS 234) Information Security",
    "AWS Foundational Security Best Practices standard",
    "AWS Well-Architected Framework",
    "Australian Cyber Security Centre (ACSC) Essential Eight",
    "Australian Energy Sector Cyber Security Framework (AESCSF)",
    "Brazilian Data Protection Law (LGPD)",
    "CIS Controls v7.1",
    "CIS Controls v8",
    "CIS v1.2.0 (AWS)",
    "CIS v1.3.0 (AWS)",
    "CIS v1.4.0 (AWS)",
    "CIS v1.5.0 (AWS) - Level 2",
    "CIS v2.0.0 (AWS) - Level 2",
    "CRI Profile v1.2.1",
    "CSA CCM v.4.0.1",
    "CSA CCM v.4.0.6",
    "CSA CCM v3.0.1",
    "Cybersecurity Maturity Model Certification (CMMC) v.1.02",
    "Cybersecurity Maturity Model Certification (CMMC) v.2.0 (Level 2)",
    "FFIEC",
    "Framework for Adoption of Cloud Services by SEBI Regulated Entities (REs)",
    "GDPR",
    "HITRUST CSF v.9.6.0",
    "HITRUST CSF v9.3",
    "HITRUST v.9.4.2",
    "ISO 27002:2022",
    "ISO/IEC 27001:2022",
    "ISO/IEC 27002:2013",
    "ISO/IEC 27017:2015",
    "ISO/IEC 27018:2019",
    "MAS TRM 2021",
    "MLPS 2.0 (Level 2)",
    "NIST 800-171 Rev1",
    "NIST 800-53 Rev 5",
    "NIST 800-53 Rev4",
    "NIST CSF",
    "NIST SP 800-171 Revision 2",
    "NIST SP 800-172",
    "NYDFS 23 CRR-NY 500.0",
    "New Zealand Information Security Manual (NZISM v3.4)",
    "PCI DSS v3.2.1",
    "PCI DSS v4.0",
    "RBI Baseline Cyber Security and Resilience Requirements",
    "Risk Management in Technology (RMiT)",
    "SOC 2",
    "Sarbanes Oxley Act (SOX)",
    "Secure Controls Framework (SCF) - 2022.2.1"
  ]
}