{
  "policyUpi": "PC-AWS-ELB-632",
  "policyId": "ac5232af-7c3c-4134-866c-988757ce16d7",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "low",
  "name": "AWS Network Load Balancer (NLB) is not using the latest predefined security policy",
  "description": "This policy identifies Network Load Balancers (NLBs) are not using the latest predefined security policy. A security policy is a combination of protocols and ciphers. The protocol establishes a secure connection between a client and a server and ensures that all data passed between the client and your load balancer is private. A cipher is an encryption algorithm that uses encryption keys to create a coded message. So it is recommended to use the latest predefined security policy which uses only secured protocol and ciphers.\n\nWe recommend using ELBSecurityPolicy-FS-1-2-Res-2020-10 policy if you require Forward Secrecy (FS) and use ELBSecurityPolicy-TLS-1-2-Ext-2018-06 policy to meet compliance and security standards that require disabling certain TLS protocol versions or to support legacy clients that require deprecated ciphers.\n\nFor more details:\nhttps://docs.aws.amazon.com/elasticloadbalancing/latest/network/create-tls-listener.html#describe-ssl-policies",
  "rule.criteria": "5c11c97d-b17b-49c3-8be1-1ff711df3a5e",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name = 'aws-elbv2-describe-load-balancers' AND json.rule = 'type equals network and listeners[?any(protocol equals TLS and sslPolicy exists and (sslPolicy does not contain ELBSecurityPolicy-FS-1-2-Res-2020-10 and sslPolicy does not contain ELBSecurityPolicy-TLS-1-2-Ext-2018-06))] exists'",
  "recommendation": "1. Log in to the AWS console\n2. In the console, select the specific region from the region drop-down on the top right corner, for which the alert is generated\n3. Go to the EC2 Dashboard, and select 'Load Balancers'\n4. Click on the reported Load Balancer\n5. On the 'Listeners' tab, Choose the 'TLS' rule\n6. Click on 'Edit', Change 'Security policy' to 'ELBSecurityPolicy-FS-1-2-Res-2020-10' policy if you require Forward Secrecy (FS) and use 'ELBSecurityPolicy-TLS-1-2-Ext-2018-06' policy to meet compliance and security standards that require disabling certain TLS protocol versions or to support legacy clients that require deprecated ciphers.\n7. Click on 'Update' to save your changes",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CSA CCM v.4.0.1",
    "HITRUST v.9.4.2",
    "MAS TRM 2021",
    "NIST CSF",
    "NIST SP 800-171 Revision 2",
    "NIST SP 800-172",
    "PCI DSS v3.2.1"
  ]
}