{
  "policyUpi": "PC-AWS-S3-735",
  "policyId": "8827bbb9-bf4b-4d39-a21d-dcf62037244d",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "medium",
  "name": "AWS S3 bucket policy overly permissive to any principal",
  "description": "Overly permissive AWS S3 bucket policies allow unauthorized access to sensitive data. This misconfiguration exposes data to any principal, bypassing intended access controls.\n\nAWS S3 buckets store data; a policy granting AWS 'full access' or '*' allows any user or service to read, write, and delete objects. Untrusted actors could exploit this to exfiltrate sensitive data, modify or delete files, or even perform ransomware attacks.\n\nThe impact of this misconfiguration includes data breaches, regulatory non-compliance, and reputational damage. Restricting access to only authorized users and services using the principle of least privilege minimizes the impact of a compromised account. Strong access control is crucial for data protection.\n\nImplement least privilege by granting only necessary permissions to specific users and services. Regularly review and update bucket policies, ensuring that only authorized entities have access. Enable Block Public Access settings to prevent unintended public exposure. Use fine-grained access control mechanisms like IAM roles and policies to further enhance security.",
  "rule.criteria": "eecb0c21-2dbe-40f4-8727-fbbaacef69dc",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name='aws-s3api-get-bucket-acl' AND json.rule = ( ( publicAccessBlockConfiguration.restrictPublicBuckets is false and accountLevelPublicAccessBlockConfiguration does not exist ) or ( publicAccessBlockConfiguration does not exist and accountLevelPublicAccessBlockConfiguration.restrictPublicBuckets is false ) or ( publicAccessBlockConfiguration.restrictPublicBuckets is false and accountLevelPublicAccessBlockConfiguration.restrictPublicBuckets is false ) or ( publicAccessBlockConfiguration does not exist and accountLevelPublicAccessBlockConfiguration does not exist ) )AND policy.Statement[?any(Effect equals Allow and Action anyStartWith s3: and (Principal.AWS contains * or Principal equals *) and (Condition does not exist or Condition[*] is empty) )] exists",
  "recommendation": "1. Log in to the AWS console\n2. Navigate to the S3 dashboard\n3. Choose the reported S3 bucket\n4. In the 'Permissions' tab, click on the 'Bucket Policy'\n5. Update the S3 bucket policy, by removing Principal conatining wildcard(*) to specific accounts, Services or IAM entities. Also restrict S3 action operations to specific instead of using wildcard (*).\n6. In the 'Permissions' tab, click on the 'Block public access' and enable 'Block public and cross-account access to buckets and objects through any public bucket or access point policies'",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM)",
    "ACSC Information Security Manual (ISM) (Latest)",
    "AWS Well-Architected Framework",
    "Australian Cyber Security Centre (ACSC) Essential Eight - Level 1",
    "Australian Cyber Security Centre (ACSC) Essential Eight - Level 2",
    "Australian Cyber Security Centre (ACSC) Essential Eight - Level 3",
    "Australian Energy Sector Cyber Security Framework (AESCSF)",
    "CIS Controls v7.1",
    "CIS Controls v8",
    "CIS Controls v8.1",
    "CRI Profile v1.2.1",
    "CRI Profile v2.0",
    "CSA CCM v.4.0.6",
    "Cybersecurity Maturity Model Certification (CMMC) v.2.0 (Level 1)",
    "FFIEC",
    "HIPAA",
    "HITRUST CSF v.11.2.0",
    "HITRUST CSF v.9.6.0",
    "ISO 27002:2022",
    "ISO/IEC 27001:2022",
    "MLPS 2.0 (Level 2)",
    "NCSC - Cyber Essentials",
    "NCSC Cloud Security Principles",
    "NIST 800-53 Rev 5",
    "NIST CSF v2.0",
    "NIST SP 800-171 Revision 3",
    "PCI DSS v4.0",
    "RBI Baseline Cyber Security and Resilience Requirements",
    "SEBI - Consolidated Cybersecurity and Cyber Resilience Framework (CSCRF)",
    "SOC 2",
    "Sarbanes Oxley Act (SOX)",
    "Secure Controls Framework (SCF) - 2022.2.1",
    "Secure Controls Framework (SCF) - 2024.2",
    "TX-RAMP Level 1"
  ]
}