{
  "policyUpi": "PC-ALL-ALL-1242",
  "policyId": "9430eb76-ac5b-44fe-9cef-0d8610f91266",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS RDS instance with network path from the untrust internet source",
  "description": "Untrusted internet access to an AWS RDS instance presents a significant security risk, enabling unauthorized access and data breaches.\n\nAWS RDS, a managed relational database service, should be configured to restrict network access. Allowing access from untrusted IP addresses exposes the database to attacks such as SQL injection, unauthorized data exfiltration, and complete compromise. Failure to follow best practices expands the attack surface, increasing the likelihood of successful exploitation.\n\nThe impact of this misconfiguration includes data breaches, unauthorized database modifications, and service disruptions. Restricting access to trusted sources only significantly reduces the attack surface and strengthens the overall security posture. This best practice minimizes the risk of unauthorized access and protects sensitive data.\n\nMitigate this risk by configuring network security groups (NSGs) to allow inbound traffic only from trusted IP addresses or specific security groups. Use VPC endpoints to isolate the RDS instance from the public internet. Regularly review and update your security configurations to ensure they remain effective.",
  "rule.criteria": "105a5c77-777d-4a7f-9b21-0ccd15f27011",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'PaaS' and dest.cloud.type = 'AWS' and dest.paas.service.type = 'AWS RDS'",
  "recommendation": "Restrict access to the AWS RDS Instance by configuring Security group rules.\n\n1. Sign in to the AWS Console\n2. Navigate to the RDS Dashboard\n3. In the 'Databases' section, Select the reported RDS instance you want to restrict public access\n4. Click on the RDS instance to open its details\n5. Go to the 'Connectivity & security' tab\n6. For each security group listed under the 'Security group rules' section:\n    6a. Select the security group and Click 'Edit inbound rules'\n    6b. Review and update inbound rules to add the IP addresses from Trusted IP Addresses that allow unrestricted access (0.0.0.0/0) or any untrusted IP ranges, ensuring that such CIDR ranges no longer exist.\n  6c. Click 'Save rules' to apply the changes",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}