{
  "policyUpi": "PC-AWS-ASY-1151",
  "policyId": "53f3d4fd-c735-4eae-bdfa-cedec9126d68",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "informational",
  "name": "AWS AppSync has field-level logging disabled",
  "description": "This policy identifies an AWS AppSync GraphQL API not configured with field-level logging with either 'ERROR' or 'ALL'.\n\nAWS AppSync is a managed GraphQL service that simplifies the development of scalable APIs. Field-level logging in AWS AppSync lets you capture detailed logs for specific fields in your GraphQL API. Without enabling field-level logging, the security monitoring and debugging capabilities may be compromised, increasing the risk of undetected threats and vulnerabilities.\n\nIt is recommended to enable field-level logging to ensure granular visibility into API requests, aiding in security, and compliance with regulatory requirements.",
  "rule.criteria": "bffc2f87-93bd-44fe-b73a-be84220fa8eb",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name = 'aws-appsync-graphql-api' AND json.rule = logConfig.fieldLogLevel is not member of ('ERROR','ALL')",
  "recommendation": "To turn on field-level logging on an AWS AppSync GraphQL API,\n\n1. Sign in to the AWS Management Console.\n2. In the console, select the specific region from the region drop-down on the top right corner, for which the alert is generated\n3. In the navigation pane, choose 'AWS AppSync' under the 'Front-end Web & Mobile' section.\n4. On the APIs page, choose the name of a reported GraphQL API.\n5. On your API's homepage, in the navigation pane, choose Settings.\n6. Under Logging, Turn on Enable Logs.\n7. Under Field resolver log level, choose your preferred field-level logging level Error or All according to your business requirements.\n8. Under Create or use an existing role, choose New role to create a new AWS Identity and Access Management (IAM) that allows AWS AppSync to write logs to CloudWatch. Or, choose the Existing role to select the Amazon Resource Name (ARN) of an existing IAM role in your AWS account.\n9. Choose Save.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CIS Controls v8.1",
    "CSA CCM v4.0.12",
    "DORA",
    "GDPR",
    "ISO/IEC 27001:2022",
    "ITSG-33",
    "Microsoft Cloud Security Benchmark v1",
    "NYDFS 23 CRR-NY 500.0",
    "SOC 2",
    "Secure Controls Framework (SCF) - 2024.2",
    "TX-RAMP Level 1",
    "TX-RAMP Level 2"
  ]
}