{
  "policyUpi": "PC-AWS-R53-991",
  "policyId": "74a38c42-ed2f-4172-b047-12be56495aca",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS Route53 Hosted Zone having dangling DNS record with subdomain takeover risk",
  "description": "This policy identifies AWS Route53 Hosted Zones that have dangling DNS records with a subdomain takeover risk.\n\nA CNAME entry in a Route53 Hosted Zone pointing to an S3 bucket which doesn't exist in the same account has the potential risk of becoming a dangling DNS record when the S3 bucket is deleted without removing the CNAMEs record in Route53. An attacker can exploit such dangling DNS records vulnerable to subdomain takeover attack by creating an AWS S3 bucket with the same name that redirects all requests to the legitimate domain to an attacker-controlled bucket. This attacker-controlled S3 bucket can be used to serve malicious contents to perform phishing attacks, spread malware, or engage in other illegal activities.\n\nAs a best practise, it is recommended to review and protect S3 buckets bound to a subdomain from accidental deletion. Delete dangling DNS records from your AWS Route 53-hosted zones when CNAME entries point to a non-existent S3 bucket.",
  "rule.criteria": "7a6582fb-4264-4805-9341-331be346e868",
  "searchModel.query": "config from cloud.resource where api.name = 'aws-route53-list-hosted-zones' AND json.rule = hostedZone.config.privateZone is false and resourceRecordSet[?any( type equals CNAME and resourceRecords[*].value contains s3-website )] exists as X; config from cloud.resource where api.name = 'aws-s3api-get-bucket-acl' as Y; filter 'not ($.X.resourceRecordSet[*].name intersects $.Y.bucketName)'; show X;",
  "recommendation": "Identify DNS record entry pointing to a non-existing S3 bucket resource.\n\nTo remove DNS record entry, follow steps given in following URL:\nhttps://docs.aws.amazon.com/Route53/latest/DeveloperGuide/resource-record-sets-deleting.html",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}