{
  "policyUpi": "PC-AWS-VPC-706",
  "policyId": "d4b56f6c-eba0-417c-8987-40ff366d465b",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS Security Group allows all traffic on ICMP (Ping) protocol",
  "description": "This policy identifies Security groups that allow all traffic on ICMP (Ping) protocol. ICMP is used by devices to communicate error messages and status. While ICMP is useful for diagnostics and troubleshooting, it can also be used to exploit or disrupt systems. Review your list of Security group rules to ensure that your resources are not exposed. As a best practice, restrict ICMP (Ping) solely to known static IP addresses. Limit the access list to include known hosts, services, or specific employees only.",
  "rule.criteria": "70686980-6936-45d2-bef0-79c17f00325e",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name= 'aws-ec2-describe-security-groups' AND json.rule = isShared is false and (ipPermissions[?any((ipProtocol equals icmp or ipProtocol equals icmpv6) and (ipRanges[*] contains 0.0.0.0/0 or ipv6Ranges[*].cidrIpv6 contains ::/0))] exists)",
  "recommendation": "Before making any changes, please check the impact on your applications/services. If the Security Group reported indeed need to restrict all traffic, follow the instructions below:\n1. Log in to the AWS Console\n2. In the console, select the specific region from the region drop-down on the top right corner, for which the alert is generated.\n3. Navigate to the 'VPC' service\n4. Select the 'Security Group' reported in the alert\n5. Click on the 'Inbound Rule'\n6. Remove the rule which has the 'Source' value as 0.0.0.0/0 or ::/0 and the 'Type' value that has ICMP - IPv4 or ICMP - IPv6.\n7. Add restictive Security group rule which limits the access list to include known IP ranges only",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "MAS TRM 2021",
    "Risk Management in Technology (RMiT)"
  ]
}