{
  "policyUpi": "PC-AWS-ASG-1047",
  "policyId": "d5b23289-aedc-4dc7-ad24-211ac900eae5",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "medium",
  "name": "AWS Auto Scaling group launch configuration not configured with Instance Metadata Service v2 (IMDSv2)",
  "description": "This policy identifies the autoscaling group launch configuration where IMDSv2 is set to optional. A launch configuration is an instance configuration template that an Auto Scaling group uses to launch EC2 instances. With IMDSv2, every request is now protected by session authentication. Version 2 of the IMDS adds new protections that weren't available in IMDSv1 to further safeguard your EC2 instances created by the autoscaling group. It is recommended to use only IMDSv2 for all your EC2 instances.",
  "rule.criteria": "bf844eb1-956e-4516-935a-d4a46b590c1d",
  "searchModel.query": "config from cloud.resource where api.name = 'aws-ec2-autoscaling-launch-configuration' AND json.rule = (metadataOptions.httpEndpoint does not exist) or (metadataOptions.httpEndpoint equals \"enabled\" and metadataOptions.httpTokens equals \"optional\") as X; config from cloud.resource where api.name = 'aws-describe-auto-scaling-groups' as Y; filter ' $.X.launchConfigurationName equal ignore case $.Y.launchConfigurationName'; show X;",
  "recommendation": "You cannot modify a launch configuration after you create it. To change the launch configuration for an Auto Scaling group, use an existing launch configuration as the basis for a new launch configuration with IMDSv2 enabled.\n\nTo update the Auto Scaling group to use the new launch configuration follow the steps below:\n\n1. Open the Amazon EC2 console.\n2. On the left navigation pane, under 'Auto Scaling', choose 'Auto Scaling Groups' and Choose 'Launch configurations' near the top of the page.\n3. Select the reported launch configuration and choose Actions, then click 'Copy launch configuration'. This sets up a new launch configuration with the same options as the original, but with 'Copy' added to the name.\n4. On the 'Create launch configuration' page, expand 'Advanced details' under 'Additional Configuration - optional'.\n5. Under the 'Advanced details', go to the 'Metadata version' section.\n6. Select 'V2 only (token required)' option.\n7. When you have finished, click on the 'Create launch configuration' button at the bottom of the page.\n8. On the navigation pane, under Auto Scaling, choose Auto Scaling Groups.\n9. Select the check box next to the Auto Scaling group.\n10. A split pane opens up at the bottom part of the page, showing information about the group that's selected.\n11. On the Details tab, click on the 'Edit' button adjacent to the 'Launch configuration' option.\n12. Under the 'Launch configuration' dropdown, select the newly created launch configuration.\n13. When you have finished changing your launch configuration, click on the 'Update' button at the bottom of the page.\n\nAfter you change the launch configuration for an Auto Scaling group, any new instances are launched with the new configuration options. Existing instances are not affected. To update existing instances,\n\n1. Log in to the AWS Console\n2. In the console, select the specific region from the region drop-down in the top right corner, for which the alert is generated.\n3. Refer 'Configure instance metadata options for existing instances' section from the following URL: \nhttps://docs.aws.amazon.com/AWSEC2/latest/UserGuide/configuring-IMDS-existing-instances.html\n\nTo delete the reported Auto Scaling group launch configuration follow the steps below:\n\n1. Open the Amazon EC2 console.\n2. On the left navigation pane, under 'Auto Scaling', choose 'Auto Scaling Groups' and Choose 'Launch configurations' near the top of the page.\n3. Select the reported launch configuration and choose Actions, then click 'Delete launch configuration'.\n4. Click on the 'Delete' button to delete the autoscaling group launch configuration.\n\nNOTE: Ensure adequate precautions before you enforce the use of IMDSv2, as applications or agents that use IMDSv1 for instance metadata access will break.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CIS Controls v8.1",
    "Framework for Adoption of Cloud Services by SEBI Regulated Entities (REs)",
    "ITSG-33",
    "MITRE ATT&CK v13.0 Cloud IaaS for Enterprise",
    "MITRE ATT&CK v14.0 Cloud IaaS for Enterprise",
    "NIST 800-53 Rev 5",
    "NIST SP 800-171 Revision 3",
    "TX-RAMP Level 1",
    "TX-RAMP Level 2"
  ]
}