{
  "policyUpi": "",
  "policyId": "ec8832eb-a95e-4ed9-9b13-cff519a597d3",
  "policyType": "iam",
  "cloudType": "aws",
  "severity": "medium",
  "name": "AWS EC2 with cloud log tampering permissions",
  "description": "This policy identifies permissions that  have the potential to impact various AWS cloud logging services. They include the ability to delete important logs and trails, modify event selectors, stop logging, delete flow logs, configure bucket logging, delete log streams and groups, and manage logging configurations. Misuse of these permissions can result in the loss of crucial logging and monitoring data, hinder troubleshooting and analysis, and impact security event tracking. It is recommended to manage and grant these permissions to trusted individuals to maintain the security and integrity of AWS resources.",
  "rule.criteria": "ec8832eb-a95e-4ed9-9b13-cff519a597d3",
  "searchModel.query": "config from iam where dest.cloud.type = 'AWS' AND action.name IN ('cloudtrail:DeleteTrail','cloudtrail:PutEventSelectors','cloudtrail:StopLogging','ec2:DeleteFlowLogs','s3:PutBucketLogging','logs:DeleteLogStream','logs:DeleteLogGroup','waf:DeleteLoggingConfiguration','waf:PutLoggingConfiguration') AND source.cloud.service.name = 'ec2' AND source.cloud.resource.type = 'instance'",
  "recommendation": "Remediation steps:\n1. Log in to the AWS console\n2. Navigate to the EC2 instance\n3. Find the role used by the EC2 instance\n4. Navigate to the IAM service\n5. Click on Roles\n6. Choose the relevant role\n7. Under ''Permissions policies'', find the relevant policy according to the alert details and remove the risky actions",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic aws cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}