{
  "policyUpi": "",
  "policyId": "264eb81b-a98d-44f5-9067-0eee731bb892",
  "policyType": "iam",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS Users and Machine Identities with Administrative Permissions",
  "description": "This policy identifies AWS Users and Machine Identities with Administrative Permissions.\n\nRisk of Administrative Permissions:\nIAM users and machine identities with active administrative privileges (elevated permissions) pose a significant security risk because:\nUnsecured \"Root Keys\": These accounts act like misplaced root keys. If compromised, attackers can exploit them to gain complete control over your AWS environment. They can create, modify, or delete any resource, potentially leading to severe disruption, data breaches, or financial losses.\nEscalation of Privilege: Administrative permissions often grant the ability to elevate privileges of other accounts, potentially granting attackers access to even more sensitive resources and systems.\n\nMitigating the Risk:\nPrinciple of Least Privilege: Always adhere to the principle of least privilege when assigning IAM permissions. Avoid creating users or machine identities with administrative privileges unless absolutely necessary.\nMFA for Administrative Users: Enforce Multi-Factor Authentication (MFA) for all IAM users with administrative privileges. MFA adds an extra layer of security and makes it significantly harder for attackers to compromise an account, even if they obtain the credentials.\nUse Temporary Credentials: Consider using temporary credentials with limited lifespans and permissions for tasks requiring administrative access. This approach minimizes the window of opportunity for attackers if they compromise a credential.\nAssume Role for Restricted Access: Utilize the \"Assume Role\" functionality to grant temporary administrative access to specific resources for users with lower privileges. This approach minimizes the need for permanent administrative accounts.\nRegular Review and Auditing: Regularly review IAM user and machine identity permissions, especially those with administrative privileges. Conduct periodic security audits to identify potential weaknesses in your IAM configuration.\nMonitor for Suspicious Activity: Utilize CloudTrail to track API calls made within your AWS environment, including those leveraging privileged users or machine identities. This vigilance can help detect unusual activity related to these accounts that might indicate a compromise.",
  "rule.criteria": "264eb81b-a98d-44f5-9067-0eee731bb892",
  "searchModel.query": "config from iam where source.cloud.type = 'AWS' and action.access.isadministrative = true ",
  "recommendation": "Remediation for a user:\n 1. Log in to the AWS console\n 2. Navigate to the IAM service\n 3. Click on Users\n 4. Choose the relevant user\n 5. Under 'Permissions policies', find the relevant policy according to the alert details and remove the excessive actions\n ----------------------------------------\n Remediation for a Compute instance/Okta user that assumes a role:\n 1. Log in to the AWS console\n 2. Navigate to the compute service (For example, AWS EC2, AWS Lambda or AWS ECS) or login to the Okta console\n 3. Find the role used by the compute instance/Okta user\n 4. Navigate to the IAM service\n 5. Click on Roles\n 6. Choose the relevant role\n 7. Under 'Permissions policies', find the relevant policy according to the alert details and remove the excessive actions",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic aws cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}