{
  "policyUpi": "PC-AWS-EKS-801",
  "policyId": "23c2dec8-4eeb-4f32-8960-171f9a266b99",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "low",
  "name": "AWS EKS cluster public endpoint access overly permissive to all traffic",
  "description": "This policy identifies EKS clusters that have an overly permissive public endpoint accessible to all traffic. When you create a new cluster, Amazon EKS creates an endpoint for the managed Kubernetes API server that you use to communicate with your cluster (using Kubernetes management tools such as kubectl). By default, this API server endpoint accepts all connections from public internet, and access to the API server is secured using a combination of AWS Identity and Access Management (IAM) and native Kubernetes Role Based Access Control (RBAC).\n\nAllowing all traffic to EKS cluster may allow a bad actor to brute force their way into the system and potentially get access to the entire network. As a best practice, restrict traffic solely from known static IP addresses. Limit the access list to include known hosts, services, or specific employees only.",
  "rule.criteria": "68c1a676-8e87-4c3c-a89b-c973453dee89",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name = 'aws-eks-describe-cluster' AND json.rule = resourcesVpcConfig.endpointPublicAccess is true and resourcesVpcConfig.publicAccessCidrs contains \"0.0.0.0/0\"",
  "recommendation": "Either disable public access to your API server so that it's not accessible from the internet and allow only private access, or restrict traffic solely from known static IP addresses.\n\nFor more details on Amazon EKS cluster endpoint access control, follow below mentioned URL:\nhttps://docs.aws.amazon.com/eks/latest/userguide/cluster-endpoint.html",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CIS Controls v8.1",
    "Framework for Adoption of Cloud Services by SEBI Regulated Entities (REs)",
    "HIPAA",
    "HITRUST CSF v.11.2.0",
    "ISO/IEC 27001:2022",
    "MLPS 2.0 (Level 2)",
    "Microsoft Cloud Security Benchmark v1",
    "NIST 800-53 Rev 5",
    "SOC 2",
    "Sarbanes Oxley Act (SOX)",
    "Secure Controls Framework (SCF) - 2022.2.1",
    "Secure Controls Framework (SCF) - 2024.2",
    "TX-RAMP Level 1",
    "TX-RAMP Level 2"
  ]
}