{
  "policyUpi": "PC-AWS-S3-547",
  "policyId": "34064d53-1fd1-42e6-b075-45dce495caca",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS S3 Buckets Block public access setting disabled",
  "description": "This policy identifies AWS S3 buckets which have 'Block public access' setting disabled. Amazon S3 provides 'Block public access' setting to manage public access of AWS S3 buckets. Enabling 'Block public access' setting prevents S3 resource data being accidentally or maliciously becoming publicly accessible. It is highly recommended to enable 'Block public access' setting for all AWS s3 buckets appropriately.",
  "rule.criteria": "b22df320-13e7-4108-8142-d1bd858b8d46",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name='aws-s3api-get-bucket-acl' AND json.rule = \"(publicAccessBlockConfiguration does not exist and accountLevelPublicAccessBlockConfiguration does not exist) or ((publicAccessBlockConfiguration does not exist or publicAccessBlockConfiguration.blockPublicAcls is false) and (accountLevelPublicAccessBlockConfiguration does not exist or accountLevelPublicAccessBlockConfiguration.blockPublicAcls is false)) or ((publicAccessBlockConfiguration does not exist or publicAccessBlockConfiguration.ignorePublicAcls is false) and (accountLevelPublicAccessBlockConfiguration does not exist or accountLevelPublicAccessBlockConfiguration.ignorePublicAcls is false)) or ((publicAccessBlockConfiguration does not exist or publicAccessBlockConfiguration.blockPublicPolicy is false) and (accountLevelPublicAccessBlockConfiguration does not exist or accountLevelPublicAccessBlockConfiguration.blockPublicPolicy is false)) or ((publicAccessBlockConfiguration does not exist or publicAccessBlockConfiguration.restrictPublicBuckets is false) and (accountLevelPublicAccessBlockConfiguration does not exist or accountLevelPublicAccessBlockConfiguration.restrictPublicBuckets is false))\"",
  "recommendation": "1. Login to the AWS Console\n2. Navigate to the 'S3' service\n3. Click on the 'S3' resource reported in the alert\n4. Click on the 'Permissions'\n5. Under 'Block public access' click on 'Edit'\n6. Select 'Block all public access' checkbox\n7. Click on Save\n8. 'Confirm' the changes\n\nNote: Make sure updating 'Block public access' setting does not affect S3 bucket data access.",
  "remediable": true,
  "remediation.cliScriptTemplate": "aws s3api put-public-access-block --bucket ${resourceName} --public-access-block-configuration \"BlockPublicAcls=true,IgnorePublicAcls=true,BlockPublicPolicy=true,RestrictPublicBuckets=true\"",
  "remediation.description": "This CLI command requires 's3:PutBucketPublicAccessBlock' permission. Successful execution enables 'Block public access' setting.\nNote: Make sure updating 'Block public access' setting does not affect S3 bucket data access.",
  "remediation.impact": "Enables 'Block public access' setting for AWS S3 bucket",
  "compliance.standard": [
    "APRA (CPS 234) Information Security",
    "Brazilian Data Protection Law (LGPD)",
    "CIS v1.3.0 (AWS)",
    "Cybersecurity Maturity Model Certification (CMMC) v.1.02",
    "HITRUST v.9.4.2",
    "MITRE ATT&CK v8.2",
    "NIST SP 800-171 Revision 2",
    "NIST SP 800-172",
    "PCI DSS v3.2.1"
  ]
}