{
  "policyUpi": "PC-ALL-ALL-804",
  "policyId": "6c561dd0-e24b-4afe-b1fd-78808a45956d",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "medium",
  "name": "AWS EC2 instance with network path to the internet (0.0.0.0/0)",
  "description": "AWS EC2 instances configured with a 0.0.0.0/0 network path have unrestricted internet access, increasing the risk of unauthorized access and data breaches. This exposes the instances to various threats, including malicious actors exploiting known vulnerabilities or launching cryptojacking attacks.\n\nThe EC2 instance's network settings allow inbound and outbound connections from any IP address. This misconfiguration bypasses security controls and exposes the instance to untrusted IP addresses. Malicious actors can exploit this to gain unauthorized access, potentially leading to data exfiltration, ransomware attacks, or the installation of malware for purposes such as crypto mining.\n\nThe impact of this misconfiguration includes data breaches, service disruptions, and potential financial losses. Restricting network access minimizes the attack surface, thereby significantly reducing the likelihood of compromise. Implementing strong access controls is crucial for maintaining the security posture of EC2 instances.\n\nTo mitigate this risk, implement security groups that restrict inbound and outbound traffic. Only allow necessary traffic from trusted IP addresses or ranges. Regularly review and update security group rules to maintain an effective defense against emerging threats. Consider using more restrictive IP ranges than 0.0.0.0/0.",
  "rule.criteria": "53aea291-327e-4ded-8035-d5b4354272ac",
  "searchModel.query": "config from network where source.resource.type = 'Instance' and source.cloud.type = 'AWS' and dest.network = '0.0.0.0/0' and address.match.criteria = 'full_match'",
  "recommendation": "Restrict EC2 instances with network path to the internet based on your business requirements by modifying security group rules to the trusted IP address\n\n1. Sign in to the AWS Console\n2. Navigate to EC2 Dashboard\n3. Identify the reported EC2 instances that you want to restrict public access\n4. Go to the 'Security' tab\n5. For each security group listed under the 'Security group' section\n6. Select 'Edit outbound rules'\n7. Update outbound rules that allow unrestricted access (0.0.0.0/0) such that the CIDR range 0.0.0.0/0 does not exist\n8. Click 'Save rules' to apply the changes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}