{
  "policyUpi": "PC-AWS-S3-1208",
  "policyId": "f55ba827-c722-483b-ace3-b09c69829efb",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "informational",
  "name": "AWS S3 bucket is utilized for AWS Sagemaker training job data",
  "description": "Improperly configured AWS S3 buckets storing AWS SageMaker training data expose sensitive information to unauthorized access. These buckets often contain large datasets crucial for model training, making them prime targets for data breaches.\n\nAWS SageMaker uses S3 buckets to store training data. Misconfiguration, such as overly permissive access controls, or a lack of encryption, allows attackers to download, modify, or delete training data. Untrusted IPs accessing these buckets could exfiltrate sensitive information or disrupt the training process.\n\nData breaches resulting from this misconfiguration can lead to significant financial losses, reputational damage, and regulatory penalties. Implementing strong access controls and encryption protects sensitive training data, ensuring only authorized users and services can access it, thus mitigating data loss and security breaches.\n\nMitigate this risk by restricting access to only necessary users and services using IAM roles and policies. Enable server-side encryption (SSE-S3 or SSE-KMS) to protect data at rest. Regularly review and audit bucket permissions to identify and remediate any unnecessary or overly permissive access controls.",
  "rule.criteria": "4f900112-eb70-490e-a867-63a31769a786",
  "searchModel.query": "config from cloud.resource where api.name = 'aws-s3api-get-bucket-acl' as X; config from cloud.resource where api.name = 'aws-sagemaker-training-job' as Y; filter '$.Y.InputDataConfig[*].DataSource.S3DataSource.bucketName intersects $.X.bucketName'; show X;",
  "recommendation": "To protect the S3 buckets utilized by the Sagemaker training job, please refer to the following link for recommended best practices\nhttps://docs.aws.amazon.com/AmazonS3/latest/userguide/security-best-practices.html",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "NYDFS 23 CRR-NY 500.0",
    "SOC 2",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}