{
  "policyUpi": "",
  "policyId": "a6497b9e-4ee6-439a-8cba-86b0360bbe2f",
  "policyType": "iam",
  "cloudType": "aws",
  "severity": "medium",
  "name": "AWS IAM policy allows Privilege escalation via EC2 Instance Connect permissions",
  "description": "With access to ec2:DescribeInstances, ec2-instance-connect:SendSSHPublicKey, ec2-instance-connect:SendSerialConsoleSSHPublicKey permissions and the instance has a public IP with instance connect enabled, an adversary can have network access to push ssh keys and ssh to the instance. This could allow an adversary to escalate privileges through the EC2 instance.",
  "rule.criteria": "a6497b9e-4ee6-439a-8cba-86b0360bbe2f",
  "searchModel.query": "config from iam where action.name CONTAINS ALL ( 'ec2:DescribeInstances', 'ec2-instance-connect:SendSSHPublicKey', 'ec2-instance-connect:SendSerialConsoleSSHPublicKey' ) AND dest.cloud.wildcardscope = true ",
  "recommendation": "\"Do not use wildcards in a policy's statement Resource element with these permissions, as it creates a risk of Privilege Escalation. If identity requires the use of these permissions to pass a role to an EC2 instance, make sure the policy is scoped to only the resources needed. The same granular logic can be applied with EC2 as the following example using the lambda function. https://aws.amazon.com/premiumsupport/knowledge-center/granular-access-lambda/\n\nRemediation steps:\n1. Log in to the AWS console\n2. Navigate to the EC2 instance\n3. Find the role used by the EC2 instance\n4. Navigate to the IAM service\n5. Click on Roles\n6. Choose the relevant role\n7. Under ''Permissions policies'', find the relevant policy according to the alert details and remove the risky actions\"",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic aws cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}