{
  "policyUpi": "PC-AWS-LMB-862",
  "policyId": "00d4e54a-19de-42d4-aabe-9bed2acb827b",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS Lambda function managed ENI reachable from any untrust internet source",
  "description": "AWS Lambda functions with Elastic Network Interfaces (ENIs) accessible from the public internet pose a significant security risk. Unrestricted inbound traffic allows attackers to directly target the function, potentially leading to data breaches or function compromise.\n\nLambda functions should operate within a secure network environment. Publicly accessible ENIs bypass inherent Lambda security features, increasing the attack surface. Attackers could exploit misconfigurations to execute malicious code, access sensitive data stored or processed by the function, or use it as a pivot point for further attacks within the AWS environment.\n\nThe impact of this misconfiguration includes unauthorized access to sensitive data, disruption of services, and potential compliance violations. Restricting access to trusted sources only minimizes the attack surface and enhances the security posture of Lambda functions. Following this best practice ensures that only authorized entities can interact with the function.\n\nImplement network access control lists (ACLs) or security groups to restrict inbound traffic to the Lambda function's ENI. Only allow connections from known, trusted IP addresses or ranges. Consider using VPC endpoints or privateLink for internal communication to further enhance security. Regularly review and update these security controls to maintain optimal protection.",
  "rule.criteria": "f52955c2-890f-4e32-af9b-adff4fde8e47",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'Interface' and dest.cloud.type = 'AWS' and dest.network.interface.type = 'Lambda'",
  "recommendation": "The following steps are recommended to restrict traffic from the Internet:\n1. Visit the Network path Analysis from Source to Destination and review the network path components that allow internet access.\n2. Identify the network component on which restrictive rules can be implemented.\n3. Implement the required changes and make sure no other resources have been impacted due to these changes:\n a) The overly permissive Security Group rules can be made more restrictive.\n b) Move the Lambda function inside a restrictive subnet if the cluster does not need to be publicly accessible.\n c) Define a NAT rule to restrict traffic coming from the Internet to the respective Lambda function.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}