{
  "policyUpi": "PC-ALL-ALL-1300",
  "policyId": "4157a1ed-9145-4afa-8369-6d0b7a5683bf",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS EKS K8s service with network path from the internet (0.0.0.0/0) on ports 80/443",
  "description": "AWS Elastic Kubernetes Service (EKS) clusters exposing ports 80 and 443 to the internet (0.0.0.0/0) present a significant security risk.\n\nThe EKS service, configured to allow unrestricted inbound traffic on ports 80 and 443, exposes the Kubernetes control plane and potentially workloads to the entire internet. This misconfiguration expands the attack surface, increasing vulnerability to various attacks including brute-force login attempts, injection attacks (SQL, XSS), and denial-of-service attacks. Untrusted IP addresses can easily access sensitive data or compromise the cluster's integrity.\n\nCompromise of the EKS cluster could lead to data breaches, service disruptions, and potential lateral movement within the organization's infrastructure. Restricting access improves security posture and reduces the impact of potential breaches by limiting the entry points for attackers.\n\nImplement network segmentation and access controls. Restrict access to the EKS cluster to only trusted IP addresses or virtual networks. Utilize network policies within the Kubernetes cluster to control inter-pod communication and limit access to specific services. Regularly review and update network configurations to ensure they align with security best practices.",
  "rule.criteria": "2c9c4c1b-a08e-45a8-823a-bfc2abad2e37",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'K8s Service' and dest.cloud.type = 'AWS' and protocol.ports in ( 'tcp/80' , 'tcp/443' )",
  "recommendation": "The following steps are recommended to restrict AWS K8s service from having unrestricted access from the Internet:\n1. Visit the Network path Analysis from Source to Destination and review the network path components that allow internet access.\n2. Identify the network component on which restrictive rules can be implemented.\n3. Implement the necessary changes and ensure no other resources have been impacted due to these changes:\n a) The overly permissive security group rules can be made more restrictive.\n b) Move the container/application inside a restrictive subnet if public accessibility is not required.\n c) Control access to service by specifying allowed IP addresses or ranges in the service configuration.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}