{
  "policyUpi": "PC-AWS-ES-174",
  "policyId": "0a54c279-d08a-4443-a93b-6d109addd964",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "low",
  "name": "AWS Elasticsearch domain Encryption for data at rest is disabled",
  "description": "This policy identifies Elasticsearch domains for which encryption is disabled. Encryption of data at rest is required to prevent unauthorized users from accessing the sensitive information available on your Elasticsearch domains components. This may include all data of file systems, primary and replica indices, log files, memory swap files and automated snapshots. The Elasticsearch uses AWS KMS service to store and manage the encryption keys. It is highly recommended to implement encryption at rest when you are working with production data that have sensitive information, to protect from unauthorized access.",
  "rule.criteria": "bbd8196f-89c4-4018-8f28-cbad9e2a6841",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name = 'aws-es-describe-elasticsearch-domain' AND json.rule = 'encryptionAtRestOptions.enabled is false or encryptionAtRestOptions does not exist'",
  "recommendation": "AWS Elasticsearch Domain encryption can be set only at the time of the creation of domain. So to fix this alert, create a new domain with encryption using KMS Keys and then migrate all required Elasticsearch domain data from the reported Elasticsearch domain to this newly created domain.\n\nTo set up the new Elasticsearch domain with encryption using KMS Key, perform the following:\n1. Sign into the AWS console\n2. In the console, select the specific region from region drop down on the top right corner, for which the alert is generated\n3. Navigate to Elasticsearch Service Dashboard\n4. Click on 'Create a new domain' button to launch a new Elasticsearch domain\n5. On the 'Define domain' page, define the Elasticsearch domain name, Elasticsearch version and click on 'Next'\n6. On the 'Configure cluster' page, Set the new domain parameters which are same as of reported domain configuration details.\n7. Select 'Enable encryption at rest' checkbox \n8. From the 'KMS master key' dropdown list choose your AWS KMS Key OR Select 'Enter a key ARN' from the dropdown list and paste the new CMK ARN into the ARN / ID box.\nNote: It is recommended to use KMS Customer Master Keys (CMKs) instead of AWS managed default keys used by the Elasticsearch service when there are no customer keys defined in order to have more control over the data-at-rest encryption/decryption process.\n9. On the 'Set up access' page, configure the network access to the new Elasticsearch domain by using the same parameters as of reported domain configuration details.\n10. On the 'Review' page, verify the domain configuration details\n11. Click on 'Confirm' to launch your new AWS Elasticsearch domain, encrypted with the custom/default KMS key.\n12. Once the new AWS Elasticsearch domain is created, upload the data from the source domain to the new Elasticsearch domain.\n\nTo delete reported Elasticsearch domain, perform the following:\n1. Sign into the AWS console\n2. In the console, select the specific region from region drop down on the top right corner, for which the alert is generated\n3. Navigate to Elasticsearch Service Dashboard\n4. Choose reported Elasticsearch domain\n5. Select the Overview tab and make sure that the 'Encryption at rest' attribute value is set to 'Disabled'.\nIt means that there is no encryption is used in the Elasticsearch domain and the Elasticsearch domain can be safely removed.\n6. Click on 'Delete Domain'\n7. On 'Delete Domain' dialog popup, check the 'Delete the domain <YOUR_DOMAIN_NAME>' and click on 'Delete' button.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "APRA (CPS 234) Information Security",
    "Brazilian Data Protection Law (LGPD)",
    "CCPA 2018",
    "CSA CCM v3.0.1",
    "Cybersecurity Maturity Model Certification (CMMC) v.1.02",
    "HITRUST CSF v9.3",
    "ISO 27001:2013",
    "Multi-Level Protection Scheme (MLPS) v2.0",
    "NIST 800-171 Rev1",
    "NIST 800-53 Rev 5",
    "NIST 800-53 Rev4",
    "NIST CSF",
    "NIST SP 800-171 Revision 2",
    "PCI DSS v3.2.1",
    "PIPEDA"
  ]
}