{
  "policyUpi": "PC-AWS-RDS-1129",
  "policyId": "a95b30ca-281f-4ff9-b7c4-1f5543086f7c",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "medium",
  "name": "AWS RDS database instance not configured with encryption in transit",
  "description": "This policy identifies AWS RDS database instances that are not configured with encryption in transit. This covers MySQL, SQL Server, PostgreSQL, MariaDB, and DB2 RDS instances.\n\nEnabling encryption is crucial to protect data as it moves through the network and enhances the security between clients and storage servers. Without encryption, sensitive data transmitted between your application and the database is vulnerable to interception by malicious actors. This could lead to unauthorized access, data breaches, and potential compromises of confidential information.\n\nIt is recommended that data be encrypted while in transit to ensure its security and reduce the risk of unauthorized access or data breaches.",
  "rule.criteria": "4ea6de73-a950-4d1b-95ba-84a5d9f4b5d4",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name = 'aws-rds-describe-db-instances' as X; config from cloud.resource where api.name = 'aws-rds-describe-db-parameter-groups' AND json.rule = (((dbparameterGroupFamily starts with \"postgres\" or dbparameterGroupFamily contains \"sqlserver\") and (['parameters'].['rds.force_ssl'].['parameterValue'] does not equal 1 or ['parameters'].['rds.force_ssl'].['parameterValue'] does not exist)) or ((dbparameterGroupFamily starts with \"mariadb\" or dbparameterGroupFamily starts with \"mysql\") and (parameters.require_secure_transport.parameterValue does not equal 1 or parameters.require_secure_transport.parameterValue does not exist)) or (dbparameterGroupFamily contains \"db2-ae\" and (parameters.db2comm.parameterValue does not equal ignore case \"SSL\" or parameters.db2comm.parameterValue does not exist))) as Y; filter '$.X.dbparameterGroups[*].dbparameterGroupArn equals $.Y.dbparameterGroupArn' ; show X;",
  "recommendation": "To enable the in-transit encryption feature for your Amazon RDS databases, perform the following actions:\n\nDefault parameter groups for RDS DB instances cannot be modified. Therefore, you must create a custom parameter group, modify it, and then attach it to your RDS for DB instances. Changes to parameters in a customer-created DB parameter group are applied to all DB instances that are associated with the DB parameter group.\n\nFollow the below links to create and associate a DB parameter group with a DB instance,\n\nTo Create a DB parameter group, refer to the below link\nhttps://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_WorkingWithDBInstanceParamGroups.html#USER_WorkingWithParamGroups.Creating\n\nTo Associating a DB parameter group with a DB instance, refer the below link\nhttps://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_WorkingWithDBInstanceParamGroups.html#USER_WorkingWithParamGroups.Associating\n\nTo Modifying parameters in a DB parameter group,\n\n1. Sign in to the AWS Management Console and open the Amazon RDS console at https://console.aws.amazon.com/rds/.\n2. In the navigation pane, choose 'Parameter Groups'.\n3. In the list, choose the parameter group that is associated with the RDS instance.\n4. For Parameter group actions, choose 'Edit'.\n5. Change the values of the parameters that you want to modify. You can scroll through the parameters using the arrow keys at the top right of the dialog box.\n6. In the 'Modifiable parameters' section, enter 'rds.force_ssl' in the Filter Parameters search box for SQL Server and PostgreSQL  databases, and type 'require_secure_transport' in the search box for MySQL and MariaDB databases and type DB2COMM for DB2 databases.\n a. For the 'rds.force_ssl' database parameter, enter '1' in the Value configuration box to enable the Transport Encryption feature. \n  or\n    b. For the 'require_secure_transport' parameter, enter '1' in the Value configuration box to enable the Transport Encryption feature.\n    or\n    c. For the 'DB2COMM' parameter, enter 'SSL' in the Value box based on the allowed values to enable Transport Encryption.\n7. Choose Save changes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM) (Latest)",
    "CRI Profile v2.0",
    "CSA CCM v4.0.12",
    "Cloud Security Assurance Program (CSAP) - IaaS",
    "Cloud Security Assurance Program (CSAP) - Low",
    "Cloud Security Assurance Program (CSAP) - Low SaaS",
    "Cloud Security Assurance Program (CSAP) - SaaS Simplified",
    "DORA",
    "HIPAA",
    "HITRUST CSF v.11.2.0",
    "ISO/IEC 27001:2022",
    "ITSG-33",
    "Insurance Regulatory And Development Authority Of India",
    "Microsoft Cloud Security Benchmark v1",
    "NCSC Cloud Security Principles",
    "NIST 800-53 Rev 5",
    "NIST CSF v2.0",
    "NIST SP 800-171 Revision 3",
    "NYDFS 23 CRR-NY 500.0",
    "PCI DSS v4.0.1",
    "SEBI - Consolidated Cybersecurity and Cyber Resilience Framework (CSCRF)",
    "SOC 2",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}