{
  "policyUpi": "PC-ALL-ALL-805",
  "policyId": "8bfa2a36-1ac4-48dc-bb34-70bc3f412572",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS RDS managed ENI reachable from any untrust internet source",
  "description": "Unsecured AWS RDS instances, accessible from the internet, are vulnerable to unauthorized access and data breaches. These instances expose sensitive data to potential attacks from untrusted sources.\n\nAWS RDS managed Elastic Network Interfaces (ENIs) provide network connectivity for RDS instances. If an ENI is accessible from any untrusted internet source, attackers can exploit this misconfiguration to gain unauthorized access, leading to data exfiltration, database manipulation, and service disruptions. Ignoring this best practice significantly increases the attack surface.\n\nThe impact of this misconfiguration is severe, potentially resulting in data loss, regulatory fines, and reputational damage. Restricting access to known trusted sources protects sensitive data and reduces the risk of compromise. It ensures that only authorized entities can interact with the RDS instance.\n\nTo mitigate this risk, implement network access controls. Restrict inbound traffic to only trusted IP addresses or security groups. Consider using a Virtual Private Cloud (VPC) with appropriate security group rules to isolate RDS instances from the public internet. Regularly review and update these configurations to maintain security.",
  "rule.criteria": "14e258a9-d851-4e0a-a1c4-9ebcc6aece88",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'Interface' and dest.cloud.type = 'AWS' and dest.network.interface.owner in ( 'amazon-rds')",
  "recommendation": "The following steps are recommended to restrict traffic from the Internet:\n1. Visit the Network path Analysis from Source to Destination and review the network path components that allow internet access.\n2. Identify the network component on which restrictive rules can be implemented.\n3. Implement the required changes and make sure no other resources have been impacted due to these changes:\n a) The overly permissive Security Group rules can be made more restrictive.\n b) Move the RDS database instance inside a restrictive subnet.\n c) Define a NAT rule to restrict traffic coming from the Internet to the respective RDS database instance.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}