{
  "policyUpi": "PC-AWS-LMB-1054",
  "policyId": "7bf83882-02ad-4f79-803c-ed4588e166cd",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "medium",
  "name": "AWS Lambda function URL having overly permissive cross-origin resource sharing permissions",
  "description": "AWS Lambda functions with overly permissive CORS configurations expose sensitive data and functionality to unauthorized access. Improperly configured CORS settings, specifically using wildcard characters in 'allowOrigins', enable any origin to invoke the function.\n\nLambda functions act as crucial components in serverless architectures. Misconfiguration of CORS settings allows malicious actors to send unauthorized requests, potentially leading to data breaches, denial-of-service attacks, or exploitation of the function's logic via cross-site scripting. This undermines the security of your application and its associated data.\n\nThe impact of this misconfiguration is significant, potentially resulting in unauthorized data access, application logic manipulation, and service disruption. Restricting CORS configuration to specific origins and HTTP methods ensures that only legitimate clients can interact with the Lambda function, mitigating these risks.\n\nTo remediate, configure Lambda function CORS settings to explicitly list allowed origins ('allowOrigins') and HTTP methods ('allowMethods'). Avoid using wildcard characters. Regularly review and update these settings as your application's access needs change. Employ least privilege principles in configuring your Lambda function's access control.",
  "rule.criteria": "c7ce78c7-5412-43f0-ae9c-c90410957502",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name= 'aws-lambda-list-functions' AND json.rule = cors exists and cors.allowOrigins[*] contains \"*\" and cors.allowMethods[*] contains \"*\"",
  "recommendation": "To properly configure CORS permissions, refer the following URL:\nhttps://docs.aws.amazon.com/lambda/latest/dg/API_Cors.html",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "Framework for Adoption of Cloud Services by SEBI Regulated Entities (REs)",
    "HIPAA",
    "HITRUST CSF v.11.2.0",
    "ISO/IEC 27001:2022",
    "MITRE ATT&CK v15.1 Cloud IaaS for Enterprise",
    "NCSC - Cyber Essentials",
    "NIST 800-53 Rev 5",
    "NIST SP 800-171 Revision 3",
    "SOC 2",
    "Secure Controls Framework (SCF) - 2024.2",
    "TX-RAMP Level 1"
  ]
}