{
  "policyUpi": "PC-ALL-ALL-803",
  "policyId": "ad23603d-754e-4499-8988-b80178785898",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS EC2 instance with network path from the internet (0.0.0.0/0)",
  "description": "AWS EC2 instances accessible from the internet (0.0.0.0/0) present a significant security risk. This allows unauthorized access to the instance, potentially leading to data breaches and system compromise.\n\nThe EC2 instance's security group (SG) allows unrestricted inbound traffic. This misconfiguration exposes the instance to attacks from untrusted IPs, including brute-force attacks targeting common ports or exploits leveraging known vulnerabilities. Lack of proper access control increases the attack surface and the likelihood of successful compromise.\n\nCompromise of an EC2 instance with unrestricted internet access can lead to data exfiltration, unauthorized resource usage, and lateral movement within the cloud environment. Restricting inbound traffic to only necessary sources significantly reduces the attack surface and mitigates the risk of unauthorized access.\n\nImplement least privilege access by configuring the EC2 instance's SG to allow only necessary inbound traffic from specific IP addresses or ranges. Regularly review and update SGs to ensure they reflect current security requirements. Utilize other security mechanisms, such as web application firewalls (WAFs), to further protect the instance.",
  "rule.criteria": "893e3897-af4b-4cbe-b665-23e1f19f8f0b",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'Instance' and dest.cloud.type = 'AWS' and dest.resource.state = 'Active'",
  "recommendation": "Restrict Internet exposure of reported EC2 instances based on your business requirements by modifying security group rules to the trusted IP address\n\n1. Sign in to the AWS Console\n2. Navigate to EC2 Dashboard\n3. Identify the reported EC2 instances that you want to restrict public access\n4. Go to the 'Security' tab\n5. For each security group listed under the 'Security group' section\n6. Select 'Edit inbound rules'\n7. Update inbound rules that allow unrestricted access (0.0.0.0/0) such that the CIDR range 0.0.0.0/0 does not exist\n8. Click 'Save rules' to apply the changes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}