{
  "policyUpi": "PC-AWS-ASY-1180",
  "policyId": "a0862fa8-256a-458f-9a63-192add13a53f",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "informational",
  "name": "AWS AppSync GraphQL API is authenticated with API key",
  "description": "This policy identifies the AWS AppSync Graphql API using API key for primary or additional authentication methods.\n\nAWS AppSync GraphQL API is a fully managed service by Amazon Web Services for building scalable and secure GraphQL APIs. An API key is a hard-coded value in your application generated by the AWS AppSync service when you create an unauthenticated GraphQL endpoint. Using API keys for authentication can pose security risks such as exposure to unauthorized access and limited control over access privileges, potentially compromising sensitive data and system integrity.\n\nIt is recommended to use authentication methods other than API Keys like IAM, Amazon Cognito User Pools, or OpenID Connect providers for securing AWS AppSync GraphQL APIs, to ensure enhanced security and access control.",
  "rule.criteria": "b5b1d9bb-1d61-45e3-961e-3a417aba7e40",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name = 'aws-appsync-graphql-api' AND json.rule = authenticationType equals \"API_KEY\" or additionalAuthenticationProviders[?any( authenticationType equals \"API_KEY\" )] exists",
  "recommendation": "Note: Changing the API authorization mode from API key to other methods could cause potential disruptions to existing clients or applications relying on API key authentication. It may require updates to client configurations and authentication workflows for your applications.\n\nTo update the Primary authorization mode option for your AWS AppSync GraphQL API, perform the following actions:\n\n1. Sign in to the AWS Management Console\n2. Select the specific region from the region drop-down in the top right corner, for which the alert is generated\n3. In the Navigation Panel on the left, Select 'All services' and under 'Front-end Web & Mobile', select 'AWS AppSync'\n4. Under the 'APIs' section, select the AppSync API that is reported\n5. Navigate to the 'Settings page' from the left panel, Click 'Edit' on the 'Primary authorization mode' section\n6. In the 'Primary authorization mode' window, change the 'Authorization mode' from 'API key' to other authentication methods and configure it according to your business requirements\n7. Click 'Save'\n\nTo update the Additional authorization modes for your AWS AppSync GraphQL API, perform the following actions:\n\n1. Sign in to the AWS Management Console\n2. Select the specific region from the region drop-down in the top right corner, for which the alert is generated\n3. In the Navigation Panel on the left, Select 'All services' and under 'Front-end Web & Mobile', select 'AWS AppSync'\n4. Under the 'APIs' section, select the AppSync API that is reported\n5. Navigate to the 'Settings page' from the left panel, and click 'Add' in the 'Additional authorization modes' section.\n6. In the 'Additional authorization mode' window, select any 'Authorization mode' except 'API key' and configure according to your business requirements, and click 'Add'\n7. Navigate to the 'Settings page' from the left panel, select the 'API key' in the 'Authorization mode' column from the 'Additional authorization modes' section, and click 'Delete' to remove the API key authorization mode",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ITSG-33",
    "NYDFS 23 CRR-NY 500.0",
    "SOC 2",
    "Secure Controls Framework (SCF) - 2024.2",
    "TX-RAMP Level 1",
    "TX-RAMP Level 2"
  ]
}