{
  "policyUpi": "PC-AWS-CWT-726",
  "policyId": "ebb95367-d356-4be9-a7d1-19e78f29cf18",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "low",
  "name": "AWS CloudWatch Log groups not configured with definite retention days",
  "description": "This policy identifies CloudWatch Log groups that are not configured with definite retention days. The retention period should be used to specify how long log events are kept in CloudWatch Logs. Expired log events get deleted automatically. If the retention period is not configured then logs will be retained indefinitely with increasing cost. Different log groups may require different retention periods, depending on operational and regulatory constraints. It is recommended to set a definite retention period for each CloudWatch Log group depending on your operational and regulatory constraints instead of retained indefinitely.",
  "rule.criteria": "5f6c2a65-33ed-4afe-8ea4-6bf2636d5806",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name = 'aws-cloudwatch-log-group' AND json.rule = retentionInDays does not exist",
  "recommendation": "Reducing the CloudWatch Log groups retention period will permanently delete older log data; So set a retention period for each CloudWatch Log group depending on your operational and regulatory constraints considering same.\n1. Log in to the AWS Console\n2. In the console, select the specific region from the region drop-down on the top right corner, for which the alert is generated.\n3. Navigate to the CloudWatch dashboard \n4. Click on the Log groups (Left panel)\n5. Select the reported Log group\n6. Click on 'Actions' and select 'Edit retention setting(s)'\n7. On the 'Retention setting' pop-up, choose retention days other than 'Never expire'\n8. Click on 'Save'",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "MAS TRM 2021",
    "Risk Management in Technology (RMiT)"
  ]
}