{
  "policyUpi": "PC-ALL-ALL-870",
  "policyId": "37e2852a-2596-43d7-a573-cd2b468b1df2",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS EC2 instance with network path from the untrust internet source on ports with high risk",
  "description": "AWS EC2 instances accessible from untrusted internet sources via high-risk ports present a significant security risk. Exposure on these ports increases the likelihood of unauthorized access and data breaches.\n\nEC2 instances with inbound network paths from untrusted IP addresses on ports commonly targeted by attackers. Open access on these ports without proper controls allows malicious actors to easily exploit known vulnerabilities or attempt brute-force attacks, leading to potential compromise of the instance and its associated data.\n\nA misconfiguration allowing access from untrusted sources exposes the EC2 instance to various attacks, resulting in data breaches, system compromise, and potential financial losses. Restricting access to trusted sources minimizes the attack surface and enhances overall security posture.\n\nMitigation involves implementing strict inbound security group rules, only allowing access from explicitly trusted IP addresses or specific ranges. Regularly review and update these rules, removing any unnecessary open ports. Employ additional security measures such as web application firewalls and intrusion detection systems for comprehensive protection.\n\nNOTE: Trusted IP List allows administrators to specify a list of IP addresses that are considered trusted or safe.",
  "rule.criteria": "74578f09-bd27-46a6-9849-9e1e998b8558",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'Instance' and dest.cloud.type = 'AWS' and dest.resource.state = 'Active' and protocol.ports in ( 'tcp/20:21', 'tcp/23', 'tcp/25', 'tcp/110', 'tcp/135', 'tcp/143', 'tcp/445', 'tcp/1433:1434', 'tcp/3000', 'tcp/3306', 'tcp/4333', 'tcp/5000', 'tcp/5432', 'tcp/5500', 'tcp/5601', 'tcp/8080', 'tcp/8088', 'tcp/8888', 'tcp/9200', 'tcp/9300' )",
  "recommendation": "Restrict Internet exposure of reported EC2 instances based on your business requirements by modifying security group rules to the trusted IP address\n\n1. Sign in to the AWS Console\n2. Navigate to EC2 Dashboard\n3. Identify the reported EC2 instances that you want to restrict public access\n4. Go to the 'Security' tab\n5. For each security group listed under the 'Security group' section\n6. Select 'Edit inbound rules'\n7. Add the IP addresses from the trusted IP addresses.\n8. Click 'Save rules' to apply the changes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}