{
  "policyUpi": "PC-AWS-ASM-1134",
  "policyId": "8d4c6ccf-d558-49ff-ab7f-6db986b065f5",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "low",
  "name": "AWS Secrets Manager secret not encrypted by Customer Managed Key (CMK)",
  "description": "This policy identifies AWS Secrets Manager secrets that are encrypted using the default KMS key instead of CMK (Customer Managed Key) or using a CMK that is disabled.\n\nAWS Secrets Manager secrets are a secure storage solution for sensitive information like passwords, API keys, and tokens in the AWS cloud. Secrets Manager secrets are encrypted by default by AWS managed key but users can specify CMK to get enhanced security, control over the encryption key, and also comply with any regulatory requirements.\n\nAs a security best practice, using CMK to encrypt your Secrets Manager secrets is advisable as it gives you full control over the encrypted data.",
  "rule.criteria": "e6503172-b262-4949-b651-e8ffb3947167",
  "searchModel.query": "config from cloud.resource where api.name = 'aws-secretsmanager-describe-secret' as X; config from cloud.resource where api.name = 'aws-kms-get-key-rotation-status' AND json.rule = keyMetadata.keyManager does not equal CUSTOMER or (keyMetadata.keyManager equals CUSTOMER and keyMetadata.keyState equals Disabled) as Y; filter '($.X.kmsKeyId does not exist ) or ($.X.kmsKeyId exists and $.X.kmsKeyId equals $.Y.keyMetadata.arn)'; show X;",
  "recommendation": "To change the encryption key for a Secrets Manager secret:\n1. Open the Secrets Manager console at https://console.aws.amazon.com/secretsmanager/.\n2. From the list of secrets, choose the reported secret.\n3. On the secret details page, in the Secrets details section, choose Actions, and then choose 'Edit encryption key'.\n4. in the 'Encryption key' section choose the Customer Managed Key created and managed by you in AWS Key Management Service (KMS) based on your business requirement.\n5. Click 'Save' button to save the changes.\nNote: When using customer-managed CMKs to encrypt Secrets Manager secret, Ensure authorized entities have access to the key and its associated operations.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CSA CCM v4.0.12",
    "GDPR",
    "HIPAA",
    "HITRUST CSF v.11.2.0",
    "Microsoft Cloud Security Benchmark v1",
    "NIST 800-53 Rev 5",
    "NYDFS 23 CRR-NY 500.0",
    "TX-RAMP Level 1"
  ]
}