{
  "policyUpi": "PC-AWS-SSM-1102",
  "policyId": "f2c87a87-bf6d-4c09-8b33-bd0b16f7ad29",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS Systems Manager EC2 instance having NON_COMPLIANT patch compliance status",
  "description": "Unpatched AWS EC2 instances managed by AWS Systems Manager pose a significant security risk. Attackers can exploit known vulnerabilities in outdated systems to gain unauthorized access or execute malicious code.\n\nAWS Systems Manager monitors EC2 instance patch compliance status. A 'NON_COMPLIANT' status, especially for critical or high-severity patches, indicates missing security updates. This misconfiguration leaves instances vulnerable to various attacks, including remote code execution, privilege escalation, and data breaches.\n\nThe impact of this misconfiguration is substantial. Compromised instances can lead to data theft, service disruptions, and reputational damage. Maintaining up-to-date patches is crucial for minimizing the attack surface and ensuring system stability. Regular patching strengthens the security posture.\n\nTo mitigate this risk, implement automated patching processes through AWS Systems Manager. Regularly scan for and apply critical and high-severity patches to all EC2 instances. Enable automatic patching for non-critical updates where appropriate. Monitor patch compliance status actively and promptly address any 'NON_COMPLIANT' instances.",
  "rule.criteria": "067ae0bd-2316-4204-981c-968f9ad25303",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name = 'aws-ssm-resource-compliance-summary' AND json.rule = Status equals \"NON_COMPLIANT\" and ComplianceType contains \"Patch\" and ResourceType contains \"ManagedInstance\" and (NonCompliantSummary.SeveritySummary.CriticalCount greater than 0 or NonCompliantSummary.SeveritySummary.HighCount greater than 0)",
  "recommendation": "To remediate the non-compliant managed instances please refer to the below URL:\n\nhttps://docs.aws.amazon.com/systems-manager/latest/userguide/patch-manager-compliance-remediation.html",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM) (Latest)",
    "Microsoft Cloud Security Benchmark v1"
  ]
}