{
  "policyUpi": "PC-AWS-VPC-305",
  "policyId": "4d919861-9af6-43ec-a18b-1eebf4a4daaa",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "low",
  "name": "AWS VPC Security group nearing availability limit",
  "description": "This policy identifies VPCs which are nearing availability limit of Security groups. AWS provides a reasonable starting limitation for the maximum number of VPC security groups you can assign in each VPC. If you approach the limit in a particular VPC, you have nearly exhausted your allocation. As a best practice, it is recommended to remove Security groups that are not associated or not used, it will also help you avoid unexpected charges on your bill.\nNOTE: As per https://docs.aws.amazon.com/vpc/latest/userguide/amazon-vpc-limits.html. On the date, VPC Security groups per region limit is 2500. This policy will trigger an alert if VPC Security groups per region reached 80% (i.e. 2000) of resource availability limit allocated. If you need more Security groups in a VPC, You can contact AWS for a service limit increase.",
  "rule.criteria": "f1d37839-e0de-44d5-8fb9-94156e3e4b39",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name = 'aws-ec2-describe-vpcs'  AND json.rule = 'securityGroupCount > 2000'",
  "recommendation": "1. Sign into the AWS console\n2. In the console, select the specific region from region drop down on the top right corner, for which the alert is generated\n3. Navigate to VPC Dashboard\n4. Click on 'Security Groups' (Left Panel)\n5. Choose the Security Groups you want to delete, which is no more used or required\n6. Click on 'Actions' dropdown\n7. Click on 'Delete security group'\nNOTE: If Security Group is already in use it can not be deleted. Make sure security group unassociated before going to deleting it.\n8. On 'Delete security group' popup dialog, Click on 'Delete security group'\nNOTE: If existing Subnets are properly associated and exhausted your VPC Subnets limit allocation, you can contact AWS for a service limit increase.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "APRA (CPS 234) Information Security",
    "Australian Energy Sector Cyber Security Framework (AESCSF)",
    "Brazilian Data Protection Law (LGPD)",
    "CIS Controls v7.1",
    "CIS Controls v8",
    "CSA CCM v.4.0.1",
    "Cybersecurity Maturity Model Certification (CMMC) v.1.02",
    "HITRUST CSF v.9.6.0",
    "HITRUST v.9.4.2",
    "ISO/IEC 27002:2013",
    "ISO/IEC 27017:2015",
    "ISO/IEC 27018:2019",
    "MAS TRM 2021",
    "NIST CSF",
    "NIST SP 800-171 Revision 2",
    "NIST SP 800-172",
    "PCI DSS v3.2.1"
  ]
}