{
  "policyUpi": "PC-AWS-RDS-1117",
  "policyId": "815e430a-9f43-4d25-b6ef-d93ea5239a1d",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "informational",
  "name": "AWS RDS Postgres Cluster does not have query logging enabled",
  "description": "This policy identifies RDS Postgres clusters with query logging disabled.\n\nIn AWS RDS PostgreSQL, by default, the logging level captures login failures, fatal server errors, deadlocks, and query failures. To log data changes, we recommend enabling cluster logging for monitoring and troubleshooting. To obtain adequate logs, an RDS cluster should have log_statement and log_min_duration_statement parameters configured.\n\nIt is a best practice to enable additional RDS cluster logging, which will help in data change monitoring and troubleshooting.",
  "rule.criteria": "75534da4-6dfa-4d6e-b76b-e2d56fbe955a",
  "searchModel.query": "config from cloud.resource where api.name = 'aws-rds-db-cluster-parameter-group' AND json.rule = parameters.log_min_duration_statement.ParameterValue does not exist or parameters.log_min_duration_statement.ParameterValue equals -1 as X; config from cloud.resource where api.name= 'aws-rds-db-cluster' AND json.rule = status contains available and engine contains postgres as Y; filter '$.X.DBClusterParameterGroupName equals $.Y.dbclusterParameterGroup'; show Y;",
  "recommendation": "To modify the custom DB cluster parameter group to enable query logging, follow the below steps:\n\n1. Sign in to the AWS Management Console and open the Amazon RDS console.\n2. In the navigation pane, choose 'Parameter groups'.\n3. In the list, choose the above-created parameter group that you want to modify.\n4. For Parameter group actions, choose 'Edit'.\n5. Change the value of the 'log_min_duration_statement parameter' to any value other than -1 you want to modify.\n6. Change the value of 'log_statement' according to the requirements.\n7. Choose 'Save Changes'.\n8. Reboot the primary (writer) DB instance in the cluster to apply the changes to it.\n9. Then reboot the reader DB instances to apply the changes to them.\n\nPlease create a custom parameter group if the cluster has only the default parameter group using the following steps:\n\n1. Sign in to the AWS Management Console and open the Amazon RDS console.\n2. In the navigation pane, choose 'Parameter groups'.\n3. Choose 'Create parameter group'. The Create parameter group window appears.\n4. In the Parameter group family list, select a 'DB parameter group family'.\n5. In the Type list, select 'DB cluster parameter group'.\n6. In the Group name box, enter the name of the new DB cluster parameter group.\n7. In the Description box, enter a description for the new DB cluster parameter group.\n8. Choose 'Create'.\n\nTo modify an RDS cluster to use the custom parameter group, follow the below steps:\n\n1. Sign in to the AWS Management Console and open the Amazon RDS console.\n2. In the navigation pane, choose 'Databases', and then choose the 'DB instance' that you want to modify.\n3. Choose 'Modify'. The Modify DB instance page appears.\n4. Under 'Additional Configuration', select the above-created cluster parameter group from the DB parameter group dropdown.\n5. Choose 'Continue' and check the summary of modifications.\n6. (Optional) Choose 'Apply immediately' to apply the changes immediately. Choosing this option can cause downtime in some cases.\n7. On the confirmation page, review your changes. If they are correct, choose 'Modify DB instance' to save your changes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "DORA",
    "HIPAA",
    "ISO/IEC 27001:2022",
    "SOC 2"
  ]
}