{
  "policyUpi": "PC-ALL-ALL-1300",
  "policyId": "4157a1ed-9145-4afa-8369-6d0b7a5683bf",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS EKS K8s service with network path from the internet (0.0.0.0/0) on ports 80/443",
  "description": "This policy identifies AWS EKS K8s services that have network paths open to the internet (0.0.0.0/0) on ports 80 or 443.\n\nExposing container services to the internet increases the risk of unauthorized access, cyber attacks, and data breaches by expanding the attack surface for malicious actors. Services open on ports 80 and 443, which are used for HTTP and HTTPS protocols, are particularly vulnerable to attacks such as brute force attempts, vulnerability exploits, cross-site scripting (XSS), SQL injections, cross-site request forgeries (CSRF), and DDoS attacks.\n\nAs a best practice, restrict traffic from unknown IP addresses and limit access to trusted hosts, services, or specific entities.",
  "rule.criteria": "2c9c4c1b-a08e-45a8-823a-bfc2abad2e37",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'K8s Service' and dest.cloud.type = 'AWS' and protocol.ports in ( 'tcp/80' , 'tcp/443' )",
  "recommendation": "The following steps are recommended to restrict AWS K8s service from having unrestricted access from the Internet:\n1. Visit the Network path Analysis from Source to Destination and review the network path components that allow internet access.\n2. Identify the network component on which restrictive rules can be implemented.\n3. Implement the necessary changes and ensure no other resources have been impacted due to these changes:\n a) The overly permissive security group rules can be made more restrictive.\n b) Move the container/application inside a restrictive subnet if public accessibility is not required.\n c) Control access to service by specifying allowed IP addresses or ranges in the service configuration.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}