{
  "policyUpi": "PC-AWS-ES-215",
  "policyId": "4b411b41-7f4d-4626-884e-5ba8abd2a739",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "medium",
  "name": "AWS Elasticsearch domain publicly accessible",
  "description": "This policy identifies Elasticsearch domains which are publicly accessible. Enabling VPCs for Elasticsearch domains provides flexibility and control over the clusters access with an extra layer of security than Elasticsearch domains that use public endpoints. It also keeps all traffic between your VPC and Elasticsearch domains within the AWS network instead of going over the public Internet.",
  "rule.criteria": "57c3fd57-0e6a-4be5-ad77-a9c278a9ba3e",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name = 'aws-es-describe-elasticsearch-domain' AND json.rule = 'endpoints does not exist or endpoints.vpc does not exist or endpoints.vpc is empty'",
  "recommendation": "VPC for AWS Elasticsearch domain can be set only at the time of the creation of domain. So to resolve this alert, create a new domain with VPC, then migrate all required Elasticsearch domain data from the reported Elasticsearch domain to this newly created domain and delete reported Elasticsearch domain.\n\nTo set up the new ES domain with VPC, perform the following:\n1. Sign into the AWS console\n2. In the console, select the specific region from region drop down on the top right corner, for which the alert is generated\n3. Navigate to Elasticsearch Service Dashboard\n4. Click on 'Create a new domain' button to launch a new ES domain\n5. On the 'Define domain' page, define the Elasticsearch domain name, Elasticsearch version and click on 'Next'\n6. On the 'Configure cluster' page, Set the new domain parameters which are same as of reported domain configuration details.\n7. On the 'Set up access' page,\n7a. Under 'Network configuration' section, Choose 'VPC access (Recommended)'\n7b. Select desired VPC, Subnet and Security Group from the drop-down list from respective tabs, Click on 'Next'\n8. On the 'Review' page, verify the domain configuration details\n9. Click on 'Confirm' to launch your new AWS Elasticsearch domain, enabled with VPC.\n10. Once the new AWS ES domain is created, upload the data from the source domain to the new ES domain.\n\nTo delete reported ES domain, perform the following:\n1. Sign into the AWS console\n2. In the console, select the specific region from region drop down on the top right corner, for which the alert is generated\n3. Navigate to Elasticsearch Service Dashboard\n4. Choose reported Elasticsearch domain\n5. Click on 'Delete Domain'\n6. On 'Delete Domain' dialog popup, check the 'Delete the domain <DOMAIN_NAME>' and click on 'Delete' button",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CCPA 2018",
    "MITRE ATT&CK [Beta]",
    "Multi-Level Protection Scheme (MLPS) v2.0",
    "NIST 800-53 Rev 5",
    "NIST 800-53 Rev4",
    "PIPEDA"
  ]
}