{
  "policyUpi": "PC-AWS-LMB-263",
  "policyId": "052c5035-c362-452d-b0dc-31aa3eff4aae",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "low",
  "name": "AWS Lambda Environment Variables not encrypted at-rest using CMK",
  "description": "When you create or update Lambda functions that use environment variables, AWS Lambda encrypts them using the AWS Key Management Service. When your Lambda function is invoked, those values are decrypted and made available to the Lambda code.\n\nThis policy verifies that Lambda function uses the AMS Key Management Service to encrypt variables at-rest with CMK.",
  "rule.criteria": "32a1d344-8775-4f08-835d-adf913f12555",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name = 'aws-lambda-list-functions' AND json.rule = environment.variables exists and kmskeyArn does not exist",
  "recommendation": "Enable Lambda Environment Variable at-rest encryption.\n\n1. Go to the AWS console Lambda dashboard.\n2. Click on the function name.\n3. Under 'Environment variables', expand 'Encryption configuration.' \n4. Under 'KMS key to encrypt at rest', choose 'Use a customer master key.'\n5. Change the value of the dropdown menu to use your own CMK.\n6. Select Save on upper right side of the page.\n\nAdditional Information\n\nTo protect your environment variables, Prisma Cloud advises that you should select the 'Enable encryption helpers' checkbox when creating (or updating) your function. By selecting this option, your environment variables will be individually encrypted using a CMK of your choice. When supplying your own CMK key, you'll need to add kms:Decrypt to your execution role. In addition, the user that will be creating and updating the Lambda function must have permissions to use the KMS key.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CCPA 2018",
    "Multi-Level Protection Scheme (MLPS) v2.0",
    "NIST 800-53 Rev 5",
    "NIST 800-53 Rev4",
    "PIPEDA"
  ]
}