{
  "policyUpi": "PC-AWS-EB-1145",
  "policyId": "f8f20be3-a2a3-4961-9a3c-5b70ff7d9269",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "informational",
  "name": "AWS Elastic Beanstalk environment logging not configured",
  "description": "This policy identifies the Elastic Beanstalk environments not configured to send logs to CloudWatch Logs.\n\nAn Elastic Beanstalk environment is a configuration of AWS resources where you can deploy your application. The environment logs refer to the logs generated by various components of your application, which can provide valuable insights into any errors or issues that may arise during operation. Failing to enable logging in an Elastic Beanstalk environment reduces visibility, hinders incident detection and response, and increases vulnerability to security breaches.\n\nIt is recommended to configure AWS Elastic Beanstalk environments to send logs to CloudWatch to ensure security and meet compliance requirements.",
  "rule.criteria": "bd9b8fc0-051b-417a-8f7b-805c26a25f39",
  "searchModel.query": "config from cloud.resource where api.name = 'aws-elasticbeanstalk-environment' AND json.rule = status does not equal \"Terminated\" as X; config from cloud.resource where api.name = 'aws-elasticbeanstalk-configuration-settings' AND json.rule = configurationSettings[*].optionSettings[?any( optionName equals \"StreamLogs\" and value equals \"false\" )] exists as Y; filter ' $.X.environmentName equals $.Y.configurationSettings[*].environmentName and $.X.applicationName equals $.Y.configurationSettings[*].applicationName'; show X;",
  "recommendation": "To stream Elastic Beanstalk environment logs to CloudWatch Logs,\n1. Sign in to the AWS console.\n2. In the console, select the specific region from the region drop-down on the top right corner, for which the alert is generated.\n3. Go to 'Elastic Beanstalk' service.\n4. In the navigation pane, choose 'Environments', then select the reported environment's name from the list.\n5. In the navigation pane, choose Configuration.\n6. In the 'Updates, monitoring, and logging' configuration category, choose Edit.\n7. Under 'Instance log streaming to CloudWatch Logs', Enable Log streaming by selecting the 'Activated' checkbox.\n8. Set 'Retention' to the number of days to save the logs.\n9. Select the 'Lifecycle' setting that determines whether the logs are saved after the environment is terminated according to your business requirements.\n10. To save the changes choose 'Apply' at the bottom of the page.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CIS Controls v8.1",
    "DORA",
    "GDPR",
    "ISO/IEC 27001:2022",
    "SOC 2"
  ]
}