{
  "policyUpi": "PC-ALL-ALL-806",
  "policyId": "d42a754c-acfe-4be8-8c42-7b3cc6af1851",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS Redshift managed ENI reachable from any untrust internet source",
  "description": "AWS Redshift clusters with managed Elastic Network Interfaces (ENIs) accessible from the public internet pose a significant security risk. These clusters are vulnerable to unauthorized access and potential data breaches.\n\nRedshift managed ENIs allow network connectivity to the Redshift cluster. Publicly accessible ENIs bypass security controls, enabling attackers to directly connect to the cluster without authentication or authorization. This exposes sensitive data stored within the Redshift cluster to malicious actors.\n\nA misconfiguration allowing internet access to a Redshift cluster can lead to data exfiltration, unauthorized data modification, and service disruption. Restricting access to trusted sources only ensures that only authorized users and applications can interact with the cluster, mitigating these risks.\n\nTo remediate this, restrict inbound network traffic to the Redshift cluster's ENIs. Configure network access control lists (ACLs) or security groups to allow traffic only from known, trusted IP addresses or subnets. Regularly review and update these security controls to maintain a strong security posture.",
  "rule.criteria": "40eb4d49-bda7-47b6-a943-6a20218c25fe",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'Interface' and dest.cloud.type = 'AWS' and dest.network.interface.owner in ( 'amazon-redshift' )",
  "recommendation": "The following steps are recommended to restrict traffic from the Internet:\n1. Visit the Network path Analysis from Source to Destination and review the network path components that allow internet access.\n2. Identify the network component on which restrictive rules can be implemented.\n3. Implement the required changes and make sure no other resources have been impacted due to these changes:\n a) The overly permissive Security Group rules can be made more restrictive.\n b) Move the Redshift cluster inside a restrictive subnet if the cluster does not need to be publicly accessible.\n c) Define a NAT rule to restrict traffic coming from the Internet to the respective Redshift cluster.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}