{
  "policyUpi": "PC-AWS-R53-1036",
  "policyId": "4b9dfe10-c19c-4b9f-a9d4-456cdea8d428",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS Route53 Hosted Zone having dangling DNS record with subdomain takeover risk associated with AWS Elastic Beanstalk Instance",
  "description": "This policy identifies AWS Route53 Hosted Zones which have dangling DNS records with subdomain takeover risk. A Route53 Hosted Zone having a CNAME entry pointing to a non-existing Elastic Beanstalk (EBS) will have a risk of these dangling domain entries being taken over by an attacker by creating a similar Elastic beanstalk (EBS) in any AWS account which the attacker owns / controls. Attackers can use this domain to do phishing attacks, spread malware and other illegal activities. As a best practice, it is recommended to delete dangling DNS records entry from your AWS Route 53 hosted zones.\n\nNote: Please ignore the reported alert if the Elastic Beanstalk (EBS) configured in the Route53 Hosted Zone DNS record are in different accounts. ",
  "rule.criteria": "5d345501-f43f-48be-90c1-b0d1d4a14a26",
  "searchModel.query": "config from cloud.resource where api.name = 'aws-route53-list-hosted-zones' AND json.rule = hostedZone.config.privateZone is false and resourceRecordSet[?any( type equals CNAME and resourceRecords[*].value contains elasticbeanstalk.com)] exists as X; config from cloud.resource where api.name = 'aws-elasticbeanstalk-environment' as Y; filter 'not (X.resourceRecordSet[*].resourceRecords[*].value intersects $.Y.cname)'; show X;",
  "recommendation": "Identify DNS record entry pointing to a non-existing Elastic Beanstalk (EBS) resource.\n\nTo remove DNS record entry, follow steps given in following URL:\nhttps://docs.aws.amazon.com/Route53/latest/DeveloperGuide/resource-record-sets-deleting.html",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CRI Profile v2.0",
    "HITRUST CSF v.11.2.0"
  ]
}