{
  "policyUpi": "PC-AWS-S3-1080",
  "policyId": "2c986eeb-e17e-4da4-b185-23ff56396286",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "informational",
  "name": "AWS S3 bucket encrypted with Customer Managed Key (CMK) is not enabled for regular rotation",
  "description": "AWS S3 buckets encrypted with Customer Managed Keys (CMKs) lacking regular rotation pose a significant security risk. Failure to rotate these keys extends the potential window of exposure for sensitive data should a compromise occur.\n\nAWS S3 utilizes CMKs to encrypt data at rest. However, if a CMK is compromised, an attacker could decrypt data stored within the bucket for an extended period if key rotation is not enabled. This lack of rotation increases the risk of data breaches and compliance violations.\n\nThe impact of this misconfiguration includes prolonged exposure of sensitive data, potentially leading to data breaches, financial losses, reputational damage, and regulatory penalties. Regular CMK rotation mitigates this risk by limiting the impact of any compromise to a shorter timeframe.\n\nImplement a regular schedule for CMK rotation. Establish a process to automate key rotation and monitor for successful completion. Use strong key management practices, and regularly audit the CMK rotation configuration to ensure its effectiveness.",
  "rule.criteria": "75cfa4ba-f05c-4a03-a571-6ebf8a6b8b32",
  "searchModel.query": "config from cloud.resource where cloud.type = 'aws' AND api.name= 'aws-s3api-get-bucket-acl' AND json.rule = (sseAlgorithm contains \"aws:kms\" or sseAlgorithm contains \"aws:kms:dsse\") and kmsMasterKeyID exists as X; config from cloud.resource where api.name = 'aws-kms-get-key-rotation-status' AND json.rule = keyMetadata.keyState equals Enabled and keyMetadata.keyManager equal ignore case CUSTOMER and keyMetadata.origin equals AWS_KMS and (rotation_status.keyRotationEnabled is false or rotation_status.keyRotationEnabled equals \"null\")as Y; filter '$.X.kmsMasterKeyID contains $.Y.key.keyArn'; show X;",
  "recommendation": "Recommendation:\n\nThe following steps are recommended to enable the automatic rotation of the KMS key used by the S3 bucket\n\n1. Log in to the AWS Console and navigate to the 'S3' service.\n2. Click on the S3 bucket reported in the alert.\n3. Click on the 'Properties' tab.\n4. Under the 'Default encryption' section, click on the KMS key link in 'Encryption key ARN'.\n5. Under the 'Key rotation' tab on the navigated KMS key window, Enable 'Automatically rotate this CMK every year'.\n6. Click on Save.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CSA CCM v4.0.12",
    "DORA",
    "HIPAA",
    "HITRUST CSF v.11.2.0",
    "ISO/IEC 27001:2022",
    "Microsoft Cloud Security Benchmark v1",
    "NIST 800-53 Rev 5",
    "NYDFS 23 CRR-NY 500.0",
    "PCI DSS v4.0.1",
    "SOC 2",
    "TX-RAMP Level 1",
    "Telecommunications Security Act - TSA",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}