{
  "policyUpi": "PC-ALL-ALL-1094",
  "policyId": "613f9585-be6b-43ed-ab2a-e89b7d6c036b",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS EKS K8s service with network path from the internet (0.0.0.0/0)",
  "description": "AWS Elastic Kubernetes Service (EKS) clusters with internet-accessible Kubernetes services (0.0.0.0/0) pose a significant security risk. Exposure to the public internet greatly expands the attack surface, making the cluster vulnerable to unauthorized access and malicious activities.\n\nEKS clusters should have controlled network access. Allowing unrestricted internet access to Kubernetes services exposes them to various attacks, including brute-force attacks targeting exposed services and exploitation of known container image vulnerabilities. Untrusted IPs can easily compromise the cluster, leading to data breaches or complete system takeover.\n\nUnrestricted internet access to EKS services results in significant data loss, service disruptions, and potential financial penalties due to non-compliance. Limiting network access to trusted sources only significantly reduces the attack surface and mitigates the risks associated with public exposure.\n\nImplement network policies to restrict access to only trusted IP addresses and ranges. Regularly review and update these policies. Employ ingress controllers with robust authentication and authorization mechanisms. Consider using a virtual private cloud (VPC) and only allow traffic from authorized networks. Restrict access to the Kubernetes API server to authorized users and services.",
  "rule.criteria": "5da50323-01a4-4f1a-9ccf-733813838e37",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'K8s Service' and dest.cloud.type = 'AWS' and effective.action = 'Allow'",
  "recommendation": "The following steps are recommended to restrict AWS K8s service from having unrestricted access from the Internet:\n1. Visit the Network path Analysis from Source to Destination and review the network path components that allow internet access.\n2. Identify the network component on which restrictive rules can be implemented.\n3. Implement the required changes and make sure no other resources have been impacted due to these changes:\n a) The overly permissive security group rules can be made more restrictive.\n b) Move the container/app service inside a restrictive subnet if it does not need to be publicly accessible.\n c) Control access to service by specifying allowed IP addresses or ranges in the service configuration.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}