{
  "policyUpi": "PC-ALL-ALL-1303",
  "policyId": "8fe3e2e3-5735-4da5-80f8-38375e39073b",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS EKS K8s service with network path from the untrust internet source on ports with high risk",
  "description": "AWS Elastic Kubernetes Service (EKS) clusters exposed to untrusted internet sources via high-risk ports pose a significant security risk. Malicious actors can exploit these open ports to gain unauthorized access, potentially leading to data breaches or service disruptions.\n\nThe EKS service, by design, allows network communication. However, exposing EKS clusters to untrusted internet sources on high-risk ports creates a large attack surface. Attackers can leverage this misconfiguration to launch brute-force attacks, exploit known vulnerabilities, or inject malicious code into containers.\n\nA successful compromise could result in data exfiltration, service disruption, and significant financial losses. Restricting network access to trusted sources minimizes the attack surface, enhancing the overall security posture of the EKS cluster. Implementing proper network segmentation and access control is crucial.\n\nMitigate this risk by implementing strict network policies that limit access to only trusted IP addresses. Utilize network segmentation to isolate the EKS cluster from other sensitive resources. Regularly review and update network security rules to adapt to evolving threat landscapes. Employ robust intrusion detection and prevention systems to monitor and respond to suspicious activity.",
  "rule.criteria": "a88cd3ca-d4a7-4a18-b113-a3ceee6202e2",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'K8s Service' and dest.cloud.type = 'AWS' and protocol.ports in ( 'tcp/20:21', 'tcp/23', 'tcp/25', 'tcp/110', 'tcp/135', 'tcp/143', 'tcp/445', 'tcp/1433:1434', 'tcp/3000', 'tcp/3306', 'tcp/4333', 'tcp/5000', 'tcp/5432', 'tcp/5500', 'tcp/5601', 'tcp/8080', 'tcp/8088', 'tcp/8888', 'tcp/9200', 'tcp/9300' )",
  "recommendation": "The following steps are recommended to restrict AWS K8s service from having unrestricted access from the Internet:\n1. Visit the Network path Analysis from Source to Destination and review the network path components that allow internet access.\n2. Identify the network component on which restrictive rules can be implemented.\n3. Implement the necessary changes and ensure no other resources have been impacted due to these changes:\n a) The overly permissive security group rules can be made more restrictive to Trusted IP lists.\n b) Move the container/application inside a restrictive subnet if public accessibility is not required.\n c) Control access to service by specifying allowed IP addresses or ranges in the service configuration.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}