{
  "policyUpi": "PC-ALL-ALL-1075",
  "policyId": "278e5db6-c6d2-4f73-9734-b1d22a3fd95e",
  "policyType": "network",
  "cloudType": "aws",
  "severity": "informational",
  "name": "AWS EC2 instance with network path from the internet (0.0.0.0/0) on ports 80/443",
  "description": "AWS EC2 instances accessible via the internet on ports 80 and 443 represent a significant security risk. Publicly accessible instances increase the attack surface, making them vulnerable to various exploits.\n\nThese instances, with inbound network paths from 0.0.0.0/0 on ports 80 and 443, expose web servers and applications directly to the internet. This misconfiguration allows untrusted IPs to directly access the EC2 instance, increasing the risk of unauthorized access, data breaches, and attacks like brute-force attempts, SQL injection, or cross-site scripting.\n\nThe impact of this misconfiguration could include data exfiltration, service disruption, or complete system compromise. Restricting access to only trusted IP addresses or specific security groups minimizes the attack surface and improves overall security posture.\n\nMitigate this risk by utilizing security groups to restrict inbound traffic on ports 80 and 443. Only allow access from trusted IP addresses or ranges. Consider using a web application firewall (WAF) for additional protection against common web-based attacks. Regular security assessments and penetration testing are crucial.",
  "rule.criteria": "186c4a23-2f93-4b6f-8844-ba9f0006c115",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'Instance' and dest.cloud.type = 'AWS' and protocol.ports in ( 'tcp/80' , 'tcp/443' )",
  "recommendation": "Restrict Internet exposure of reported EC2 instances based on your business requirements by modifying security group rules to the trusted IP address\n\n1. Sign in to the AWS Console\n2. Navigate to EC2 Dashboard\n3. Identify the reported EC2 instances that you want to restrict public access\n4. Go to the 'Security' tab\n5. For each security group listed under the 'Security group' section\n6. Select 'Edit inbound rules'\n7. Update inbound rules that allow unrestricted access (0.0.0.0/0) such that the CIDR range 0.0.0.0/0 does not exist\n8. Click 'Save rules' to apply the changes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}