{
  "policyUpi": "",
  "policyId": "04a8b74e-e5e3-4534-bc6b-b1bbf26fcc93",
  "policyType": "iam",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS Role With Administrative Permissions Can Be Assumed By All Users",
  "description": "A globally assumable role with administartive permissions could allow an adversary to assume it (regardless of their original role as the target role is globally assumable) and utilize its administrative permissions to further compromise the environment.",
  "rule.criteria": "04a8b74e-e5e3-4534-bc6b-b1bbf26fcc93",
  "searchModel.query": "config from iam where source.public = true AND grantedby.cloud.entity.type='role' and action.access.isAdministrative = true",
  "recommendation": "How to investigate?\n1. In the Prisma Cloud Console, under the \"Alerts\" tab, take note of the \"Asset Name\". Then select the \"Alert ID\", then \"Investigate\"\n2. In the results, you will see the policy granting the administrative permissions to the role (\"Granted By Policy\"), and the specific administrative permissions (\"Destination\")\n3. Sign in to the AWS Console\n4. Navigate to the affected role\n5. Examine the role's trust relationship and permissions as well as its use case\nIn order to remove any administrative permissions and minimize trusted entities which can assume the role, use the following remediation steps:\nBrowse to the role in the AWS Console and select \"Trust relationships\"->\"Edit trust policy\". Modify the role's trust relationship as per requirements. Under the \"Permissions\" tab, select the relevant policy and remove unnecessary administrative permissions by either editing the policy or replacing it (notice: editing a managed policy could affect other roles).",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic aws cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}