{
  "policyUpi": "PC-AWS-ASG-1055",
  "policyId": "8336772f-d32c-4a8f-9c72-0ae7dcb637e9",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "medium",
  "name": "AWS Auto Scaling group launch configuration has public IP address assignment enabled",
  "description": "This policy identifies the autoscaling group launch configuration that is configured to assign a public IP address. Auto Scaling groups assign a public IP address to the group's ec2 instances if its associated launch configuration is configured to assign a public IP address. Amazon EC2 instances should only be accessible from behind a load balancer instead of being directly exposed to the internet. It is recommended that the Amazon EC2 instances in an autoscaling group launch configuration do not have an associated public IP address except for limited edge cases.",
  "rule.criteria": "eb49d241-f20e-4a8b-b1b8-564b7e8e5493",
  "searchModel.query": "config from cloud.resource where api.name = 'aws-ec2-autoscaling-launch-configuration' AND json.rule = associatePublicIpAddress exists and associatePublicIpAddress is true",
  "recommendation": "An Auto Scaling group is associated with one launch configuration at a time. You cannot modify a launch configuration after you have created it. To change the launch configuration for an Auto Scaling group, You need to use an existing launch configuration as the basis for a new launch configuration first. Then, update the Auto Scaling group to use the new launch configuration before you delete the reported Auto Scaling group configuration.\n\nTo update the Auto Scaling group to use the new launch configuration follow the steps below:\n\n1. Open the Amazon EC2 console.\n2. On the left navigation pane, under 'Auto Scaling', choose 'Auto Scaling Groups' and Choose 'Launch configurations' near the top of the page.\n3. Select the reported launch configuration and choose Actions, then click 'Copy launch configuration'. This sets up a new launch configuration with the same options as the original, but with 'Copy' added to the name.\n4. On the 'Create launch configuration' page, expand 'Advanced details' under 'Additional Configuration - optional'.\n5. Under the IP address type, choose 'Do not assign a public IP address to any instances'.\n6. When you have finished, click on the 'Create launch configuration' button at the bottom of the page.\n7. On the navigation pane, under Auto Scaling, choose Auto Scaling Groups.\n8. Select the check box next to the Auto Scaling group.\n9. A split pane opens up at the bottom part of the page, showing information about the group that's selected.\n10. On the Details tab, click on the 'Edit' button adjacent to the 'Launch configuration' option.\n11. Under the 'Launch configuration' dropdown, select the newly created launch configuration.\n12. When you have finished changing your launch configuration, click on the 'Update' button at the bottom of the page.\n\nAfter you change the launch configuration for an Auto Scaling group, any new instances are launched with the new configuration options. Existing instances are not affected. To update existing instances, either terminate them so that they are replaced by your Auto Scaling group or allow automatic scaling to gradually replace older instances with newer instances based on your termination policies.\n\nTo delete the reported Auto Scaling group launch configuration follow the steps below:\n\n1. Open the Amazon EC2 console.\n2. On the left navigation pane, under 'Auto Scaling', choose 'Auto Scaling Groups' and Choose 'Launch configurations' near the top of the page.\n3. Select the reported launch configuration and choose Actions, then click 'Delete launch configuration'.\n4. Click on the 'Delete' button to delete the autoscaling group launch configuration.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "Framework for Adoption of Cloud Services by SEBI Regulated Entities (REs)",
    "HITRUST CSF v.11.2.0",
    "TX-RAMP Level 2"
  ]
}