{
  "policyUpi": "PC-AWS-R53-1036",
  "policyId": "4b9dfe10-c19c-4b9f-a9d4-456cdea8d428",
  "policyType": "config",
  "cloudType": "aws",
  "severity": "high",
  "name": "AWS Route53 Hosted Zone having dangling DNS record with subdomain takeover risk associated with AWS Elastic Beanstalk Instance",
  "description": "Dangling DNS records in AWS Route53 Hosted Zones, pointing to non-existent Elastic Beanstalk instances, create a subdomain takeover risk. Attackers could exploit this misconfiguration to register a similar Elastic Beanstalk instance, gaining control of the subdomain for malicious purposes.\n\nRoute53 manages DNS records for domains. A CNAME record in a Hosted Zone points a subdomain to another domain. If the target Elastic Beanstalk instance is deleted, the CNAME becomes 'dangling', leaving the subdomain vulnerable. An attacker can create a new Elastic Beanstalk instance with the same name in their own account, redirecting traffic to malicious content.\n\nSuccessful exploitation allows attackers to perform phishing, malware distribution, and other harmful activities under the compromised subdomain, damaging reputation and potentially leading to data breaches. Removing dangling CNAME records ensures that only valid resources are accessible via the DNS.\n\nTo mitigate this risk, regularly review Route53 Hosted Zones for CNAME records pointing to deleted Elastic Beanstalk instances. Delete these dangling records promptly. Implement automated checks to identify and alert on such misconfigurations. Consider using a process for decommissioning resources to prevent the creation of dangling records in the first place.",
  "rule.criteria": "5d345501-f43f-48be-90c1-b0d1d4a14a26",
  "searchModel.query": "config from cloud.resource where api.name = 'aws-route53-list-hosted-zones' AND json.rule = hostedZone.config.privateZone is false and resourceRecordSet[?any( type equals CNAME and resourceRecords[*].value contains elasticbeanstalk.com)] exists as X; config from cloud.resource where api.name = 'aws-elasticbeanstalk-environment' as Y; filter 'not (X.resourceRecordSet[*].resourceRecords[*].value intersects $.Y.cname)'; show X;",
  "recommendation": "Identify DNS record entry pointing to a non-existing Elastic Beanstalk (EBS) resource.\n\nTo remove DNS record entry, follow steps given in following URL:\nhttps://docs.aws.amazon.com/Route53/latest/DeveloperGuide/resource-record-sets-deleting.html",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM) (Latest)",
    "Australian Cyber Security Centre (ACSC) Essential Eight - Level 1",
    "Australian Cyber Security Centre (ACSC) Essential Eight - Level 2",
    "Australian Cyber Security Centre (ACSC) Essential Eight - Level 3",
    "CRI Profile v2.0",
    "DORA",
    "HITRUST CSF v.11.2.0",
    "ISO/IEC 27001:2022",
    "ITSG-33",
    "Korea – Information Security Management System (ISMS)",
    "Microsoft Cloud Security Benchmark v1",
    "NCSC Cloud Security Principles",
    "NIST CSF v2.0",
    "PCI DSS v4.0.1",
    "SEBI - Consolidated Cybersecurity and Cyber Resilience Framework (CSCRF)",
    "Secure Controls Framework (SCF) - 2024.2",
    "TX-RAMP Level 2",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}