{
  "policyUpi": "PC-AZR-CMP-1316",
  "policyId": "fa6e9e09-d02e-418a-a573-baed692391ed",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure VM disk configured with overly permissive network access",
  "description": "Azure Virtual Machine disks configured with public network access pose a significant security risk. Publicly accessible disks expose sensitive data to unauthorized access and potential breaches.\n\nAzure Virtual Machine disks are storage resources attached to Virtual Machines. Enabling public network access allows any entity on the internet to access these disks, bypassing security controls. Attackers can exploit this misconfiguration to steal data, deploy malware, or gain unauthorized access to the Virtual Machine itself.\n\nThe impact of this misconfiguration includes data breaches, unauthorized data modification, and potential system compromise. Restricting access to trusted networks only significantly minimizes these risks. This best practice ensures that only authorized users and services can interact with the disks.\n\nTo mitigate this risk, disable public network access for all Azure Virtual Machine disks. Utilize Azure Private Link or other secure network configurations to provide controlled access to necessary resources. Regularly review and audit network configurations to identify and remediate any misconfigurations.",
  "rule.criteria": "6a3ba52c-1a0e-4359-aba5-e417ca280270",
  "searchModel.query": "config from cloud.resource where cloud.type = 'azure' AND api.name = 'azure-disk-list' AND json.rule = publicNetworkAccess equal ignore case Enabled and networkAccessPolicy equal ignore case AllowAll and managedBy contains virtualMachines",
  "recommendation": "1. Log in to the Azure portal\n2. Navigate to 'Disks'\n3. Click on the reported disk\n4. Under 'Settings', go to 'Networking'\n5. Ensure that Network access is NOT set to 'Enable public access from all networks'\n6. Click 'Save'",
  "remediable": true,
  "remediation.cliScriptTemplate": "az disk update --name ${resourceName} --resource-group ${resourceGroup} --public-network-access Disabled --network-access-policy DenyAll",
  "remediation.description": "This CLI command requires 'Microsoft.Compute/disks/write' permission. Successful execution will disable public network access and sets the network access policy to DenyAll for the specified disk, blocking external access. \nNote: As a security best practice, we are disabling public and private access to the disk. However, you can choose between the following options based on your security requirements:\n- Disable public access and enable private access\n- Disable public and private access",
  "remediation.impact": "Disable public network access for Azure Virtual Machine disk",
  "compliance.standard": [
    "Cloud Security Assurance Program (CSAP) - IaaS",
    "Cloud Security Assurance Program (CSAP) - Low",
    "Cloud Security Assurance Program (CSAP) - Low SaaS",
    "Cloud Security Assurance Program (CSAP) - SaaS Simplified",
    "Cloud Security Assurance Program (CSAP) - SaaS Standard",
    "HIPAA",
    "Korea – Information Security Management System (ISMS)",
    "NIST CSF v2.0"
  ]
}