{
  "policyUpi": "PC-ALL-ALL-1013",
  "policyId": "b94e4317-ebe3-4197-a44a-75a72bb4063d",
  "policyType": "network",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure SQL Server (PaaS) with network path from the untrust internet source",
  "description": "Azure SQL Server (PaaS) instances accessible from untrusted internet sources pose a significant security risk. Publicly accessible SQL databases are vulnerable to unauthorized access and data breaches.\n\nAzure SQL Server (PaaS) instances should not be directly accessible from the internet. Allowing untrusted internet access exposes the database to brute-force attacks, SQL injection, and other exploits. Successful attacks could lead to data exfiltration, modification, or deletion, resulting in significant business disruption and regulatory penalties.\n\nThe impact of this misconfiguration includes data breaches, service disruption, and reputational damage. Restricting network access to trusted sources only significantly reduces the attack surface and enhances the database's security posture.\n\nMitigate this risk by configuring network rules to allow access only from explicitly trusted IP addresses or virtual networks. Regularly review and update these rules to reflect current security needs. Implement strong authentication mechanisms, such as multi-factor authentication, to further enhance security.",
  "rule.criteria": "5414cf2f-6c0b-41d5-87d8-96ef9a8170ca",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'PaaS' and dest.cloud.type = 'AZURE' and dest.paas.service.type in ( 'MicrosoftSQLServers' )",
  "recommendation": "Restrict access to Azure SQL Server instance from untrusted internet sources by configuring firewall rules\n1. Sign in to the Azure Portal using your Azure account credentials\n2. Navigate to the Azure SQL Server Dashboard\n3. Identify the reported Azure SQL Server that you want to restrict from untrusted internet sources\n4. Navigate to the 'Networking' section\n6. Under the 'Firewall rules' section, add the IP addresses from Trusted IP Addresses\n7. Click 'Save' to apply the changes",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}