{
  "policyUpi": "PC-AZR-ACR-1355",
  "policyId": "bd5b9e38-6dbb-4a53-995f-999bbad09932",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "informational",
  "name": "Azure Container Registry with local admin account enabled",
  "description": "This policy identifies Azure Container Registries having local admin account enabled.\n\nEnabling the admin account allows access to the registry through username and password, bypassing Microsoft Entra ID authentication. Disabling the local admin account improves security by enforcing exclusive use of Microsoft Entra ID identities, which provide centralized management, enhanced auditing, and better control over permissions. By relying solely on Microsoft Entra ID for authentication, the risk of unauthorized access through local credentials is mitigated, ensuring stronger protection for your container registry.\n\nAs a security best practice, it is recommended to disable local admin account for Azure Container Registries.",
  "rule.criteria": "2749f14f-f975-450e-8e9c-047862c45be6",
  "searchModel.query": "config from cloud.resource where cloud.type = 'azure' and api.name = 'azure-container-registry' AND json.rule = properties.provisioningState equal ignore case Succeeded and properties.adminUserEnabled is true",
  "recommendation": "1. Log in to your Azure portal\n2. Navigate to 'Container registries'\n3. Select the reported Container Registry\n4. Under 'Settings' select 'Access Keys'\n5. Ensure that the 'Admin user' box is unchecked",
  "remediable": true,
  "remediation.cliScriptTemplate": "az acr update --name ${resourceName} --resource-group ${resourceGroup} --admin-enabled false",
  "remediation.description": "This CLI command requires 'Microsoft.ContainerRegistry/registries/write' permission. Successful execution disables the local admin account for the specified Azure Container Registry, ensuring it cannot be accessed using local credentials.",
  "remediation.impact": "Disable local admin account for Azure Container Registry",
  "compliance.standard": ""
}