{
  "policyUpi": "PC-AZR-STO-1071",
  "policyId": "f5c4ddc4-52fc-4c52-9a60-5c40b845a683",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "low",
  "name": "Azure Storage account configured with Shared Key authorization",
  "description": "Azure Storage accounts using Shared Key authorization are vulnerable to unauthorized access. Shared Key authorization, including access via Shared Access Signatures (SAS) tokens, allows access for any entity possessing the key, increasing the risk of data breaches.\n\nFailing to utilize Azure Active Directory (Azure AD) authentication instead of Shared Key exposes the storage account to attacks from malicious actors who obtain the shared key, potentially leading to data exfiltration, modification, or deletion.\n\nMisconfiguration of storage account authorization can result in significant data loss, regulatory fines, and reputational damage. Using Azure AD authentication provides stronger security through identity and access management, minimizing the risk of compromised credentials.\n\nImplement Azure AD authentication for all Azure Storage accounts. Revoke any existing Shared Keys and SAS tokens. Regularly audit access permissions and enforce the principle of least privilege. Consider using Managed Identities for applications accessing storage.",
  "rule.criteria": "64bd7f84-5afb-48b5-adb0-fbe55dcfec08",
  "searchModel.query": "config from cloud.resource where cloud.type = 'azure' and api.name= 'azure-storage-account-list' AND json.rule = properties.provisioningState equal ignore case Succeeded and properties.allowSharedKeyAccess is true",
  "recommendation": "To prevent Shared Key authorization for an Azure Storage account, follow bellow URL:\nhttps://learn.microsoft.com/en-us/azure/storage/common/shared-key-authorization-prevent",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CSA CCM v4.0.12",
    "GDPR",
    "HIPAA",
    "ITSG-33",
    "Insurance Regulatory And Development Authority Of India",
    "Microsoft Cloud Security Benchmark v1",
    "PCI DSS v4.0.1",
    "SOC 2",
    "TX-RAMP Level 1",
    "TX-RAMP Level 2",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}