{
  "policyUpi": "PC-AZR-AML-848",
  "policyId": "76b345ae-d738-4485-8cfc-ed0c265ea016",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure Machine learning workspace configured with overly permissive network access",
  "description": "Azure Machine Learning workspaces with overly permissive network access pose a significant security risk. Publicly accessible workspaces are vulnerable to unauthorized access and data breaches.\n\nMachine Learning workspaces, by default, can be configured to allow inbound traffic from any IP address. This misconfiguration exposes sensitive data and computational resources to malicious actors. Untrusted IPs can exploit this to gain unauthorized access, potentially leading to data exfiltration, service disruption, or complete compromise of the workspace.\n\nThe impact of this misconfiguration includes data breaches, unauthorized model access, and service disruption. Restricting network access to only trusted IP addresses is crucial for maintaining the confidentiality, integrity, and availability of your Machine Learning resources. This ensures only authorized users and systems can interact with the workspace.\n\nTo mitigate this risk, configure your Azure Machine Learning workspace network settings to allow inbound connections only from explicitly defined, trusted IP addresses or ranges. Regularly review and update these allowed IP addresses as needed, and leverage virtual networks and network security groups to further restrict access.",
  "rule.criteria": "73f6928e-f03e-42a7-8bbf-348a0c029f63",
  "searchModel.query": "config from cloud.resource where cloud.type = 'azure' AND api.name = 'azure-machine-learning-workspace' AND json.rule = properties.provisioningState equal ignore case Succeeded and properties.publicNetworkAccess equal ignore case Enabled and (properties.ipAllowlist does not exist or properties.ipAllowlist is empty)",
  "recommendation": "To restrict internet IP ranges on your existing Machine learning workspace, follow the below URL:\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-configure-private-link?view=azureml-api-2&tabs=azure-portal#enable-public-access-only-from-internet-ip-ranges-preview",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM) (Latest)",
    "HIPAA",
    "ISO/IEC 27001:2022",
    "Insurance Regulatory And Development Authority Of India",
    "Korea – Information Security Management System (ISMS)",
    "NCSC - Cyber Essentials",
    "NIST 800-53 Rev 5",
    "NIST CSF v2.0",
    "NIST SP 800-171 Revision 3",
    "SOC 2",
    "Secure Controls Framework (SCF) - 2024.2",
    "TX-RAMP Level 1"
  ]
}