{
  "policyUpi": "PC-ALL-ALL-1093",
  "policyId": "ef7d49a1-82d1-482a-bb89-ce19bab17c57",
  "policyType": "network",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure AKS K8s service with network path from the internet (0.0.0.0/0)",
  "description": "Azure Kubernetes Service (AKS) K8s service accessible via the internet (0.0.0.0/0) pose a significant security risk. Unrestricted access allows attackers to easily compromise the cluster.\n\nAKS clusters, by default, should not be publicly accessible. Exposing the Kubernetes API server and worker nodes to the internet without proper restrictions creates a large attack surface. Attackers can exploit misconfigurations to gain unauthorized access, potentially leading to data breaches, service disruptions, or complete cluster takeover.\n\nThe impact of this misconfiguration includes unauthorized access to sensitive data, application compromise, and potential lateral movement within the cloud environment. Restricting network access to only trusted IP addresses or virtual networks mitigates these risks by significantly reducing the attack surface.\n\nTo remediate this, implement Network Security Groups (NSGs) to limit inbound traffic to the AKS cluster. Only allow necessary traffic from trusted sources, such as your corporate network or specific virtual networks. Consider using private endpoints to further enhance security by isolating the cluster from the public internet.",
  "rule.criteria": "bf5f9732-a239-4610-92e4-c3fa5b57821b",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'K8s Service' and dest.cloud.type = 'AZURE' and effective.action = 'Allow'",
  "recommendation": "The following steps are recommended to restrict AKS K8s service from having unrestricted access from the Internet:\n1. Visit the Network path Analysis from Source to Destination and review the network path components that allow internet access.\n2. Identify the network component on which restrictive rules can be implemented.\n3. Implement the required changes and make sure no other resources have been impacted due to these changes:\n a) The overly permissive network security group rules can be made more restrictive.\n b) Move the container/app service inside a restrictive subnet if it does not need to be publicly accessible.\n c) Remove or disassociate the public IP assigned to the respective K8s service.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}