{
  "policyUpi": "PC-AZR-CMP-1070",
  "policyId": "07ab86da-6972-48f9-abf2-3a8ceb74d524",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "low",
  "name": "Azure Virtual machine configured with public IP and serial console access",
  "description": "Azure Virtual Machines with public IPs and enabled serial console access pose a significant security risk. Serial console access, when combined with a public IP address, allows unauthorized remote access to the Virtual Machine, bypassing typical network security controls.\n\nThe serial console provides a direct connection to the Virtual Machine's serial port, offering a path for attackers to execute arbitrary code and gain elevated privileges. An attacker exploiting this misconfiguration could achieve complete control of the Virtual Machine, potentially leading to data breaches, lateral movement within the network, or denial-of-service attacks.\n\nThe impact of this misconfiguration is substantial, ranging from unauthorized access and data exfiltration to complete system compromise. Restricting serial console access to trusted IPs mitigates this risk significantly. By limiting access, even with a public IP, only authorized personnel can utilize this feature.\n\nTo remediate, disable serial console access for all Virtual Machines that do not require it. For those Virtual Machines that need serial console, restrict access to trusted IP addresses only. Regularly review and audit these configurations to maintain a secure environment and prevent unauthorized access.",
  "rule.criteria": "c1f40894-1e56-4fdf-a4a8-0ee90a9f022e",
  "searchModel.query": "config from cloud.resource where cloud.type = 'azure' and api.name= 'azure-vm-list' AND json.rule = powerState contains \"PowerState/running\" and ['properties.networkProfile'].['networkInterfaces'][*].['publicIpAddressId'] exists and ['properties.diagnosticsProfile'].['bootDiagnostics'].['enabled'] is true",
  "recommendation": "To disable/restrict serial console access on the reported VM instance, follow bellow URL:\nhttps://learn.microsoft.com/en-us/troubleshoot/azure/virtual-machines/serial-console-enable-disable",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CIS Controls v8.1",
    "Cloud Security Assurance Program (CSAP) - IaaS",
    "Cloud Security Assurance Program (CSAP) - Low",
    "Cloud Security Assurance Program (CSAP) - Low SaaS",
    "Cloud Security Assurance Program (CSAP) - SaaS Simplified",
    "Cloud Security Assurance Program (CSAP) - SaaS Standard",
    "GDPR",
    "HIPAA",
    "HITRUST CSF v.11.2.0",
    "ISO/IEC 27001:2022",
    "ITSG-33",
    "Insurance Regulatory And Development Authority Of India",
    "Korea – Information Security Management System (ISMS)",
    "MITRE ATT&CK v15.1 Cloud IaaS for Enterprise",
    "Microsoft Cloud Security Benchmark v1",
    "SOC 2",
    "TX-RAMP Level 1",
    "TX-RAMP Level 2",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}