{
  "policyUpi": "PC-AZR-STO-1079",
  "policyId": "23ba4c25-0df9-410d-b933-cb8db9cbddc6",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "low",
  "name": "Azure Storage account encryption key is not rotated regularly",
  "description": "Azure Storage accounts using encryption keys not rotated regularly pose a significant security risk. Failure to rotate encryption keys leaves data vulnerable for extended periods if a key is compromised.\n\nAzure Storage accounts utilize customer-managed keys or Microsoft-managed keys for encryption. Regular key rotation ensures that even if a key is compromised, only a limited window of data is at risk. Lack of rotation significantly increases the potential for data breaches and unauthorized access, impacting confidentiality and integrity.\n\nA compromised encryption key allows attackers to decrypt and access sensitive data stored within the affected Azure Storage accounts. This breach could lead to data exfiltration, regulatory fines, and reputational damage. Regular rotation mitigates this risk by limiting the impact of a compromised key.\n\nTo remediate this misconfiguration, implement automated key rotation schedules. Establish a defined rotation frequency based on risk assessment (e.g., monthly, quarterly). Use Azure Key Vault to manage and rotate keys securely, leveraging its auditing capabilities for compliance and monitoring.",
  "rule.criteria": "33ab1ead-02fe-4161-9398-784d0454a41b",
  "searchModel.query": "config from cloud.resource where api.name = 'azure-storage-account-list' AND json.rule = properties.encryption.keySource equal ignore case \"Microsoft.Keyvault\" as X; config from cloud.resource where api.name = 'azure-key-vault-list' and json.rule = keys[?any(attributes.exp equals -1 and attributes.enabled contains true)] exists as Y; filter '$.Y.properties.vaultUri contains $.X.properties.encryption.keyvaultproperties.keyvaulturi'; show X;",
  "recommendation": "To configure Stroage account encryption key rotation; refer below URL:\nhttps://learn.microsoft.com/en-us/azure/storage/common/customer-managed-keys-configure-existing-account?tabs=azure-portal#configure-encryption-for-automatic-updating-of-key-versions\n\nNOTE: Azure Storage checks the key vault for a new key version only once daily. When you rotate a key, be sure to wait 24 hours before disabling the older version.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CSA CCM v4.0.12",
    "DORA",
    "HIPAA",
    "HITRUST CSF v.11.2.0",
    "ISO/IEC 27001:2022",
    "MITRE ATT&CK v15.1 Cloud IaaS for Enterprise",
    "Microsoft Cloud Security Benchmark v1",
    "NIST 800-53 Rev 5",
    "NYDFS 23 CRR-NY 500.0",
    "PCI DSS v4.0.1",
    "SOC 2",
    "TX-RAMP Level 1",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}