{
  "policyUpi": "PC-AZR-ACR-1352",
  "policyId": "eb825b91-78b3-4be9-9b3b-1a75b72af7bc",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure Container Registry with anonymous authentication enabled",
  "description": "This policy identifies Azure Container Registries with anonymous authentication enabled, allowing unauthenticated access to the registry.\n\nAllowing anonymous pull or access to container registries poses a significant security risk, exposing them to unauthorized users who may retrieve or manipulate container images. To enhance security, disable anonymous access and require authentication through Azure Active Directory (Azure AD). Additionally, local authentication methods such as admin user, repository-scoped access tokens, and anonymous pull should be turned off to ensure authentication relies solely on Azure AD, providing improved control and accountability.\n\nAs a security best practice, it is recommended to disable anonymous authentication for Azure Container Registries.",
  "rule.criteria": "e2b13b04-34b0-455d-8d50-8e01e5ae7947",
  "searchModel.query": "config from cloud.resource where api.name = 'azure-container-registry' AND json.rule = (skuName contains Standard or skuName contains Premium) and properties.provisioningState equal ignore case Succeeded and properties.anonymousPullEnabled is true",
  "recommendation": "Currently, the Azure UI does not support disabling anonymous authentication for Azure Container Registries. To disable anonymous authentication, refer to the following link:\nhttps://learn.microsoft.com/en-us/azure/container-registry/anonymous-pull-access#disable-anonymous-pull-access",
  "remediable": true,
  "remediation.cliScriptTemplate": "az acr update --name ${resourceName} --resource-group ${resourceGroup} --anonymous-pull-enabled false",
  "remediation.description": "This CLI command requires 'Microsoft.ContainerRegistry/registries/write' permission. Successful execution disables anonymous authentication for an Azure Container Registry, ensuring that only Azure Active Directory identities are used for authentication.",
  "remediation.impact": "Azure Container Registry with anonymous authentication enabled",
  "compliance.standard": ""
}