{
  "policyUpi": "PC-AZR-APP-1039",
  "policyId": "9974704e-9864-4c0f-b6b8-7781bbb91d7c",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "medium",
  "name": "Azure App Service web apps with public network access",
  "description": "Azure App Service web apps with public network access allows unauthorized access, increasing the risk of exploitation. Publicly accessible web apps expose applications to malicious actors without proper controls.\n\nThe App Service's network configuration dictates accessibility. Allowing public network access exposes applications to potential attacks like unauthorized access, data breaches, and denial-of-service attacks. Untrusted IPs can easily access the application.\n\nMisconfiguration of network settings could lead to data exfiltration, application compromise, and reputational damage. Restricting access ensures only authorized entities can interact with the application, minimizing the attack surface and improving security posture.\n\nImplement private endpoints to restrict access to only trusted networks. Regularly review and update network configurations to ensure they align with security best practices. Use network security groups to further filter traffic based on IP addresses or ports.",
  "rule.criteria": "6db58a3a-760a-4cf6-bb3e-b807f6e41bfc",
  "searchModel.query": "config from cloud.resource where cloud.type = 'azure' AND api.name = 'azure-app-service' AND json.rule = 'kind starts with app and properties.state equal ignore case running and properties.publicNetworkAccess exists and properties.publicNetworkAccess equal ignore case Enabled and config.ipSecurityRestrictions[?any(action equals Allow and ipAddress equals Any)] exists'",
  "recommendation": "To restrict App Service network access, follow below URL:\nhttps://learn.microsoft.com/en-us/azure/app-service/app-service-ip-restrictions",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM) (Latest)",
    "HIPAA",
    "HITRUST CSF v.11.2.0",
    "ISO/IEC 27001:2022",
    "ITSG-33",
    "Insurance Regulatory And Development Authority Of India",
    "Korea – Information Security Management System (ISMS)",
    "NIST SP 800-171 Revision 3",
    "NYDFS 23 CRR-NY 500.0",
    "SOC 2",
    "Secure Controls Framework (SCF) - 2024.2",
    "TX-RAMP Level 1",
    "TX-RAMP Level 2",
    "Telecommunications Security Act - TSA",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}