{
  "policyUpi": "PC-ALL-ALL-960",
  "policyId": "98076e12-0a77-404c-b743-f5cbc0fe00f5",
  "policyType": "network",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure Cosmos DB (PaaS) instance with network path from the untrust internet source",
  "description": "This policy identifies Azure Cosmos DB (PaaS) instances with network path from the untrust internet source.\n\nCosmos DB (PaaS) instances with network path from the untrust internet source may enable bad actors to use brute force or exploit a vulnerability on a system to gain unauthorized access. Further database vulnerabilities or weaknesses could potentially be exploited to compromise the integrity, availability, or confidentiality of the data stored.\n\nAs a best practice, it is recommended to allow access from Trusted IP list and limit the access from known hosts, services, or specific entities.\n\nNOTE: Prisma Cloud Trusted IP List allows administrators to specify a list of IP addresses that are considered trusted or safe.",
  "rule.criteria": "edcd4f47-4ec3-4140-9ed0-a2da04eeb848",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'PaaS' and dest.cloud.type = 'AZURE' and dest.paas.service.type in ('MicrosoftDocumentDBDatabaseAccount')",
  "recommendation": "Restrict access to Azure Cosmos DB instances from untrusted internet sources by configuring firewall rules.\n1. Sign in to the Azure Portal using your Azure account credentials\n2. Navigate to the Azure Cosmos DB Dashboard\n3. Identify the reported Azure Cosmos DB instances that you want to restrict public access\n4. Navigate to the 'Networking' section\n5. Under 'Public network access' select 'Selected networks'\n6. Under the 'Firewall' section, add the IP addresses or IP address ranges of the trusted sources in CIDR form in 'IP (Single IPv4 or CIDR range)'\n7. Click 'Save' to apply the changes",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}