{
  "policyUpi": "",
  "policyId": "26710788-50b9-4072-bf3e-3acdb48d6df1",
  "policyType": "iam",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure Users and Machine Identities with Administrative Permissions",
  "description": "This policy identifies Azure AD Users and Managed Identities with Azure RBAC Administrative Permissions.\n\nRisk of Administrative Permissions:\nAzure AD users and managed identities with active Azure RBAC administrative permissions (elevated permissions) pose a significant security risk because:\nUnrestricted Access: These identities hold the \"keys to the kingdom\" within your Azure environment. If compromised, attackers can leverage them to perform any action, including creating, modifying, or deleting critical resources. This could lead to data breaches, service disruptions, or significant financial losses.\nPrivilege Escalation Potential: Some administrative permissions allow for elevating privileges of other identities. This opens the door for attackers to gain access to even more sensitive resources and systems within your Azure environment.\n\nMitigating the Risk:\nPrinciple of Least Privilege: Always adhere to the principle of least privilege when assigning Azure RBAC permissions. Avoid creating users or managed identities with administrative permissions unless absolutely necessary. Grant only the minimum set of permissions required for each to fulfill their specific tasks.\nMulti-Factor Authentication (MFA): Enforce MFA for all Azure AD users with administrative permissions. MFA adds an extra layer of security and makes it significantly harder for attackers to compromise an account, even if they obtain the credentials.\nJust-In-Time (JIT) Access: Consider implementing Azure AD Privileged Access Management (PAM) to enable Just-In-Time (JIT) access for administrative tasks. This approach grants temporary, role-based access for specific periods, minimizing the window of opportunity for attackers if a credential is compromised.\nManaged Identity Access Restrictions: For managed identities, utilize Azure Resource Manager (ARM) templates or Azure policies to restrict access to specific resource groups, subscriptions, or resources. This helps limit the potential damage if a managed identity is compromised.\nRegular Review and Auditing: Regularly review Azure AD user and managed identity access assignments, especially those with administrative permissions. Conduct periodic security audits to identify potential weaknesses in your Azure RBAC configuration.\nMonitor for Suspicious Activity: Utilize Azure Monitor to track activity logs, including actions performed by users and managed identities with administrative permissions. This vigilance can help detect unusual activity related to these entities that might indicate a compromise.",
  "rule.criteria": "26710788-50b9-4072-bf3e-3acdb48d6df1",
  "searchModel.query": "config from iam where source.cloud.type = 'Azure' and action.access.isadministrative = true ",
  "recommendation": "Remediation steps:\n1. Sign in to Azure Management Console\n2. Navigate to Azure Subscriptions blade at https://portal.azure.com/#blade/Microsoft_Azure_Billing/SubscriptionsBlade\n3. Click on the Azure cloud subscription that you want to examine\n4. In the navigation panel, choose Access Control (IAM) and select the Role Assignments tab to access the role bindings available for the selected subscription\n5. Find the assignment between the Azure-managed identity and the role with over-privileged permissions\n6. Remove the assignment\n7. Create a new assignment with a built-in or custom role without risky permissions, if necessary",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic Azure cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}