{
  "policyUpi": "PC-AZR-CMP-1029",
  "policyId": "6c53f32c-eb09-4fa2-be43-be334f2eb808",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "low",
  "name": "Azure SQL on Virtual Machine (Linux) with basic authentication",
  "description": "Azure SQL databases hosted on Linux Virtual Machines using basic authentication are susceptible to brute-force attacks. Attackers can exploit this misconfiguration to gain unauthorized access to sensitive data.\n\nThe service involves SQL Server running on an Azure Virtual Machine using the basic authentication method. This method lacks strong security controls, making it vulnerable to credential stuffing and brute-force attacks. Successful attacks could lead to data breaches, unauthorized database modifications, and complete server compromise.\n\nA successful attack could result in data exfiltration, data modification, or complete control of the database and potentially the Virtual Machine. Implementing strong authentication mechanisms like SSH keys significantly reduces the attack surface by eliminating the possibility of easily guessed or brute-forced credentials.\n\nTo mitigate this risk, enforce SSH key-based authentication for all Azure Virtual Machines hosting SQL Server. Regularly review and update access controls, disabling basic authentication entirely. Implement robust logging and monitoring to detect suspicious login attempts promptly.",
  "rule.criteria": "187eec1a-b273-413d-90e4-91a3cfe3c71d",
  "searchModel.query": "config from cloud.resource where cloud.type = 'azure' AND api.name = 'azure-vm-list' AND json.rule = powerState equal ignore case \"PowerState/running\" and ['properties.storageProfile'].['imageReference'].['publisher'] equal ignore case microsoftsqlserver and (['properties.osProfile'].['linuxConfiguration'] exists and ['properties.osProfile'].['linuxConfiguration'].['disablePasswordAuthentication'] is false)",
  "recommendation": "To configure existing Azure Virtual machine with SSH key authentication, Follow below URL:\nhttps://learn.microsoft.com/en-us/azure/virtual-machines/extensions/vmaccess#update-ssh-key\n\nIf changes are not reflecting you may need to take backup, Create new virtual machine with SSH key based authentication and delete the reported virtual machine.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM) (Latest)",
    "HIPAA",
    "ISO/IEC 27001:2022",
    "ITSG-33",
    "Insurance Regulatory And Development Authority Of India",
    "TX-RAMP Level 1",
    "TX-RAMP Level 2"
  ]
}