{
  "policyUpi": "PC-AZR-ABT-931",
  "policyId": "ea27ffec-c8ba-4dbb-95e4-159b5350c94f",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure Batch Account configured with overly permissive network access",
  "description": "Azure Batch Accounts with unrestricted network access are vulnerable to unauthorized access and compromise. Publicly accessible Batch Accounts allow any entity to connect and potentially execute malicious code or exfiltrate data.\n\nAzure Batch Accounts misconfiguration exposes the account to attacks from untrusted IPs. Malicious actors could exploit this open access to deploy malware, access sensitive data, or perform denial-of-service attacks. Restricting access mitigates these risks significantly.\n\nThe impact of this misconfiguration could include data breaches, unauthorized resource consumption, and service disruptions. Enforcing restricted network access ensures only authorized entities can interact with the Batch Account, enhancing security posture and reducing the attack surface.\n\nImplement network restrictions using either an IP firewall to allow only specific IP addresses or address ranges, or by integrating with a Virtual Network for enhanced security. Regularly review and update these allowed IP addresses and Virtual Network configurations to maintain optimal security.",
  "rule.criteria": "5e1ba43e-121a-4e71-b5e6-d8f8091fe7cd",
  "searchModel.query": "config from cloud.resource where cloud.type = 'azure' AND api.name = 'azure-batch-account' AND json.rule = properties.provisioningState equal ignore case Succeeded and properties.networkProfile.accountAccess.defaultAction equal ignore case Allow and properties.publicNetworkAccess equal ignore case Enabled",
  "recommendation": "To configure private access private endpoint, follow below URL:\nhttps://docs.microsoft.com/en-gb/azure/batch/private-connectivity#azure-portal\n\nTo disable public network, follow below URL:\nhttps://docs.microsoft.com/en-gb/azure/batch/public-network-access#disable-public-network-access\n\nIf Batch account is intended access from public network, restrict it to specific IP ranges. To allow public network access with specific network rules, follow below URL:\nhttps://docs.microsoft.com/en-gb/azure/batch/public-network-access#access-from-selected-public-networks",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM) (Latest)",
    "HIPAA",
    "ISO/IEC 27001:2022",
    "Insurance Regulatory And Development Authority Of India",
    "Korea – Information Security Management System (ISMS)",
    "NCSC - Cyber Essentials",
    "NIST 800-53 Rev 5",
    "NIST CSF v2.0",
    "NIST SP 800-171 Revision 3",
    "SOC 2",
    "Secure Controls Framework (SCF) - 2024.2",
    "TX-RAMP Level 1"
  ]
}