{
  "policyUpi": "PC-AZR-APP-680",
  "policyId": "90dc2872-7c50-4a57-a2af-4fc6fea535c5",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "low",
  "name": "Azure Function App authentication is off",
  "description": "Azure Function Apps with authentication disabled are susceptible to unauthorized access. This allows any actor to execute functions without proper authorization, potentially leading to data breaches or service disruptions.\n\nAzure Function Apps offer authentication settings to control access. Disabling authentication removes this crucial security layer, exposing the application to unauthenticated requests. Untrusted IPs can directly invoke functions, potentially executing malicious code or accessing sensitive data without any restrictions.\n\nThe impact of this misconfiguration is significant. Compromised functions can lead to data exfiltration, unauthorized resource manipulation, or even complete application takeover. Implementing strong authentication mechanisms is crucial for securing Azure Function Apps and mitigating these risks. It prevents unauthorized access and ensures only legitimate users can interact with the application.\n\nTo remediate, enable authentication on all Azure Function Apps. Utilize appropriate authentication methods like Active Directory, Azure Active Directory, or other identity providers. Regularly review and update authentication settings to maintain a robust security posture.",
  "rule.criteria": "b363fa7f-b967-4f99-9194-8ff0730372f6",
  "searchModel.query": "config from cloud.resource where cloud.type = 'azure' AND api.name = 'azure-app-service' AND json.rule = properties.state equal ignore case Running and kind contains functionapp and kind does not contain workflowapp and kind does not equal app and config.siteAuthEnabled is false",
  "recommendation": "1. Log in to the Azure portal\n2. Navigate to Function App\n3. Click on the reported Function App\n4. Under Settings section, Click on 'Authentication'\n5. Click on 'Add identity provider'\n6. Select an identity provider from the dropdown and choose other parameters as per your requirement\n7. Click on 'Add'",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM)",
    "ACSC Information Security Manual (ISM) (Latest)",
    "Australian Cyber Security Centre (ACSC) Essential Eight",
    "Australian Energy Sector Cyber Security Framework (AESCSF)",
    "CIS Controls v7.1",
    "CIS Controls v8",
    "CIS Controls v8.1",
    "CSA CCM v.4.0.6",
    "CSA CCM v4.0.12",
    "FFIEC",
    "HIPAA",
    "ISO 27002:2022",
    "ISO/IEC 27001:2022",
    "ITSG-33",
    "Insurance Regulatory And Development Authority Of India",
    "MLPS 2.0 (Level 2)",
    "NCSC - Cyber Essentials",
    "NCSC Cloud Security Principles",
    "NIST SP 800-171 Revision 3",
    "PCI DSS v4.0",
    "PCI DSS v4.0.1",
    "RBI Baseline Cyber Security and Resilience Requirements",
    "Sarbanes Oxley Act (SOX)",
    "Secure Controls Framework (SCF) - 2022.2.1",
    "Secure Controls Framework (SCF) - 2024.2",
    "TX-RAMP Level 1",
    "TX-RAMP Level 2",
    "Telecommunications Security Act - TSA"
  ]
}