{
  "policyUpi": "PC-AZR-MYQ-763",
  "policyId": "3deec0a7-431f-4b8a-b722-b0a38bf3670e",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "medium",
  "name": "Azure Database for MySQL flexible server public network access setting is enabled",
  "description": "This policy identifies Azure Database for MySQL flexible servers which have public network access setting enabled.\n\nPublicly accessible MySQL servers are vulnerable to external threats with risk of unauthorized access or may remotely exploit any vulnerabilities.\n\nAs a best security practice, it is recommended to configure the MySQL servers with IP-based strict server-level firewall rules or virtual-network rules or private endpoints so that servers are accessible only to restricted entities.",
  "rule.criteria": "c0d988dd-3420-45fa-ac78-201900b93f32",
  "searchModel.query": "config from cloud.resource where cloud.type = 'azure' AND api.name = 'azure-mysql-flexible-server' AND json.rule = properties.state equal ignore case Ready and firewallRules[*] is empty and properties.network.publicNetworkAccess equal ignore case Enabled",
  "recommendation": "To configure IP-based strict server-level firewall rules on your MySQL server, follow below URL:\nhttps://learn.microsoft.com/en-gb/azure/mysql/flexible-server/how-to-manage-firewall-portal\n\nTo configure virtual-network rules on your MySQL server, follow below URL:\nhttps://learn.microsoft.com/en-gb/azure/mysql/flexible-server/how-to-manage-virtual-network-portal\n\nTo configure private endpoints on your MySQL server, follow below URL:\nhttps://learn.microsoft.com/en-gb/azure/mysql/flexible-server/how-to-networking-private-link-portal\n\nNOTE: These settings take effect immediately after they're applied. You might experience connection loss if you don't meet the requirements for each setting.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "HITRUST CSF v.11.2.0",
    "ITSG-33",
    "Insurance Regulatory And Development Authority Of India",
    "NYDFS 23 CRR-NY 500.0",
    "TX-RAMP Level 1",
    "TX-RAMP Level 2"
  ]
}