{
  "policyUpi": "",
  "policyId": "a2475c99-1a9c-4f43-a949-4d9d96003126",
  "policyType": "iam",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure AD Groups, Service Principals and Managed Identities with Administrative Permissions",
  "description": "This policy identifies Azure AD Groups, Service Principals, and Managed Identities with Azure RBAC Administrative Permissions.\n\nRisk of Administrative Permissions:\nAzure AD groups, service principals, and managed identities with active Azure RBAC administrative permissions (elevated permissions) pose a significant security risk because:\nBroad Access Potential: Unlike individual users with specific credentials, groups, service principals, and managed identities can grant administrative access to a wider pool of users or applications, increasing the attack surface. If compromised, attackers can exploit these entities to gain control over a larger number of accounts and resources.\nMisuse by Assigned Users/Applications: Even with proper vetting, there's always a risk that users assigned to an administrative group or service principal might misuse their access unintentionally or through social engineering attacks. Similarly, compromised service principals or misconfigured managed identities could be exploited for malicious purposes.\n\nMitigating the Risk:\nPrinciple of Least Privilege: Always adhere to the principle of least privilege when assigning Azure RBAC permissions. Grant administrative access only to groups, service principals, and managed identities that absolutely require it. Regularly review and adjust permissions to minimize the scope of access.\nMinimize Group and Service Principal Membership: Limit the number of users or applications assigned to groups or service principals with administrative permissions. This reduces the potential impact of a compromise and simplifies access management.\nUse Conditional Access for Users: Implement Azure AD Conditional Access to restrict access for users belonging to administrative groups based on factors like location, device type, or real-time threat intelligence. This adds an extra layer of security beyond standard MFA requirements.\nManaged Identity Access Restrictions: For managed identities, utilize Azure Resource Manager (ARM) templates or Azure policies to restrict access to specific resource groups, subscriptions, or resources. This helps limit the potential damage if a managed identity is compromised.\nService Principal Permissions Review: Regularly review service principal registrations and assigned permissions, especially those with administrative privileges. Ensure service principals have only the minimum set of permissions required for their intended function.\nMonitor for Suspicious Activity: Utilize Azure Monitor to track activity logs, including actions performed by users, service principals, and managed identities with administrative permissions. This vigilance can help detect unusual activity related to these entities that might indicate a compromise.\nRegular Review and Auditing: Regularly review Azure AD group memberships, service principal registrations, and managed identity access assignments, especially those with administrative permissions. Conduct periodic security audits to identify potential weaknesses in your Azure RBAC configuration.",
  "rule.criteria": "a2475c99-1a9c-4f43-a949-4d9d96003126",
  "searchModel.query": "config from iam where source.cloud.type = 'Azure' and grantedby.cloud.entity.type NOT IN ('user')  and action.access.isadministrative = true",
  "recommendation": "Remediation steps:\n  1. Sign in to Azure Management Console\n  2. Navigate to Azure Subscriptions blade at https://portal.azure.com/#blade/Microsoft_Azure_Billing/SubscriptionsBlade\n  3. Click on the Azure cloud subscription that you want to examine\n  4. Navigate to the Roles/Groups\n  5. Find the assignment between the role/group and the resources that shouldn't have broad access.\n  6. Remove the assignment\n",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}