{
  "policyUpi": "PC-ALL-ALL-1012",
  "policyId": "fd704273-8feb-4eae-b15c-6659476313fc",
  "policyType": "network",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure Virtual Machine with network path from the untrust internet source on ports with high risk",
  "description": "This policy identifies Azure Virtual Machines with network path from the untrust internet source on ports with high risk.\n\nAzure Virtual Machines with network path from the untrust internet source on ports with high risk increases the risk of unauthorized access, cyber attacks, and data breaches, as it may provide a larger attack surface for malicious actors. Such instances are especially prone to brute force or vulnerability exploits.\n\nAs a best practice, it is recommended to allow access from Trusted IP list and limit the access from known hosts, services, or specific entities.\n\nNOTE: Prisma Cloud Trusted IP List allows administrators to specify a list of IP addresses that are considered trusted or safe.",
  "rule.criteria": "dfef7682-4d08-41be-bfd0-52dd6fa639fb",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'Instance' and dest.cloud.type = 'Azure' and protocol.ports in ('tcp/20', 'tcp/21','tcp/23','tcp/25', 'tcp/110', 'tcp/135', 'tcp/143', 'tcp/445', 'tcp/1433:1434', 'tcp/3000', 'tcp/3306', 'tcp/4333', 'tcp/5000', 'tcp/5432', 'tcp/5500', 'tcp/5601', 'tcp/8080', 'tcp/8088', 'tcp/8888', 'tcp/9200', 'tcp/9300') and dest.resource.state = 'Active'",
  "recommendation": "Restrict network path from the internet to reported Virtual machines based on your business requirement by modifying Network security group rules to the trusted IP address.\n\nTo modify Network security group rules,\n1. Sign in to Azure Portal\n2. Select 'All services'\n3. Select 'Virtual Machines' under Compute\n4. Identify the Virtual machine that you want to restrict access to Internet\n4. Under 'Settings' click on 'Networking'\n5. In 'Inbound port rules' section, add the IP addresses from Trusted IP Addresses.\nRefer following link for detailed steps to modify Network security group rules,\nhttps://learn.microsoft.com/en-us/azure/virtual-network/manage-network-security-group?tabs=network-security-group-portal#change-a-security-rule\n\nNOTE: When modifying Network security group rules, make sure that you don't lock yourself out of the instances. Always have a rule that allows you to access them for management purposes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}