{
  "policyUpi": "PC-AZR-STO-1086",
  "policyId": "c88ad039-ca17-4371-a7e0-47b9eb33336e",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure Storage Account storing Machine Learning workspace high business impact data is publicly accessible",
  "description": "Publicly accessible Azure Storage Accounts storing high-impact Machine Learning workspace data pose a significant security risk. Unauthorized access could lead to data breaches and compromise sensitive business information.\n\nThese accounts, often used by default for uploading data to the workspace, store crucial artifacts like job logs. A misconfiguration allowing public access exposes this data, enabling attackers to gain unauthorized access to sensitive information and potentially exploit system vulnerabilities. This could result in data exfiltration, intellectual property theft, and reputational damage.\n\nThe impact of this misconfiguration includes data breaches, regulatory fines, and loss of customer trust. Restricting access to only authorized services ensures data confidentiality and integrity, mitigating the risk of unauthorized access and data breaches. This best practice aligns with the principle of least privilege.\n\nTo remediate, configure the Azure Storage Account to restrict access using appropriate network security rules, such as virtual network integration and private endpoints. Implement role-based access control ('RBAC') to grant access only to authorized services and users. Regularly review and audit access controls to ensure they remain effective.",
  "rule.criteria": "14d69eff-7a20-4709-9129-66c774d91dea",
  "searchModel.query": "config from cloud.resource where api.name = 'azure-machine-learning-workspace' AND json.rule = 'properties.provisioningState equal ignore case Succeeded and properties.hbiWorkspace is true and properties.storageAccount exists' as X; config from cloud.resource where api.name = 'azure-storage-account-list' AND json.rule = 'totalPublicContainers > 0 and (properties.allowBlobPublicAccess is true or properties.allowBlobPublicAccess does not exist) and properties.publicNetworkAccess equal ignore case Enabled and networkRuleSet.virtualNetworkRules is empty and (properties.privateEndpointConnections is empty or properties.privateEndpointConnections does not exist)' as Y; filter '$.X.properties.storageAccount contains $.Y.id'; show Y;",
  "recommendation": "To restirct Storage account access, refer the below URL:\nhttps://learn.microsoft.com/en-gb/azure/storage/blobs/anonymous-read-access-configure?tabs=portal",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CIS Controls v8.1",
    "CSA CCM v4.0.12",
    "HIPAA",
    "HITRUST CSF v.11.2.0",
    "ISO/IEC 27001:2022",
    "ITSG-33",
    "Insurance Regulatory And Development Authority Of India",
    "Microsoft Cloud Security Benchmark v1",
    "NIST 800-53 Rev 5",
    "NYDFS 23 CRR-NY 500.0",
    "PCI DSS v4.0.1",
    "SOC 2",
    "Secure Controls Framework (SCF) - 2024.2",
    "TX-RAMP Level 1",
    "TX-RAMP Level 2",
    "Telecommunications Security Act - TSA",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}