{
  "policyUpi": "PC-ALL-ALL-920",
  "policyId": "ee3cc82c-9d89-41e5-8daf-9a79d18c82eb",
  "policyType": "network",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure Virtual Machine with network path from the internet (0.0.0.0/0)",
  "description": "Azure Virtual Machines directly accessible from the internet (0.0.0.0/0) pose a significant security risk.\n\nPublicly accessible Virtual Machines, configured with network paths from the internet, increase the attack surface. Malicious actors can easily exploit this misconfiguration to gain unauthorized access, leading to data breaches, ransomware attacks, or complete system compromise. Untrusted IPs can easily connect and attempt various exploits.\n\nThe impact of this misconfiguration includes data loss, service disruption, and reputational damage. Restricting network access to only trusted sources minimizes the risk of unauthorized access, enhancing security posture and protecting sensitive data.\n\nImplement network security groups (NSGs) to filter inbound and outbound traffic. Allow only necessary ports and IP addresses. Regularly review and update NSG rules to adapt to evolving security needs.",
  "rule.criteria": "1c8f24af-30b3-4bb7-8073-f41bbbb7214d",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'Instance' and dest.cloud.type = 'AZURE' and dest.resource.state = 'Active'",
  "recommendation": "Restrict network path from the internet to reported Virtual machines based on your business requirement by modifying Network security group rules to the trusted IP address.\n\nTo modify Network security group rules,\n1. Sign in to Azure Portal\n2. Select 'All services'\n3. Select 'Virtual Machines' under Compute\n4. Identify the Virtual machine that you want to restrict access to Internet\n4. Under 'Settings' click on 'Networking'\n5. In 'Inbound port rules' section, select the rule that allow Internet access (0.0.0.0/0) to the trusted IP address.  \nRefer following link for detailed steps to modify Network security group rules,\nhttps://learn.microsoft.com/en-us/azure/virtual-network/manage-network-security-group?tabs=network-security-group-portal#change-a-security-rule\n\nNOTE: When modifying Network security group rules, make sure that you don't lock yourself out of the instances. Always have a rule that allows you to access them for management purposes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}