{
  "policyUpi": "PC-ALL-ALL-920",
  "policyId": "ee3cc82c-9d89-41e5-8daf-9a79d18c82eb",
  "policyType": "network",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure VM instance in running state that is internet reachable with unrestricted access (0.0.0.0/0) other than HTTP/HTTPS port",
  "description": "This policy identifies azure VM instances in running state that are internet reachable with unrestricted access (0.0.0.0/0) other than HTTP/HTTPS port. VM instances with unrestricted access to the internet may enable bad actors to use brute force on a system to gain unauthorised access to the entire network. As a best practice, restrict traffic from unknown IP addresses and limit the access to known hosts, services, or specific entities.\n\nNOTE: We are excluding the HTTP-80 and HTTPs-443 web ports as these are Internet-facing ports with legitimate traffic.",
  "rule.criteria": "1c8f24af-30b3-4bb7-8073-f41bbbb7214d",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'Instance' and dest.cloud.type = 'AZURE' and protocol.ports in ( 'tcp/0:79', 'tcp/81:442', 'tcp/444:65535' ) and dest.resource.state = 'Active'",
  "recommendation": "The following steps are recommended to restrict unrestricted access from the Internet:\n1. Visit the Network path Analysis from Source to Destination and review the network path components that allow internet access.\n2. Identify the network component on which restrictive rules can be implemented.\n3. Implement the required changes and make sure no other resources have been impacted due to these changes:\n\ta) The overly permissive Network Security Group rules can be made more restrictive.\n\tb) Move the instance inside a restrictive subnet if the instance does not need to be publicly accessible.\n\tc) Remove or disassociate the public IP assigned to the respective instance.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}