{
  "policyUpi": "PC-AZR-AML-1085",
  "policyId": "7e8b0cd4-8f22-46b5-adfe-9bf22773ba54",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure Machine learning workspace configured with high business impact data have unrestricted network access",
  "description": "Azure Machine Learning workspaces containing high business impact data with unrestricted network access pose a significant data breach risk. Publicly accessible workspaces allow unauthorized access to sensitive data via their public IP address.\n\nThese workspaces, often misconfigured with open network access, are vulnerable to attacks exploiting this lack of restriction. Attackers can easily access sensitive data, leading to data breaches, financial loss, and reputational damage. Untrusted IPs can freely interact with the workspace.\n\nData breaches from this misconfiguration can result in severe financial penalties, regulatory fines, and loss of customer trust. Restricting network access to only authorized IPs protects sensitive data and maintains compliance.\n\nImplement network restrictions by configuring Network Security Groups (NSGs) to allow only trusted IP addresses. Regularly review and update the allowed IP list. Consider using private endpoints to further enhance security by isolating the workspace from the public internet.",
  "rule.criteria": "75afcbd3-1a5b-49df-ba2a-8310f5cb3b85",
  "searchModel.query": "config from cloud.resource where cloud.type = 'azure' AND api.name = 'azure-machine-learning-workspace' AND json.rule = properties.provisioningState equal ignore case Succeeded and properties.publicNetworkAccess equal ignore case Enabled and (properties.ipAllowlist does not exist or properties.ipAllowlist is empty) and properties.hbiWorkspace is true",
  "recommendation": "To restirct internet IP ranges on your existing Machine learning workspace, follow the below URL:\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-configure-private-link?view=azureml-api-2&tabs=azure-portal#enable-public-access-only-from-internet-ip-ranges-preview",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM) (Latest)",
    "Insurance Regulatory And Development Authority Of India",
    "NCSC - Cyber Essentials",
    "Secure Controls Framework (SCF) - 2024.2",
    "TX-RAMP Level 1",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}