{
  "policyUpi": "PC-AZR-DNS-1286",
  "policyId": "4fb392da-719b-4061-b413-722a5eb902d4",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure DNS Zone having dangling DNS Record vulnerable to subdomain takeover associated with Azure Storage account blob",
  "description": "Dangling DNS records in Azure DNS zones associated with deleted Azure Storage account blobs present a subdomain takeover risk. These records point to non-existent resources, creating an opportunity for attackers.\n\nAzure DNS zones manage domain name resolution, while Azure Storage accounts provide cloud storage. A misconfiguration occurs when a DNS record continues to point to a deleted blob within an Azure Storage account. Attackers can register a new blob with the same name, effectively taking control of the subdomain to host malicious content, enabling phishing or data breaches.\n\nThe impact of this misconfiguration is the potential for subdomain takeover, leading to reputational damage, phishing attacks, and data breaches. Maintaining accurate DNS records is crucial for preventing unauthorized access and maintaining the integrity of your online presence. Properly managing DNS records ensures that only authorized resources are accessible via your domain.\n\nTo mitigate this, regularly audit Azure DNS zones for dangling records. Delete or update any DNS records pointing to non-existent Azure Storage account blobs. Implement automated checks and alerts for deleted storage resources to proactively identify and address potential misconfigurations.",
  "rule.criteria": "5370349b-9e06-4455-aaf9-98f0702a54ba",
  "searchModel.query": "config from cloud.resource where api.name = 'azure-dns-recordsets' AND json.rule = type contains CNAME and properties.CNAMERecord.cname contains \"web.core.windows.net\" as X; config from cloud.resource where api.name = 'azure-storage-account-list' AND json.rule = properties.provisioningState equal ignore case Succeeded and properties.primaryEndpoints.web exists as Y; filter 'not ($.Y.properties.primaryEndpoints.web contains $.X.properties.CNAMERecord.cname) '; show X;",
  "recommendation": "1. Log in to the Azure Portal and search for 'DNS zones'\n2. Select 'DNS zones' from the search results\n3. Select the DNS zone associated with the reported DNS record\n4. On the left-hand menu, under 'DNS Management,' select 'Recordsets'\n5. Locate and select the reported DNS record\n6. Update or remove the DNS Record if no longer necessary",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM) (Latest)",
    "Microsoft Cloud Security Benchmark v1",
    "NIST 800-53 Rev 5",
    "PCI DSS v4.0.1"
  ]
}