{
  "policyUpi": "PC-ALL-ALL-922",
  "policyId": "94af1c1a-f5cb-43ce-91b0-69f069c248bf",
  "policyType": "network",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure MySQL (PaaS) instance with network path from the untrust internet source on TCP port 3306",
  "description": "Azure MySQL (PaaS) instances accessible from untrusted internet sources via TCP port 3306 pose a significant security risk. Public exposure of this port allows unauthorized access attempts, potentially leading to data breaches.\n\nThe Azure MySQL service's network configuration allows inbound connections on specific ports. Leaving port 3306 open to the internet without proper access controls creates a direct path for malicious actors to attempt unauthorized access using brute-force attacks or exploiting known vulnerabilities in the database or application. Successful compromise could lead to data exfiltration, modification, or deletion.\n\nA misconfiguration exposing port 3306 publicly impacts data confidentiality, integrity, and availability. Restricting access to only trusted IP addresses minimizes the attack surface, limiting the potential for unauthorized access and mitigating the risk of data breaches. This best practice ensures that only authorized entities can connect to the database.\n\nMitigate this risk by configuring network security groups (NSGs) to allow inbound connections on port 3306 only from explicitly trusted IP addresses or virtual networks. Regularly review and update the allowed IP list to ensure it reflects current security needs. Consider implementing additional security measures such as strong passwords, multi-factor authentication, and database auditing.",
  "rule.criteria": "8514627a-59f7-4961-a156-37e836f0e25d",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'PaaS' and dest.cloud.type = 'AZURE' and dest.paas.service.type in ( 'MicrosoftDBforMySQLFlexibleServers', 'MicrosoftDBforMySQLServers' ) and protocol.ports = 'tcp/3306'",
  "recommendation": "Restrict access to Azure MySQL server instance from untrusted internet sources by configuring firewall rules\n1. Sign in to the Azure Portal using your Azure account credentials\n2. Navigate to the Azure MySQL Server Dashboard\n3. Identify the reported Azure MySQL Server instance that you want to restrict from untrusted internet sources\n4. Navigate to the 'Networking' section\n6. Under the 'Firewall rules' section, add the IP addresses from Trusted IP Addresses\n7. Click 'Save' to apply the changes",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}