{
  "policyUpi": "PC-ALL-ALL-1077",
  "policyId": "2a8a75b5-750c-4f69-aeba-caee1e0fa44d",
  "policyType": "network",
  "cloudType": "azure",
  "severity": "informational",
  "name": "Azure Virtual Machine with network path from the internet (0.0.0.0/0) on ports 80/443",
  "description": "Azure Virtual Machines exposing ports 80 and 443 directly to the internet (0.0.0.0/0) present a significant security risk.\n\nThese Virtual Machines, accessible via ports 80 (HTTP) and 443 (HTTPS) from any IP address, create a large attack surface. Attacker can easily access these ports, leading to unauthorized access, data breaches, and exploitation of web application vulnerabilities. Attacks like SQL injection, cross-site scripting, and DDoS are highly probable.\n\nThe impact of this misconfiguration could be severe, including data exfiltration, service disruption, and reputational damage. Restricting network access to only trusted sources minimizes the attack surface and protects against unauthorized access.\n\nImplement Network Security Groups (NSGs) to restrict inbound traffic on ports 80 and 443 to only trusted IP addresses or virtual networks. Consider using a web application firewall (WAF) to further mitigate web application vulnerabilities. Regularly review and update NSG rules to ensure they align with security best practices.",
  "rule.criteria": "adc43325-d0e7-4297-9e5f-b54186c1d39a",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'Instance' and dest.cloud.type = 'AZURE' and protocol.ports in ( 'tcp/80' , 'tcp/443' )",
  "recommendation": "Restrict network path from the internet to reported Virtual machines based on your business requirement by modifying Network security group rules to the trusted IP address.\n\nTo modify Network security group rules,\n1. Sign in to Azure Portal\n2. Select 'All services'\n3. Select 'Virtual Machines' under Compute\n4. Identify the Virtual machine that you want to restrict access to Internet\n4. Under 'Settings' click on 'Networking'\n5. In 'Inbound port rules' section, select the rule that allow Internet access (0.0.0.0/0) to the trusted IP address.  \nRefer following link for detailed steps to modify Network security group rules,\nhttps://learn.microsoft.com/en-us/azure/virtual-network/manage-network-security-group?tabs=network-security-group-portal#change-a-security-rule\n\nNOTE: When modifying Network security group rules, make sure that you don't lock yourself out of the instances. Always have a rule that allows you to access them for management purposes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}