{
  "policyUpi": "PC-ALL-ALL-924",
  "policyId": "db13bedd-2e2d-4209-b889-3da7b254a2dd",
  "policyType": "network",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure PostgreSQL (PaaS) instance with network path from the untrust internet source on TCP port 5432",
  "description": "Azure PostgreSQL (PaaS) instances accessible via TCP port 5432 from untrusted internet sources pose a significant security risk. Public exposure of this port allows unauthorized access attempts.\n\nThe Azure PostgreSQL service, by default, listens on TCP port 5432. Exposing this port directly to the internet without proper access controls creates a large attack surface. Attackers can leverage this to launch brute-force attacks against the database, potentially compromising sensitive data or causing service disruptions.\n\nA misconfiguration allowing untrusted internet access to this port could lead to data breaches, unauthorized data modification, and denial-of-service attacks. Restricting access to only trusted IP addresses significantly mitigates these risks, ensuring only authorized entities can interact with the database.\n\nMitigate this risk by configuring network security groups (NSGs) or virtual network (VNet) service endpoints to restrict inbound traffic on port 5432 to only trusted IP addresses or virtual networks. Implement strong authentication mechanisms and regularly review and update access controls.",
  "rule.criteria": "5d65da95-985d-449f-961b-535929bfea62",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'PaaS' and dest.cloud.type = 'AZURE' and dest.paas.service.type in ( 'MicrosoftDBforPostgreSQLFlexibleServers', 'MicrosoftDBforPostgreSQLServers' ) and protocol.ports = 'tcp/5432'",
  "recommendation": "Restrict access to Azure PostgreSQL server instance from untrusted internet sources by configuring firewall rules\n1. Sign in to the Azure Portal using your Azure account credentials\n2. Navigate to the Azure PostgreSQL Server Dashboard\n3. Identify the reported Azure PostgreSQL Server instance that you want to restrict from untrusted internet sources\n4. Navigate to the 'Networking' section\n6. Under the 'Firewall rules' section, add the IP addresses from Trusted IP Addresses\n7. Click 'Save' to apply the changes",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}