{
  "policyUpi": "PC-AZR-STO-1082",
  "policyId": "7d738f3d-90c9-4af4-859b-fe11038c77d2",
  "policyType": "config",
  "cloudType": "azure",
  "severity": "medium",
  "name": "Azure Storage account encryption key configured by access policy with privileged operations",
  "description": "Azure Storage accounts with encryption keys configured via access policies granting privileged operations present a significant security risk. Improperly configured access policies allow unauthorized entities to manipulate or delete encrypted data.\n\nAzure Storage account encryption keys are managed through access policies. Granting privileged write or delete access to these policies enables malicious actors to modify or remove encrypted data, bypassing intended security controls. An attacker exploiting this misconfiguration could exfiltrate sensitive data or disrupt operations.\n\nThe impact of this misconfiguration includes data breaches, data loss, and service disruption. Restricting access to encryption keys ensures only authorized entities with necessary permissions can interact with them, minimizing the risk of unauthorized data manipulation or deletion. This is crucial for maintaining data integrity and confidentiality.\n\nTo mitigate this risk, implement the principle of least privilege. Grant only the minimum necessary permissions to access policies associated with storage account encryption keys. Regularly review and audit access policies to identify and remove unnecessary privileges. Employ strong authentication and authorization mechanisms to protect access to these policies.",
  "rule.criteria": "9f317802-9176-47a4-8c78-be40a2086a04",
  "searchModel.query": "config from cloud.resource where api.name = 'azure-storage-account-list' AND json.rule = properties.encryption.keySource equal ignore case \"Microsoft.Keyvault\" as X; config from cloud.resource where api.name = 'azure-key-vault-list' and json.rule = properties.enableRbacAuthorization is false and properties.accessPolicies[*].permissions exists and (properties.accessPolicies[*].permissions.keys[*] intersects ('Decrypt', 'Encrypt', 'Release', 'Purge', 'all') or properties.accessPolicies[*].permissions.secrets[*] intersects ('Purge', 'all') or properties.accessPolicies[*].permissions.certificates[*] intersects ('Purge', 'all'))  as Y; filter '$.Y.properties.vaultUri contains $.X.properties.encryption.keyvaultproperties.keyvaulturi'; show X;",
  "recommendation": "1. Log in to Azure Portal\n2. Navigate to your Storage account and display the Encryption settings\n3. Keep note of the Key vault and Key used\n4. Navigate to the Key Vault resource noted\n5. Select Access policies, select the key noted\n6. Click on Edit and make sure only required permissions are checked instead of Select all and only required operations are selected instead of privileged operations as per business requirement.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "Australian Cyber Security Centre (ACSC) Essential Eight - Level 1",
    "Australian Cyber Security Centre (ACSC) Essential Eight - Level 2",
    "Australian Cyber Security Centre (ACSC) Essential Eight - Level 3",
    "CRI Profile v2.0",
    "CSA CCM v4.0.12",
    "DORA",
    "HIPAA",
    "HITRUST CSF v.11.2.0",
    "ISO/IEC 27001:2022",
    "MITRE ATT&CK v15.1 Cloud IaaS for Enterprise",
    "Microsoft Cloud Security Benchmark v1",
    "NCSC - Cyber Essentials",
    "NIST 800-53 Rev 5",
    "NIST CSF v2.0",
    "NYDFS 23 CRR-NY 500.0",
    "PCI DSS v4.0.1",
    "SEBI - Consolidated Cybersecurity and Cyber Resilience Framework (CSCRF)",
    "SOC 2",
    "TX-RAMP Level 1",
    "Telecommunications Security Act - TSA",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}