{
  "policyUpi": "PC-ALL-ALL-1012",
  "policyId": "fd704273-8feb-4eae-b15c-6659476313fc",
  "policyType": "network",
  "cloudType": "azure",
  "severity": "high",
  "name": "Azure Virtual Machine with network path from the untrust internet source on ports with high risk",
  "description": "Publicly accessible Azure Virtual Machines on high-risk ports pose a significant security risk. This misconfiguration allows unauthorized access from untrusted internet sources, increasing the attack surface.\n\nAzure Virtual Machines should not be directly exposed to the public internet, especially on ports commonly targeted by attackers (e.g., RDP, SSH). Direct exposure allows malicious actors to easily scan for and exploit known vulnerabilities or attempt brute-force attacks to gain unauthorized access. This could lead to data breaches, system compromise, and lateral movement within the environment.\n\nThe impact of this misconfiguration could include data theft, service disruption, and reputational damage. Restricting access to trusted IP addresses only minimizes the attack surface, improving the overall security posture and reducing the likelihood of successful attacks.\n\nImplement network segmentation using virtual networks and subnets. Restrict inbound traffic to Azure Virtual Machines to only trusted IP addresses or specific services through Network Security Groups (NSGs). Regularly review and update the list of trusted IP addresses. Utilize a web application firewall (WAF) to mitigate common web-based attacks.",
  "rule.criteria": "dfef7682-4d08-41be-bfd0-52dd6fa639fb",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'Instance' and dest.cloud.type = 'Azure' and protocol.ports in ('tcp/20', 'tcp/21','tcp/23','tcp/25', 'tcp/110', 'tcp/135', 'tcp/143', 'tcp/445', 'tcp/1433:1434', 'tcp/3000', 'tcp/3306', 'tcp/4333', 'tcp/5000', 'tcp/5432', 'tcp/5500', 'tcp/5601', 'tcp/8080', 'tcp/8088', 'tcp/8888', 'tcp/9200', 'tcp/9300') and dest.resource.state = 'Active'",
  "recommendation": "Restrict network path from the internet to reported Virtual machines based on your business requirement by modifying Network security group rules to the trusted IP address.\n\nTo modify Network security group rules,\n1. Sign in to Azure Portal\n2. Select 'All services'\n3. Select 'Virtual Machines' under Compute\n4. Identify the Virtual machine that you want to restrict access to Internet\n4. Under 'Settings' click on 'Networking'\n5. In 'Inbound port rules' section, add the IP addresses from Trusted IP Addresses.\nRefer following link for detailed steps to modify Network security group rules,\nhttps://learn.microsoft.com/en-us/azure/virtual-network/manage-network-security-group?tabs=network-security-group-portal#change-a-security-rule\n\nNOTE: When modifying Network security group rules, make sure that you don't lock yourself out of the instances. Always have a rule that allows you to access them for management purposes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}