{
  "policyUpi": "",
  "policyId": "a5b92b3b-ca56-4e1c-8fd1-ff9c3dc9449f",
  "policyType": "iam",
  "cloudType": "all",
  "severity": "low",
  "name": "Cloud Service account with Metadata Write Permissions is inactive for 90 days",
  "description": "Identifies cloud service accounts in Azure, AWS and GCP that have not been used in the last 90 days and hold Metadata Write permissions.",
  "rule.criteria": "a5b92b3b-ca56-4e1c-8fd1-ff9c3dc9449f",
  "searchModel.query": "config from iam where grantedby.cloud.entity.type IN ( 'role', 'serviceaccount', 'service principal', 'user assigned', 'system assigned' ) AND grantedby.cloud.entity.lastlogin.days > 90 AND action.access.level = 'Metadata Write' ",
  "recommendation": "How to investigate?\n1. In the Prisma Cloud Console, under the \"Alerts\" tab, select \"Asset Name\" and take note of the \"Name\" and \"Asset Type\", then exit the tab. Select the \"Alert ID\", then \"Investigate\"\n2. In the results, you will see the resource, the service account attached to it (\"Granted By Entity\"), the policy granting unused administrative permissions to the service account (\"Granted By Policy\"), the specific unused permissions (\"Destination\"), and the last recorded event when the permissions were used by the user (\"Last Access\"). Prisma Cloud's event tracking period begins upon onboarding. As such, depending on the onboarding date, further investigation may be required using the cloud provider logs to determine last access\nOnce examining the permissions and the service account, use the following remediation steps:\nLog in to your Cloud instance, and navigate to the affected service account. If the service account is deemed to be necessary, edit the entity's permissions following the principle of least privilege and based on the information collected. If the service account is not required, remove it",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic aws cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}