{
  "policyUpi": "",
  "policyId": "5294bde9-0550-4b6c-a318-914ea90ccaeb",
  "policyType": "iam",
  "cloudType": "all",
  "severity": "medium",
  "name": "Cloud service account with excessive admin privileges",
  "description": "Identifies cloud service accounts in Azure, AWS and GCP which have administrative permissions that have not been used in the last 90 days. As opposed to user accounts, service accounts are predictable. Therefore, if a service account has administrative permissions which it has not used in the past 90 days, we can confidently say it does not require them, and remove the permissions, decreasing the blast radius in case of a compromise of the service account.",
  "rule.criteria": "5294bde9-0550-4b6c-a318-914ea90ccaeb",
  "searchModel.query": "config from iam where grantedby.cloud.entity.type IN ('service principal', 'system assigned', 'user assigned', 'serviceaccount', 'role') AND action.access.isAdministrative = true AND action.lastaccess.days > 90",
  "recommendation": "How to investigate?\n1. In the Prisma Cloud Console, under the \"Alerts\" tab, select \"Asset Name\" and take note of the \"Name\" and \"Asset Type\", then exit the tab. Select the \"Alert ID\", then \"Investigate\"\n2. In the results, you will see the service account attached to the asset (\"Granted By Entity\"), the policy granting unused administrative permissions to the service account (\"Granted By Policy\"), the specific unused permissions (\"Destination\"), and the last recorded event when the permissions were used by the user (\"Last Access\"). Prisma Cloud's event tracking period begins upon onboarding. As such, depending on the onboarding date, further investigation may be required using the cloud provider logs to determine last access\nOnce examining the permissions and determining which permissions are unnecessary and can be removed based on their last usage, in order to remove them, use the following remediation steps:\nLog in to your Cloud instance, and navigate to the affected service account, and edit the entity's permissions following the principle of least privilege and based on the information collected.",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}