{
  "policyUpi": "PC-ALL-ALL-1011",
  "policyId": "e7f7bfbc-0c7f-4a1e-9cb3-270ab5b6c180",
  "policyType": "network",
  "cloudType": "gcp",
  "severity": "high",
  "name": "GCP VM instance with network path from the untrust internet source on ports with high risk",
  "description": "Unrestricted internet access to GCP VM instances on high-risk ports exposes them to unauthorized access and attacks. Malicious actors can exploit these open ports to gain entry, potentially leading to data breaches and system compromises.\n\nFailing to restrict access creates a large attack surface vulnerable to various threats, including brute-force attacks and exploitation of known vulnerabilities significantly easier. Malicious actors can easily scan for and compromise these instances.\n\nA successful compromise could result in data loss, service disruption, and reputational damage. Restricting access to trusted IP addresses minimizes the attack surface and improves overall security posture. Only authorized entities should be permitted access to these high-risk ports.\n\nImplement network segmentation and access controls. Restrict inbound traffic on high-risk ports to only trusted IP addresses, using allow-listing instead of relying on broad, open access. Regularly review and update your trusted IP lists. Employ firewalls and intrusion detection systems to further enhance security.",
  "rule.criteria": "7b564a5a-f441-433f-adbf-8ada84b34c9a",
  "searchModel.query": "config from network where source.network = UNTRUST_INTERNET and dest.resource.type = 'Instance' and dest.cloud.type = 'GCP' and dest.resource.state = 'Active' and protocol.ports in ( 'tcp/20:21', 'tcp/23', 'tcp/25', 'tcp/110', 'tcp/135', 'tcp/143', 'tcp/445', 'tcp/1433:1434', 'tcp/3000', 'tcp/3306', 'tcp/4333', 'tcp/5000', 'tcp/5432', 'tcp/5500', 'tcp/5601', 'tcp/8080', 'tcp/8088', 'tcp/8888', 'tcp/9200', 'tcp/9300' )",
  "recommendation": "Restrict access to GCP VM instance by modifying VPC Firewall rules\n1. Login to the GCP Console\n2. Go to 'VM instance'\n3. Identify the VM instance that you want to restrict Internet access\n4. Update the VPC firewall rules to allow IP addresses from Trusted IP Addresses.\nRefer to the following links for detailed steps to modify VPC firewall rules,\n- To list VPC firewall rules for a network interface of a VM instance\nhttps://cloud.google.com/firewall/docs/using-firewalls#listing-rules-vm\n- To Update VPC firewall rules\nhttps://cloud.google.com/firewall/docs/using-firewalls#updating_firewall_rules\n\nNOTE: When modifying Network security group rules, ensure that you don't lock yourself out of the instances. Always have a rule that allows you to access them for management purposes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}