{
  "policyUpi": "PC-ALL-ALL-1010",
  "policyId": "92cd237f-ccd7-4d60-aeb7-33c95b9f056a",
  "policyType": "network",
  "cloudType": "gcp",
  "severity": "high",
  "name": "GCP VM instance with network path from the internet (0.0.0.0/0)",
  "description": "Publicly accessible GCP VM instances pose a significant security risk. These instances, configured with a network path from the internet (0.0.0.0/0), are directly exposed to the entire internet.\n\nAllowing unrestricted inbound traffic from the internet creates a large attack surface. Malicious actors can easily exploit this misconfiguration to gain unauthorized access, potentially leading to data breaches, ransomware attacks, or complete system compromise.\n\nThe impact of this misconfiguration includes significant data loss, financial losses, reputational damage, and regulatory non-compliance. Restricting network access to only trusted sources minimizes the attack surface, improving the overall security posture of the Virtual Machine instance. This principle of least privilege enhances security and reduces the potential impact of a successful attack.\n\nTo remediate this risk, configure GCP VM instances with appropriate firewall rules. Restrict inbound traffic to only necessary ports and trusted IP addresses. Regularly review and update these rules to reflect changing security needs. Consider using a more restrictive IP address range than 0.0.0.0/0 for legitimate traffic.",
  "rule.criteria": "77bff382-c425-496a-b0de-6e21d8556549",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'Instance' and dest.cloud.type = 'GCP' and dest.resource.state = 'Active'",
  "recommendation": "Restrict access to GCP VM instance by modifying VPC Firewall rules\n1. Login to the GCP Console\n2. Go to 'VM instance'\n3. Identify the VM instance that you want to restrict Internet access\n4. Update the VPC firewall rule that allows Internet access (0.0.0.0/0) to a trusted IP address\nRefer to the following links for detailed steps to modify VPC firewall rules,\n- To list VPC firewall rules for a network interface of a VM instance\nhttps://cloud.google.com/firewall/docs/using-firewalls#listing-rules-vm\n- To Update VPC firewall rules\nhttps://cloud.google.com/firewall/docs/using-firewalls#updating_firewall_rules\n\nNOTE: When modifying Network security group rules, ensure that you don't lock yourself out of the instances. Always have a rule that allows you to access them for management purposes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}