{
  "policyUpi": "",
  "policyId": "1bc93b36-2e15-4d1f-b2b6-23e1a646f4e6",
  "policyType": "iam",
  "cloudType": "gcp",
  "severity": "medium",
  "name": "GCP Cloud Run with administrative permissions",
  "description": "Identifies Cloud Run instances granted administrative permissions, increasing the blast radius in case of a potential comrpomise of the instance.",
  "rule.criteria": "1bc93b36-2e15-4d1f-b2b6-23e1a646f4e6",
  "searchModel.query": "config from iam where dest.cloud.type = 'GCP' AND source.cloud.service.name = 'run' AND action.access.isAdministrative = true",
  "recommendation": "How to investigate?\n1. In the Prisma Cloud Console, under the \"Alerts\" tab, select the \"Asset Name\", the \"View JSON{}\"\n2. Scroll down to the \"data\" field, and under \"spec/template/spec\" make note of the service account listed\n3. Still in the Prisma Cloud Console, select 'Investigate'\n2. Paste the following query into the investigation prompt, replacing the placeholder with the name of the service account you obtained in the previous steps: config from iam where dest.cloud.type = 'GCP' AND grantedby.cloud.entity.name ='<service account name>'\n4. In the results, under \"Granted By Policy\", you will see the policies attached to the service account\nOnce examining the policies and determining which permissions are unnecessary and can be removed based on the Cloud Run instance's intended use, sign in to your GCP account. In order to remove any unnecessary permissions , use the following remediation steps:\nNavigate to the IAM service, and search for the Service account. Select the pencil icon to edit it's permissions, removing the relevant policy for a less privileged one sufficient for the account intended purpose.",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic gcp cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}