{
  "policyUpi": "",
  "policyId": "802b7d39-6aeb-469c-98b2-f3a24b4af8f1",
  "policyType": "iam",
  "cloudType": "gcp",
  "severity": "high",
  "name": "GCP Groups and Service Accounts with IAM Data Read permissions are unused for 90 days",
  "description": "This policy identifies GCP Groups and Service Accounts with Stale IAM Effective Data Read Permissions.\n\nRisk of Unused Data Read Permissions:\nEven seemingly innocuous permissions like \"Data Read\" in GCP IAM can be risky if left unused for extended periods. Unused GCP groups and service accounts with IAM effective Data Read permissions for 90 days present a security concern because:\nInformation Gathering Tool: An attacker with access to these credentials could use them to gather sensitive details about your GCP environment. This information could include data storage locations (Cloud Storage buckets, BigQuery datasets), project structures, or IAM user details. Attackers could exploit this knowledge to identify vulnerabilities or plan more targeted attacks against your data or other resources.\nPotential Stepping Stone: A compromised unused group or service account with Data Read permissions could be a stepping stone for attackers. They might leverage this access to discover and exploit further vulnerabilities within your GCP project, potentially leading to unauthorized access to more sensitive data or systems.\n\nMitigating the Risk:\nRegular Review and Removal: Regularly identify and remove unused GCP groups and service accounts with any level of IAM effective Data Read permissions (Read or Write) on a scheduled basis.\nPrinciple of Least Privilege: Adhere to the principle of least privilege when assigning IAM permissions. Grant only the minimum level of Data Read access required for a group or service account to function effectively. Evaluate if alternative methods, like IAM conditions or service-specific access restrictions, can restrict access to specific data sets or services.\nMonitor for Suspicious Activity: Utilize Stackdriver Logging to track activity logs, including access attempts for GCP groups and service accounts. This vigilance can help detect unusual activity related to unused accounts that might indicate a compromise.",
  "rule.criteria": "802b7d39-6aeb-469c-98b2-f3a24b4af8f1",
  "searchModel.query": "config from iam where source.cloud.type = 'GCP' and grantedby.cloud.entity.type NOT IN ('user') and action.access.level = 'Data Read' and action.lastaccess.days > 90",
  "recommendation": "Remediation steps:\n 1. Log in to the GCP console\n 2. Navigate to the IAM service\n 3. Find the binding between the service account/group and the resources that shouldn't have broad access\n 4. Remove the binding",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}