{
  "policyUpi": "PC-GCP-RM-1119",
  "policyId": "2cd50f6d-7105-4f61-93e9-4e392bbf7076",
  "policyType": "config",
  "cloudType": "gcp",
  "severity": "medium",
  "name": "GCP Cloud Run service is using default service account with editor role",
  "description": "This policy identifies GCP Cloud Run services that are utilizing the default service account with the editor role.\n\nWhen you create a new Cloud Run service, the compute engine default service account is associated with the service by default if any other service account is not configured. The compute engine default service account is automatically created when the Compute Engine API is enabled and is granted the IAM basic Editor role if you have not disabled this behavior explicitly. These permissions can be exploited to get admin access to the GCP project.\n\nTo be compliant with the principle of least privileges and prevent potential privilege escalation, it is recommended that Cloud Run services are not assigned the 'Compute Engine default service account' especially when the editor role is granted to the service account.",
  "rule.criteria": "d16976ed-bd4c-4514-8393-d161c6b7595f",
  "searchModel.query": "config from cloud.resource where api.name = 'gcloud-projects-get-iam-user' AND json.rule = user contains \"compute@developer.gserviceaccount.com\" and roles[*] contains \"roles/editor\" as X; config from cloud.resource where api.name = 'gcloud-cloud-run-services-list' AND json.rule = spec.template.spec.serviceAccountName contains \"compute@developer.gserviceaccount.com\" as Y; filter ' $.X.user equals $.Y.spec.template.spec.serviceAccountName '; show Y; ",
  "recommendation": "It is not possible to change service account of an existing revision of cloud run service. To update the service account used, a new revision can be deployed.\n\nTo deploy a new service with a user-managed service account, please refer to the URLs given below:\nhttps://cloud.google.com/run/docs/securing/service-identity#deploying_a_new_service_with_a_user-managed_service_account",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CIS Controls v8.1",
    "HIPAA",
    "ISO/IEC 27001:2022",
    "SOC 2"
  ]
}