{
  "policyUpi": "PC-GCP-GCE-171",
  "policyId": "c29d7ea0-3913-4635-85bd-c4e68aab0ba1",
  "policyType": "config",
  "cloudType": "gcp",
  "severity": "medium",
  "name": "GCP VM instances with excessive service account permissions",
  "description": "This policy identifies VM instances with service account which have excessive permissions other than viewer/reader access. It is recommended that each instance that needs to call a Google API should run as a service account with the minimum permissions necessary for that instance to do its job. In practice, this means you should configure service accounts for your instances with the following process:\n\t- Create a new service account rather than using the Compute Engine default service account.\n\t- Grant IAM roles to that service account for only the resources that it needs.\n\t- Configure the instance to run as that service account.\n\t- Configure VM instance least permissive service account with only viewer/reader role until it is necessary to have more access.\nAvoid granting more access than necessary and regularly check your service account permissions to make sure they are up-to-date.",
  "rule.criteria": "d373d96e-ca35-418e-ba24-5fcb9d12319d",
  "searchModel.query": "config from cloud.resource where api.name = 'gcloud-compute-instances-list' AND json.rule = name does not start with \"gke-\" and status equals RUNNING as X; config from cloud.resource where api.name = 'gcloud-projects-get-iam-user' as Y; filter '($.X.serviceAccounts[*].email equals $.Y.user) and not($.Y.roles[*] contains projects or $.Y.roles[*] all equal roles/viewer)'; show X;",
  "recommendation": "Note: To change an instance's service account and access scopes, the instance must be temporarily stopped. To stop your instance, read the documentation for Stopping an instance. After changing the service account or access scopes, remember to restart the instance.\n\nTo change service account of the stopped instance:\n1. Login to GCP portal \n2. Go to Compute Engine\n3. Choose VM instances\n4. Click on the reported VM instance for which you want to change the service account\n5. If the instance is not stopped, click the Stop button. Wait for the instance to be stopped\n6. Next, click the Edit button\n7. Scroll down to the Service Account section, From the drop-down menu, select the desired service account\nNote: To fix this alert either you have to associate service account which has only viewer access or if VM has desired service account and access then dismiss the alert for particular VM instance.\n8. Click the Save button",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "ACSC Information Security Manual (ISM)",
    "APRA (CPS 234) Information Security",
    "Australian Cyber Security Centre (ACSC) Essential Eight",
    "Australian Energy Sector Cyber Security Framework (AESCSF)",
    "Brazilian Data Protection Law (LGPD)",
    "CCPA 2018",
    "CIS Controls v7.1",
    "CIS Controls v8",
    "CIS v1.1.0 (GCP)",
    "CIS v1.2.0 (GCP)",
    "CIS v1.3.0 (GCP)",
    "CIS v2.0.0 (GCP) Level 1",
    "CSA CCM v.4.0.1",
    "Cybersecurity Maturity Model Certification (CMMC) v.1.02",
    "Fedramp (Moderate)",
    "HITRUST v.9.4.2",
    "ISO 27001:2013",
    "ISO 27002:2022",
    "ISO/IEC 27002:2013",
    "ISO/IEC 27017:2015",
    "ISO/IEC 27018:2019",
    "MITRE ATT&CK v6.3",
    "MITRE ATT&CK v8.2",
    "NIST 800-53 Rev 5",
    "NIST 800-53 Rev4",
    "NIST CSF",
    "NIST SP 800-171 Revision 2",
    "NIST SP 800-172",
    "New Zealand Information Security Manual (NZISM v3.4)",
    "PCI DSS v3.2.1",
    "PCI DSS v4.0",
    "PIPEDA",
    "Sarbanes Oxley Act (SOX)",
    "Secure Controls Framework (SCF) - 2022.2.1"
  ]
}