{
  "policyUpi": "PC-ALL-ALL-1019",
  "policyId": "2a07903d-9538-42ab-a3cd-80ce68fa9bf7",
  "policyType": "network",
  "cloudType": "gcp",
  "severity": "high",
  "name": "GCP VM instance with network path from the internet (0.0.0.0/0) on Admin ports",
  "description": "GCP VM instances allowing unrestricted internet access (0.0.0.0/0) on ports 22 and 3389 are highly susceptible to unauthorized access.\n\nThese ports, used for SSH and RDP respectively, provide entry points for attackers. Unrestricted internet access on these ports dramatically expands the attack surface, making brute-force attacks and exploitation of known vulnerabilities significantly easier. Malicious actors can easily scan for and compromise these instances.\n\nCompromise could lead to data breaches, unauthorized access to sensitive information, and complete system control, resulting in significant financial and reputational damage. Restricting network access improves security posture by reducing the attack surface and limiting potential points of compromise.\n\nRemediate this risk by limiting access to trusted IP addresses or networks. Use appropriate firewall rules to restrict inbound traffic on ports 22 and 3389 to only known, trusted sources. Implement strong authentication mechanisms such as multi-factor authentication and regularly update the operating system and applications to patch vulnerabilities.",
  "rule.criteria": "829dce41-2c85-4d07-abf5-171a4c529792",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'Instance' and dest.cloud.type = 'GCP' and dest.resource.state = 'Active' and protocol.ports in ( 'tcp/22', 'tcp/3389' )",
  "recommendation": "Restrict access to GCP VM instance by modifying VPC Firewall rules\n1. Login to the GCP Console\n2. Go to 'VM instance'\n3. Identify the VM instance that you want to restrict Internet access\n4. Update the VPC firewall rule that allows Internet access (0.0.0.0/0) on ports 22/3389 to a trusted IP address\nRefer to the following links for detailed steps to modify VPC firewall rules,\n- To list VPC firewall rules for a network interface of a VM instance\nhttps://cloud.google.com/firewall/docs/using-firewalls#listing-rules-vm\n- To Update VPC firewall rules\nhttps://cloud.google.com/firewall/docs/using-firewalls#updating_firewall_rules\n\nNOTE: When modifying Network security group rules, ensure that you don't lock yourself out of the instances. Always have a rule that allows you to access them for management purposes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}