{
  "policyUpi":"PC-GCP-IAM-207",
  "policyId":"b8380ba7-6797-4813-8d8c-885d92f04a1b",
  "policyType":"config",
  "cloudType":"gcp",
  "severity":"medium",
  "name":"GCP User managed service account keys are not rotated for 90 days",
  "description":"This policy identifies user-managed service account keys which are not rotated from last 90 days or more. Rotating Service Account keys will reduce the window of opportunity for an access key that is associated with a compromised or terminated account to be used. Service Account keys should be rotated to ensure that data cannot be accessed with an old key which might have been lost, cracked, or stolen. It is recommended that all user-managed service account keys are regularly rotated.",
  "rule.criteria":"bf2b33b2-af23-45cd-9cc3-6515423883b4",
  "searchModel.query":"config from cloud.resource where cloud.type = 'gcp' AND api.name = 'gcloud-iam-service-accounts-keys-list' AND json.rule = 'name contains iam.gserviceaccount.com and (_DateTime.ageInDays($.validAfterTime) > 90)'",
  "recommendation":"GCP service account keys dates can not be updated. So to fix this alert, delete the old key which is older than 90 or more days and Create a new key for that particular service account.\nTo Delete user managed Service Account Key older than 90 days:\n1. Login to GCP Portal\n2. Go to APIs & Services (Left Panel)\n3. Select Credentials\n4. In Section Service Account Keys, for every reported user managed service account key with creation date is more than or equal to past 90 days, Click Delete Bin Icon to delete that service account key\n\nTo Create New user managed Service Account Key for a Service Account:\n1. Login to GCP Portal\n2. Go to APIs & Services (Left Panel)\n3. Select Credentials\n4. Click Create Credentials and Select Service Account Key\n5. Choose Service account in a drop-down list for which user managed service account key needs to be created\n6. Select desired key type format among JSON or P12\n7. Click on Create button, It will download private key. Keep it safe.\n8. Click Close if prompted\nIt will redirect to the APIs & Services Credentials page. Make a note of New ID displayed in section Service account keys with the new creation date.\n\nNOTE: Rotating service account key might break communication for depending applications. Dependent applications need to configure manually with new key id.",
  "remediable":false,
  "remediation.cliScriptTemplate":"",
  "remediation.description":"",
  "remediation.impact":"",
  "compliance.standard":[
    "CCPA 2018",
    "CIS v1.0.0 (GCP)",
    "CIS v1.1.0 (GCP)",
    "ISO 27001:2013",
    "MITRE ATT&CK [Beta]",
    "NIST 800-53 Rev 5",
    "NIST 800-53 Rev4",
    "PIPEDA"
  ]
}