{
  "policyUpi": "PC-ALL-ALL-1076",
  "policyId": "e8b7c97a-f422-47ce-9b28-a096a3cff423",
  "policyType": "network",
  "cloudType": "gcp",
  "severity": "informational",
  "name": "GCP VM instance with network path from the internet (0.0.0.0/0) on ports 80/443",
  "description": "GCP VM instances accessible from the internet (0.0.0.0/0) on ports 80 and 443 present a significant security risk. These open ports expose the instances to various attacks.\n\nThe misconfiguration allows all range of IPs to access the Virtual Machine via HTTP and HTTPS. This broad access increases the attack surface, making the instances vulnerable to exploits like SQL injection, cross-site scripting, and denial-of-service attacks. Malicious actors can easily scan for and compromise these exposed services.\n\nThe impact of this misconfiguration could include unauthorized access to sensitive data, system compromise, and potential data breaches. Restricting access to only trusted IP addresses minimizes the attack surface and enhances security posture.\n\nTo remediate this risk, restrict inbound traffic on ports 80 and 443 to only known and trusted IP addresses or ranges. Implement a web application firewall (WAF) to further protect against common web application attacks. Regular security assessments and penetration testing are also recommended.",
  "rule.criteria": "4d4bfc55-1b36-40a7-813f-cde5671fd641",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'Instance' and dest.cloud.type = 'GCP' and protocol.ports in ( 'tcp/80' , 'tcp/443' )",
  "recommendation": "Restrict access to GCP VM instance by modifying VPC Firewall rules\n1. Login to the GCP Console\n2. Go to 'VM instance'\n3. Identify the VM instance that you want to restrict Internet access\n4. Update the VPC firewall rule that allows Internet access (0.0.0.0/0) on ports 80/443 to a trusted IP address\nRefer to the following links for detailed steps to modify VPC firewall rules,\n- To list VPC firewall rules for a network interface of a VM instance\nhttps://cloud.google.com/firewall/docs/using-firewalls#listing-rules-vm\n- To Update VPC firewall rules\nhttps://cloud.google.com/firewall/docs/using-firewalls#updating_firewall_rules\n\nNOTE: When modifying Network security group rules, ensure that you don't lock yourself out of the instances. Always have a rule that allows you to access them for management purposes.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}