{
  "policyUpi": "",
  "policyId": "403f0e7f-7afb-4465-9687-50a4e817a0dd",
  "policyType": "iam",
  "cloudType": "gcp",
  "severity": "high",
  "name": "GCP Groups and Service Accounts with IAM Data Write permissions are unused for 90 days",
  "description": "This policy identifies GCP Groups and Service Accounts with Stale IAM Effective Data Write Permissions.\n\nRisk of Unused Data Write Permissions:\nUnused GCP groups and service accounts with IAM effective Data Write permissions for 90 days pose a significant security threat because:\nUnsecured Access Point: These accounts act like forgotten open doors with high-level access. If compromised, attackers can directly modify or delete sensitive data stored in Cloud Storage buckets, BigQuery datasets, or other GCP services. This could lead to severe disruption, data breaches, or financial losses.\nElevated Attack Potential: Data Write permissions grant attackers the ability to manipulate core information. They could tamper with databases, alter financial records, or corrupt other critical data, leading to significant consequences.\n\nMitigating the Risk:\nRegular Review and Removal: Proactively identify and remove unused GCP groups and service accounts with any level of IAM effective Data Write permissions (Read or Write) on a regular basis.\nPrinciple of Least Privilege: Always adhere to the principle of least privilege when assigning IAM permissions. Grant only the minimum level of Data Write access required for a group or service account to function effectively. Evaluate if alternative methods, like IAM conditions or granular service-specific permissions, can restrict access to specific data sets or services.\nMonitor for Data Anomalies: Implement Cloud Monitoring and Cloud Logging to track data access attempts and changes within your GCP services. This vigilance can help detect unusual activity related to unused accounts that might indicate a compromise and data tampering.",
  "rule.criteria": "403f0e7f-7afb-4465-9687-50a4e817a0dd",
  "searchModel.query": "config from iam where source.cloud.type = 'GCP' and grantedby.cloud.entity.type NOT IN ('user') and action.access.level = 'Data Write' and action.lastaccess.days > 90",
  "recommendation": "Remediation steps:\n 1. Log in to the GCP console\n 2. Navigate to the IAM service\n 3. Find the binding between the service account/group and the resources that shouldn't have broad access\n 4. Remove the binding",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}