{
  "policyUpi": "PC-GCP-GW-918",
  "policyId": "7da8875d-2351-4e92-8332-77b2d221eb10",
  "policyType": "config",
  "cloudType": "gcp",
  "severity": "high",
  "name": "GCP Google Workspace Super Admin not enrolled with 2-step verification",
  "description": "Super Admin accounts in Google Workspace lacking 2-step verification (2SV) pose a significant security risk. These accounts possess extensive privileges, allowing unauthorized access to critical data and settings if compromised.\n\nThe Google Workspace Super Admin role grants complete control over the Admin console and API. Without 2SV, a stolen password grants immediate and total access to the organization's data, potentially leading to data breaches, account hijacking, and service disruptions. Compromise of these accounts enables attackers to modify configurations, delete data, and deploy malware.\n\nA successful attack on an unprotected Super Admin account could result in catastrophic data loss, financial damage, and reputational harm. Enforcing 2SV for Super Admins is crucial to mitigate this risk; it adds an extra layer of authentication, limiting unauthorized access even if credentials are compromised.\n\nImplement mandatory 2SV for all Google Workspace Super Admin accounts. Regularly audit account security settings to ensure compliance. Consider using strong password policies and other multi-factor authentication (MFA) methods alongside 2SV for enhanced protection.",
  "rule.criteria": "9e009f43-1337-41b3-8cae-82de8c095c54",
  "searchModel.query": "config from cloud.resource where api.name = 'gcloud-domain-users' AND json.rule = isAdmin is true and isEnrolledIn2Sv is false and archived is false and suspended is false",
  "recommendation": "Workspace users should be allowed to turn on 2-Step verification (2SV) before enabling 2SV. Follow the steps mentioned below to allow users to turn on 2SV.\n1. Sign in to Workspace Admin Console with an administrator account. \n2. Go to Menu then 'Security' > 'Authentication' > '2-step verification'.\n3. Check the 'Allow users to turn on 2-Step Verification' box.\n4. Select 'Enforcement' as per need.\n5. Click Save.\n\nFor more details, please refer to below URL:\nhttps://support.google.com/a/answer/9176657\n\n\nTo enable 2-Step Verification for GCP Workspace User accounts, follow the steps below.\n1. Open your Google Account.\n2. In the navigation panel, select 'Security'.\n3. Under 'How you sign in to Google', select '2-Step Verification' > 'Get started'.\n4. Follow the on-screen steps.\n\nFor more details, please refer to below URL:\nhttps://support.google.com/accounts/answer/185839",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "CSA CCM v4.0.12",
    "ITSG-33",
    "Insurance Regulatory And Development Authority Of India",
    "Microsoft Cloud Security Benchmark v1",
    "NIST 800-53 Rev 5",
    "PCI DSS v4.0.1",
    "TX-RAMP Level 2",
    "Trusted Information Security Assessment Exchange (TISAX)"
  ]
}