{
  "policyUpi": "PC-GCP-SMS-1340",
  "policyId": "0c1d76cb-3d21-4e59-9cb4-39b3e796ed13",
  "policyType": "config",
  "cloudType": "gcp",
  "severity": "low",
  "name": "GCP Secrets Manager secret not encrypted with CMEK",
  "description": "This policy identifies GCP Secret Manager secrets that are not encrypted with a Customer-Managed Encryption Key (CMEK).\n\nGCP Secret Manager securely stores and manages access to API keys, passwords, certificates, and other sensitive information. Using CMEK for secrets gives you complete control over the encryption keys protecting your sensitive data, ensuring that only authorized users with access to these keys can decrypt and access the information. Without CMEK, data is encrypted with Google-managed keys, which may not provide the level of control required for handling sensitive data in regulated industries.\n\nIt is recommended to encrypt Secret Manager secrets with a Customer-Managed Encryption Key (CMEK) for enhanced data control and compliance.",
  "rule.criteria": "1eab1a60-d5ad-47b6-ad57-48cb00710ad2",
  "searchModel.query": "config from cloud.resource where cloud.type = 'gcp' AND api.name = 'gcloud-secretsmanager-secret' AND json.rule = replication.userManaged.replicas[*].customerManagedEncryption.kmsKeyName does not exist and replication.automatic.customerManagedEncryption.kmsKeyName does not exist",
  "recommendation": "1. Sign in to the Google Cloud Management Console. Navigate to the 'Secrets Manager' page\n2. Under 'Secrets', click on the reported secret\n3. Select 'EDIT SECRET' on the top navigation bar\n4. Under the 'Edit secret' page, under 'Encryption', select the 'Customer-managed encryption key (CMEK)' radio button and Select a CMEK key for each location\n5. Click on 'UPDATE SECRET'.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": [
    "Cloud Security Assurance Program (CSAP) - IaaS",
    "Cloud Security Assurance Program (CSAP) - Low",
    "Cloud Security Assurance Program (CSAP) - Low SaaS",
    "Cloud Security Assurance Program (CSAP) - SaaS Simplified"
  ]
}