{
  "policyUpi": "",
  "policyId": "4c22366d-b282-4e7b-8481-5be75baa3dad",
  "policyType": "iam",
  "cloudType": "gcp",
  "severity": "high",
  "name": "GCP Groups and Service Accounts with IAM Metadata Write permissions are unused for 90 days",
  "description": "This policy identifies GCP Groups and Service Accounts with Stale IAM Effective Metadata Write Permissions.\n\nRisk of Unused Metadata Write Permissions:\nUnused GCP groups and service accounts with IAM effective Metadata Write permissions for 90 days pose a significant security threat because:\nUnsecured Backdoor: These accounts act like forgotten backdoors with high-level access. If compromised, attackers can exploit them to directly modify or delete critical virtual machine (VM) configurations. This could potentially lead to complete VM compromise, unauthorized access to other resources, or disruption of critical services.\nInformation Gathering Tool: An attacker with access to these credentials could leverage them to gather sensitive details about your GCP environment. This information could include VM names, project IDs, or network configurations. Attackers could exploit this knowledge to identify further vulnerabilities or plan more targeted attacks.\n\nMitigating the Risk:\nRegular Review and Removal: Proactively identify and remove unused GCP groups and service accounts with any level of IAM effective Metadata access (Read or Write) on a regular basis.\nPrinciple of Least Privilege: Always adhere to the principle of least privilege when assigning IAM permissions. Grant only the minimum level of Metadata Write access required for a group or service account to function effectively. Evaluate if alternative methods, like service account keys or IAM conditions, can restrict access to specific VMs or projects.\nMonitor for Unusual Activity: Utilize Stackdriver Logging to track activity logs, including access attempts for GCP groups and service accounts. This vigilance can help detect unusual activity related to unused accounts that might indicate a compromise.",
  "rule.criteria": "4c22366d-b282-4e7b-8481-5be75baa3dad",
  "searchModel.query": "config from iam where source.cloud.type = 'GCP' and grantedby.cloud.entity.type NOT IN ('user') and action.access.level = 'Metadata Write' and action.lastaccess.days > 90",
  "recommendation": "Remediation steps:\n 1. Log in to the GCP console\n 2. Navigate to the IAM service\n 3. Find the binding between the service account/group and the resources that shouldn't have broad access\n 4. Remove the binding",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}