{
  "policyUpi": "",
  "policyId": "4a40b54f-e931-4ff9-ab7f-3bd2ab61776e",
  "policyType": "iam",
  "cloudType": "gcp",
  "severity": "high",
  "name": "GCP Users and Machine Identities with Administrative Permissions",
  "description": "This policy identifies GCP Users and Service Accounts with IAM Administrative Permissions.\n\nRisk of Administrative Permissions:\nGCP Users and Service Accounts with active IAM administrative permissions (elevated permissions) pose a significant security risk because:\nUnfettered Access: These identities hold the \"master keys\" within your GCP environment. If compromised, attackers can leverage them to perform any action, including creating, modifying, or deleting critical resources. This could lead to data breaches, service disruptions, or substantial financial losses.\nPrivilege Escalation Potential: Some administrative permissions allow for elevating privileges of other identities. This opens the door for attackers to gain access to even more sensitive resources and systems within your GCP project.\n\nMitigating the Risk:\nPrinciple of Least Privilege: Always adhere to the principle of least privilege when assigning IAM permissions. Avoid creating users or service accounts with administrative permissions unless absolutely necessary. Grant only the minimum set of permissions required for each to fulfill their specific tasks.\nMulti-Factor Authentication (MFA): Enforce MFA for all GCP Users with administrative permissions. MFA adds an extra layer of security and makes it significantly harder for attackers to compromise an account, even if they obtain the credentials.\nService Account Keys: For service accounts, manage and rotate service account keys securely. Avoid storing keys in long-lived locations or embedding them directly in code. Consider using short-lived credentials or Google Cloud Key Management Service (KMS) for access control.\nRestrict User Login: For increased security, consider restricting user login to specific IP addresses or regions using Security Command Center (SCC) or IAM conditions. This can help mitigate the risk of unauthorized access attempts.\nGCP IAM Recommender: Utilize GCP IAM Recommender to identify and flag underused or overly permissive IAM policies associated with users and service accounts. This proactive approach helps ensure appropriate access control.\nMonitor for Suspicious Activity: Utilize Stackdriver Logging to track activity logs, including actions performed by users and service accounts with administrative permissions. This vigilance can help detect unusual activity related to these entities that might indicate a compromise.\nRegular Review and Auditing: Regularly review GCP user access controls and service account permissions, especially those with administrative privileges. Conduct periodic security audits to identify potential weaknesses in your IAM configuration.",
  "rule.criteria": "4a40b54f-e931-4ff9-ab7f-3bd2ab61776e",
  "searchModel.query": "config from iam where source.cloud.type = 'GCP' and action.access.isadministrative = true ",
  "recommendation": "Remediation steps:\n1. Log in to the GCP console\n2. Navigate to the IAM service\n3. Find the binding between the service account or the user and the role with over-privileged permissions\n4. Remove the binding\n5. Create a new binding with a predefined or custom role without risky permissions, if necessary.",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic gcp cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}