{
  "policyUpi": "PC-ALL-ALL-1302",
  "policyId": "eaa68a6c-3fc2-4db7-ab21-aaae613f8b28",
  "policyType": "network",
  "cloudType": "gcp",
  "severity": "high",
  "name": "GCP GKE K8s service with network path from the internet (0.0.0.0/0) on ports 80/443",
  "description": "GCP GKE Kubernetes services with internet-accessible ports 80 and 443 represent a significant security risk. Publicly exposed Kubernetes services increase the attack surface, making them vulnerable to various attacks.\n\nGKE Kubernetes services, using HTTP and HTTPS protocols, are susceptible to numerous threats, including brute-force attacks, exploits targeting known vulnerabilities, and injection attacks like XSS, SQL injection, and CSRF. Untrusted IP addresses accessing these ports can easily compromise the service and potentially the entire cluster.\n\nA misconfiguration allowing unrestricted internet access to ports 80 and 443 can lead to unauthorized access, data breaches, and service disruptions. Restricting access to trusted sources significantly reduces this risk by limiting the potential entry points for malicious actors.\n\nImplement network policies within your GKE cluster to restrict ingress traffic to only trusted IP addresses or ranges. Use a web application firewall (WAF) to further protect against common web attacks. Regularly review and update your network configuration to ensure only necessary ports and IP addresses are exposed.",
  "rule.criteria": "c7838fab-5f3c-46a6-b160-663577a0c5cf",
  "searchModel.query": "config from network where source.network = '0.0.0.0/0' and address.match.criteria = 'full_match' and dest.resource.type = 'K8s Service' and dest.cloud.type = 'GCP' and protocol.ports in ( 'tcp/80' , 'tcp/443' )",
  "recommendation": "The following steps are recommended to restrict GKE K8s service from having unrestricted access from the Internet:\n1. Visit the Network path Analysis from Source to Destination and review the network path components that allow internet access.\n2. Identify the network component on which restrictive rules can be implemented.\n3. Implement the necessary changes and ensure no other resources have been impacted due to these changes:\na) The overly permissive firewall rules can be made more restrictive.\nb) Move the container/application inside a restrictive subnet if public accessibility is not required.\nc) Remove or disassociate the public IP assigned to the respective container.",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}