{
  "policyUpi": "",
  "policyId": "74f8409f-f008-4a83-bd7f-05151e3d1463",
  "policyType": "iam",
  "cloudType": "gcp",
  "severity": "high",
  "name": "GCP Groups and Service Accounts with Administrative Permissions",
  "description": "This policy identifies GCP Groups and Service Accounts with IAM Administrative Permissions.\n\nRisk of Administrative Permissions:\nGCP Groups and Service Accounts with active IAM administrative permissions (elevated permissions) pose a significant security risk because:\nBroad Access Potential: Unlike individual users with specific credentials, groups can grant administrative access to a wider pool of users, increasing the attack surface. If compromised, attackers can exploit a group to gain control over a larger number of accounts and resources within your GCP project.\nMisuse by Assigned Users: Even with proper vetting, there's always a risk that users assigned to an administrative group might misuse their access unintentionally or through social engineering attacks.\n\nMitigating the Risk:\nPrinciple of Least Privilege: Always adhere to the principle of least privilege when assigning IAM permissions. Avoid creating groups with administrative permissions unless absolutely necessary. Grant only the minimum set of permissions required for group members to fulfill their specific tasks.\nMinimize Group Membership: Limit the number of users assigned to groups with administrative permissions. This reduces the potential impact of a compromise and simplifies access management.\nUse Service Accounts for Automation: For automated tasks requiring administrative access, consider using service accounts with appropriate permissions instead of granting administrative access to groups. Service accounts offer better control and auditability.\nGCP IAM Recommender: Utilize GCP IAM Recommender to identify and flag underused or overly permissive IAM policies associated with groups and service accounts. This proactive approach helps ensure appropriate access control.\nMonitor for Suspicious Activity: Utilize Stackdriver Logging to track activity logs, including actions performed by users belonging to administrative groups and service accounts with administrative permissions. This vigilance can help detect unusual activity related to these entities that might indicate a compromise.\nRegular Review and Auditing: Regularly review GCP group memberships and service account permissions, especially those with administrative privileges. Conduct periodic security audits to identify potential weaknesses in your IAM configuration.",
  "rule.criteria": "74f8409f-f008-4a83-bd7f-05151e3d1463",
  "searchModel.query": "config from iam where source.cloud.type = 'GCP' and grantedby.cloud.entity.type NOT IN ('user') and action.access.isadministrative = true",
  "recommendation": "Remediation steps:\n 1. Log in to the GCP console\n 2. Navigate to the IAM service\n 3. Find the binding between the service account/group and the resources that shouldn't have broad access\n 4. Remove the binding",
  "remediable": false,
  "remediation.cliScriptTemplate": "",
  "remediation.description": "",
  "remediation.impact": "",
  "compliance.standard": ""
}