{
  "policyUpi": "",
  "policyId": "d8081638-47d9-4846-88a9-e63157161914",
  "policyType": "iam",
  "cloudType": "aws",
  "severity": "high",
  "name": "Roles with high privileges can be assumed by a service in an external account",
  "description": "Identifies roles which have administrative permissions and can be assumed by an identity in an \"external account\". An external account is one not known to Prisma cloud as part of your organization and not that of a known vendor. This policy relies on the default account group, therefore if the group is changed this policy will not reflect the environment entirely. The default account group is created upon onboarding to Prisma Cloud, and contains all instance-related accounts known to Prisma Cloud. External accounts are considered as such if Prisma are unaware of them in the context of your environment (i.e not part of the onboarded accounts). As we do not have visibility or control over the external entity, giving it the ability to gain administartive permissions in the environment is considered high risk.",
  "rule.criteria": "d8081638-47d9-4846-88a9-e63157161914",
  "searchModel.query": "config from iam where dest.cloud.type = 'AWS' AND grantedby.cloud.entity.type = 'role' AND action.access.isAdministrative = true AND source.cloud.accountgroup != 'Default Account Group' AND source.cloud.account.isvendor = false",
  "recommendation": "How to investigate?\n1. In the Prisma Cloud Console, select 'Investigate'\n2. Paste the following query into the investigation prompt, replacing the placeholder with the account ID you wish to verify: config from iam where dest.cloud.type = 'AWS' AND source.cloud.account='<account-id>' and dest.cloud.account='<account-id>'\n3a. If results are returned, this is an indicator that Prisma is scanning the account, and as such is aware of it\n If this is the case, select 'settings' and then 'Account Groups'\n Search for the default account group, under 'Actions' select 'Edit'. Search for the account in question and add it\n3b. If no results are returned, this means Prisma has no knowledge of the account in question (i.e it is not onboarded and in the eyes of Prisma, external)\n In order to continue the investigation, using the AWS CLI, run 'aws organizations list-accounts', and you will recieve a list of all the accounts within the AWS organization\n Repeat this process for every AWS organization you own. If the account in question does not appear, it can be concluded as external\n In order to remove its access, use the following remediation steps:\n Log in to your AWS account\n Navigate to the affected role, and select the 'Trusted entities' tab.\n Select 'Edit trust policy' and remove the entries allowing assumption from external sources.\n Ensure the remaining entries are required, and save your changes.",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic aws cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}