{
  "policyUpi": "",
  "policyId": "8f4bef95-c86b-4d09-bd8b-c6bce1a88c43",
  "policyType": "iam",
  "cloudType": "aws",
  "severity": "high",
  "name": "Third-party service account can assume a service account with high privileges",
  "description": "This policy identifies instances where third-party vendors are granted the ability to assume or impersonate roles with high privileges and may allow significant administrative access to your cloud environment. Such permissions can potentially lead to unauthorized access or escalation of privileges, compromising the security posture of your organization.",
  "rule.criteria": "8f4bef95-c86b-4d09-bd8b-c6bce1a88c43",
  "searchModel.query": "config from iam where grantedby.cloud.entity.type IN ( 'role', 'serviceaccount' ) AND action.access.isadministrative = true AND source.cloud.account.isvendor = true ",
  "recommendation": "How to investigate?\n1. Sign in to the AWS Console\n2. Navigate to the affected role\n3. Examine the role's trust relationship and permissions as well as its use case - if needed reach out to the vendor to validate which permissions are necessary for their functions and why\nIn order to remove any unnecessary permissions and minimize trusted entities which can assume the role, use the following remediation steps:\nTo revoke the vendor's access to assume the role altogether, browse to the role in the AWS Console and select \"Trust relationships\"->\"Edit trust policy\". Modify the role's trust relationship as per requirements. To minimize the access the vendor has using the role, under the \"Permissions\" tab, select the relevant policy and remove unnecessary permissions by either editing the policy or replacing it (notice: editing a managed policy could affect other roles).",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic aws cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}