{
  "policyUpi": "",
  "policyId": "c32418c8-9baf-45c0-a75c-9dd55f237dd2",
  "policyType": "iam",
  "cloudType": "gcp",
  "severity": "medium",
  "name": "Third-Party Service Account with High Privileges at the Folder or Organization Level",
  "description": "Identifies instances of third-party vendor owned service accounts which are granted high privileges and may allow administrative access to your cloud environment. \\nThis increases the attack surface, as in case of a compromise of the vendor's environment, an attacker would gain elevated access to your account by abusing the service account permissions/",
  "rule.criteria": "c32418c8-9baf-45c0-a75c-9dd55f237dd2",
  "searchModel.query": "config from iam where dest.cloud.type = 'GCP' AND grantedby.cloud.entity.type = 'serviceaccount' AND action.access.isAdministrative = true AND source.cloud.account.isvendor = true AND grantedby.level.type IN ( 'GCP Organization', 'GCP Folder' )",
  "recommendation": "How to investigate?\n1. Sign in to the GCP Console\n2. Browse to the IAM service and search for the affected Service Account\n3. Examine the Service Account's roles and permissions as well as its use case - if needed reach out to the vendor to validate which permissions are necessary for their functions and why. You can reference GCP's 'excess permissions' on the same screen as further information\nIn order to remove any unnecessary permissions and minimize the role's access, use the following remediation steps:\nTo revoke the vendor's access altogether, select 'edit principal' and remove all the roles from the Service Account. To minimize the access the vendor has using the Service Account, remove all unnecessary roles and attach one with the minimal permissions needed by the vendor",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic gcp cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}