{
  "policyUpi": "",
  "policyId": "6d12f443-a0a3-4f2a-97ee-4be065612bd8",
  "policyType": "iam",
  "cloudType": "all",
  "severity": "medium",
  "name": "User account with excessive admin privileges",
  "description": "Identifies users which have administrative permissions that have not been used in the last 90 days. Users with administrative permissions are considered a valuable target for adversaries, and as such, it is good practice to limit them as much as possible.",
  "rule.criteria": "6d12f443-a0a3-4f2a-97ee-4be065612bd8",
  "searchModel.query": "config from iam where source.cloud.resource.type = 'user' AND action.access.isAdministrative = true AND action.lastaccess.days > 90",
  "recommendation": "How to investigate?\n1. In the Prisma Cloud Console, under the \"Alerts\" tab, take note of the \"Asset Name\". Then select the \"Alert ID\", then \"Investigate\"\n2. In the results, you will see the policy granting unused administrative permissions to the user (\"Granted By Policy\"), the specific unused permissions (\"Destination\"), and the last recorded event when the permissions were used by the user (\"Last Access\"). Prisma Cloud's event tracking period begins upon onboarding. As such, depending on the onboarding date, further investigation may be required using the cloud provider logs to determine last access\nOnce examining the permissions and determining which permissions are unnecessary and can be removed based on their last usage, in order to remove them, use the following remediation steps:\nLog in to your Cloud instance, navigate to the affected user, and edit the user's permissions following the principle of least privilege and based on the information collected.",
  "remediable": true,
  "remediation.cliScriptTemplate": "dynamic cli commands",
  "remediation.description": "List of CLI commands are generated dynamically based on the violating resource. Successful execution will limit the relevant permissions of the violating resource.",
  "remediation.impact": "limit the relevant permissions of the violating resource",
  "compliance.standard": ""
}